{"id": "2510.12904", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.12904", "abs": "https://arxiv.org/abs/2510.12904", "authors": ["Saurav Sharma", "Chinedu Innocent Nwoye", "Didier Mutter", "Nicolas Padoy"], "title": "State-Change Learning for Prediction of Future Events in Endoscopic Videos", "comment": "24 pages, 13 figures", "summary": "Surgical future prediction, driven by real-time AI analysis of surgical\nvideo, is critical for operating room safety and efficiency. It provides\nactionable insights into upcoming events, their timing, and risks-enabling\nbetter resource allocation, timely instrument readiness, and early warnings for\ncomplications (e.g., bleeding, bile duct injury). Despite this need, current\nsurgical AI research focuses on understanding what is happening rather than\npredicting future events. Existing methods target specific tasks in isolation,\nlacking unified approaches that span both short-term (action triplets, events)\nand long-term horizons (remaining surgery duration, phase transitions). These\nmethods rely on coarse-grained supervision while fine-grained surgical action\ntriplets and steps remain underexplored. Furthermore, methods based only on\nfuture feature prediction struggle to generalize across different surgical\ncontexts and procedures. We address these limits by reframing surgical future\nprediction as state-change learning. Rather than forecasting raw observations,\nour approach classifies state transitions between current and future timesteps.\nWe introduce SurgFUTR, implementing this through a teacher-student\narchitecture. Video clips are compressed into state representations via\nSinkhorn-Knopp clustering; the teacher network learns from both current and\nfuture clips, while the student network predicts future states from current\nvideos alone, guided by our Action Dynamics (ActDyn) module. We establish\nSFPBench with five prediction tasks spanning short-term (triplets, events) and\nlong-term (remaining surgery duration, phase and step transitions) horizons.\nExperiments across four datasets and three procedures show consistent\nimprovements. Cross-procedure transfer validates generalizability."}
{"id": "2510.12931", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.12931", "abs": "https://arxiv.org/abs/2510.12931", "authors": ["Sanghyun Byun", "Jung Ick Guack", "Mohanad Odema", "Baisub Lee", "Jacob Song", "Woo Seong Chung"], "title": "Unifying Vision-Language Latents for Zero-label Image Caption Enhancement", "comment": "Accepted to PMLR and NeurIPS 2025 UniReps", "summary": "Vision-language models (VLMs) achieve remarkable performance through\nlarge-scale image-text pretraining. However, their reliance on labeled image\ndatasets limits scalability and leaves vast amounts of unlabeled image data\nunderutilized. To address this, we propose Unified Vision-Language Alignment\nfor Zero-Label Enhancement (ViZer), an enhancement training framework that\nenables zero-label learning in image captioning, providing a practical starting\npoint for broader zero-label adaptation in vision-language tasks. Unlike prior\napproaches that rely on human or synthetically annotated datasets, ViZer\nactively aligns vision and language representation features during training,\nenabling existing VLMs to generate improved captions without requiring text\nlabels or full retraining. We demonstrate ViZer's advantage in qualitative\nevaluation, as automated caption metrics such as CIDEr and BERTScore often\npenalize details that are absent in reference captions. Applying ViZer on\nSmolVLM-Base and Qwen2-VL, we observe consistent qualitative improvements,\nproducing captions that are more grounded and descriptive than their baseline."}
{"id": "2510.12953", "categories": ["cs.CV", "cs.AI", "cs.IR", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.12953", "abs": "https://arxiv.org/abs/2510.12953", "authors": ["Xiao He", "Huangxuan Zhao", "Guojia Wan", "Wei Zhou", "Yanxing Liu", "Juhua Liu", "Yongchao Xu", "Yong Luo", "Dacheng Tao", "Bo Du"], "title": "Epistemic-aware Vision-Language Foundation Model for Fetal Ultrasound Interpretation", "comment": null, "summary": "Recent medical vision-language models have shown promise on tasks such as\nVQA, report generation, and anomaly detection. However, most are adapted to\nstructured adult imaging and underperform in fetal ultrasound, which poses\nchallenges of multi-view image reasoning, numerous diseases, and image\ndiversity. To bridge this gap, we introduce FetalMind, a medical AI system\ntailored to fetal ultrasound for both report generation and diagnosis. Guided\nby clinical workflow, we propose Salient Epistemic Disentanglement (SED), which\ninjects an expert-curated bipartite graph into the model to decouple\nview-disease associations and to steer preference selection along clinically\nfaithful steps via reinforcement learning. This design mitigates variability\nacross diseases and heterogeneity across views, reducing learning bottlenecks\nwhile aligning the model's inference with obstetric practice. To train\nFetalMind at scale, we curate FetalSigma-1M dataset, the first large-scale\nfetal ultrasound report corpus, comprising 20K reports from twelve medical\ncenters, addressing the scarcity of domain data. Extensive experiments show\nthat FetalMind outperforms open- and closed-source baselines across all\ngestational stages, achieving +14% average gains and +61.2% higher accuracy on\ncritical conditions while remaining efficient, stable, and scalable. Project\nPage: https://hexiao0275.github.io/FetalMind."}
{"id": "2510.12974", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.12974", "abs": "https://arxiv.org/abs/2510.12974", "authors": ["Tianyu Zhang", "Suyuchen Wang", "Chao Wang", "Juan Rodriguez", "Ahmed Masry", "Xiangru Jian", "Yoshua Bengio", "Perouz Taslakian"], "title": "Scope: Selective Cross-modal Orchestration of Visual Perception Experts", "comment": "14 pages, 2 figures", "summary": "Vision-language models (VLMs) benefit from multiple vision encoders, but\nnaively stacking them yields diminishing returns while multiplying inference\ncosts. We propose SCOPE, a Mixture-of-Encoders (MoEnc) framework that\ndynamically selects one specialized encoder per image-text pair via\ninstance-level routing, unlike token-level routing in traditional MoE. SCOPE\nmaintains a shared encoder and a pool of routed encoders. A lightweight router\nuses cross-attention between text prompts and shared visual features to select\nthe optimal encoder from the routed encoders. To train this router, we\nintroduce dual entropy regularization with auxiliary losses to balance\ndataset-level load distribution with instance-level routing confidence.\nRemarkably, SCOPE with one shared plus one routed encoder outperforms models\nusing all four extra encoders simultaneously, while reducing compute by\n24-49\\%. This demonstrates that intelligent encoder selection beats brute-force\naggregation, challenging the prevailing paradigm in multi-encoder VLMs."}
{"id": "2510.12807", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.12807", "abs": "https://arxiv.org/abs/2510.12807", "authors": ["Mahdi Cherakhloo", "Arash Abbasi", "Mohammad Saeid Sarafraz", "Bijan Vosoughi Vahdat"], "title": "Benchmarking Open-Source Large Language Models for Persian in Zero-Shot and Few-Shot Learning", "comment": null, "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities across\nnumerous languages; however, their effectiveness in low-resource languages like\nPersian requires thorough investigation. This paper presents a comprehensive\nbenchmark of several open-source LLMs for Persian Natural Language Processing\n(NLP) tasks, utilizing both zero-shot and few-shot learning paradigms. We\nevaluate models across a range of tasks including sentiment analysis, named\nentity recognition, reading comprehension, and question answering, using\nestablished Persian datasets such as ParsiNLU and ArmanEmo. Our methodology\nencompasses rigorous experimental setups for both zero-shot and few-shot\nscenarios, employing metrics such as Accuracy, F1-score, BLEU, and ROUGE for\nperformance evaluation. The results reveal that Gemma 2 consistently\noutperforms other models across nearly all tasks in both learning paradigms,\nwith particularly strong performance in complex reasoning tasks. However, most\nmodels struggle with token-level understanding tasks like Named Entity\nRecognition, highlighting specific challenges in Persian language processing.\nThis study contributes to the growing body of research on multilingual LLMs,\nproviding valuable insights into their performance in Persian and offering a\nbenchmark for future model development."}
{"id": "2510.12864", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.12864", "abs": "https://arxiv.org/abs/2510.12864", "authors": ["Imran Khan"], "title": "From Literal to Liberal: A Meta-Prompting Framework for Eliciting Human-Aligned Exception Handling in Large Language Models", "comment": "13 pages. Code and data are available at\n  https://github.com/strongSoda/LITERAL-TO-LIBERAL", "summary": "Large Language Models (LLMs) are increasingly being deployed as the reasoning\nengines for agentic AI systems, yet they exhibit a critical flaw: a rigid\nadherence to explicit rules that leads to decisions misaligned with human\ncommon sense and intent. This \"rule-rigidity\" is a significant barrier to\nbuilding trustworthy autonomous agents. While prior work has shown that\nsupervised fine-tuning (SFT) with human explanations can mitigate this issue,\nSFT is computationally expensive and inaccessible to many practitioners. To\naddress this gap, we introduce the Rule-Intent Distinction (RID) Framework, a\nnovel, low-compute meta-prompting technique designed to elicit human-aligned\nexception handling in LLMs in a zero-shot manner. The RID framework provides\nthe model with a structured cognitive schema for deconstructing tasks,\nclassifying rules, weighing conflicting outcomes, and justifying its final\ndecision. We evaluated the RID framework against baseline and Chain-of-Thought\n(CoT) prompting on a custom benchmark of 20 scenarios requiring nuanced\njudgment across diverse domains. Our human-verified results demonstrate that\nthe RID framework significantly improves performance, achieving a 95% Human\nAlignment Score (HAS), compared to 80% for the baseline and 75% for CoT.\nFurthermore, it consistently produces higher-quality, intent-driven reasoning.\nThis work presents a practical, accessible, and effective method for steering\nLLMs from literal instruction-following to liberal, goal-oriented reasoning,\npaving the way for more reliable and pragmatic AI agents."}
{"id": "2510.13016", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13016", "abs": "https://arxiv.org/abs/2510.13016", "authors": ["Tanveer Hannan", "Shuaicong Wu", "Mark Weber", "Suprosanna Shit", "Jindong Gu", "Rajat Koner", "Aljoša Ošep", "Laura Leal-Taixé", "Thomas Seidl"], "title": "SVAG-Bench: A Large-Scale Benchmark for Multi-Instance Spatio-temporal Video Action Grounding", "comment": null, "summary": "Understanding fine-grained actions and accurately localizing their\ncorresponding actors in space and time are fundamental capabilities for\nadvancing next-generation AI systems, including embodied agents, autonomous\nplatforms, and human-AI interaction frameworks. Despite recent progress in\nvideo understanding, existing methods predominantly address either\ncoarse-grained action recognition or generic object tracking, thereby\noverlooking the challenge of jointly detecting and tracking multiple objects\naccording to their actions while grounding them temporally. To address this\ngap, we introduce Spatio-temporal Video Action Grounding (SVAG), a novel task\nthat requires models to simultaneously detect, track, and temporally localize\nall referent objects in videos based on natural language descriptions of their\nactions. To support this task, we construct SVAG-Bench, a large-scale benchmark\ncomprising 688 videos, 19,590 annotated records, and 903 unique verbs, covering\na diverse range of objects, actions, and real-world scenes. We further propose\nSVAGFormer, a baseline framework that adapts state of the art vision language\nmodels for joint spatial and temporal grounding, and introduce SVAGEval, a\nstandardized evaluation toolkit for fair and reproducible benchmarking.\nEmpirical results show that existing models perform poorly on SVAG,\nparticularly in dense or complex scenes, underscoring the need for more\nadvanced reasoning over fine-grained object-action interactions in long videos."}
{"id": "2510.12845", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.12845", "abs": "https://arxiv.org/abs/2510.12845", "authors": ["Jesse Atuhurra", "Iqra Ali", "Tomoya Iwakura", "Hidetaka Kamigaito", "Tatsuya Hiraoka"], "title": "VLURes: Benchmarking VLM Visual and Linguistic Understanding in Low-Resource Languages", "comment": null, "summary": "Vision Language Models (VLMs) are pivotal for advancing perception in\nintelligent agents. Yet, evaluation of VLMs remains limited to predominantly\nEnglish-centric benchmarks in which the image-text pairs comprise short texts.\nTo evaluate VLM fine-grained abilities, in four languages under long-text\nsettings, we introduce a novel multilingual benchmark VLURes featuring eight\nvision-and-language tasks, and a pioneering unrelatedness task, to probe the\nfine-grained Visual and Linguistic Understanding capabilities of VLMs across\nEnglish, Japanese, and low-resource languages, Swahili, and Urdu. Our datasets,\ncurated from web resources in the target language, encompass ten diverse image\ncategories and rich textual context, introducing valuable vision-language\nresources for Swahili and Urdu. By prompting VLMs to generate responses and\nrationales, evaluated automatically and by native speakers, we uncover\nperformance disparities across languages and tasks critical to intelligent\nagents, such as object recognition, scene understanding, and relationship\nunderstanding. We conducted evaluations of ten VLMs with VLURes. The best\nperforming model, GPT-4o, achieves an overall accuracy of 90.8% and lags human\nperformance by 6.7%, though the gap is larger for open-source models. The gap\nhighlights VLURes' critical role in developing intelligent agents to tackle\nmulti-modal visual reasoning."}
{"id": "2510.13029", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13029", "abs": "https://arxiv.org/abs/2510.13029", "authors": ["Xinlei Wang", "Mingtian Tan", "Jing Qiu", "Junhua Zhao", "Jinjin Gu"], "title": "Toward Reasoning-Centric Time-Series Analysis", "comment": null, "summary": "Traditional time series analysis has long relied on pattern recognition,\ntrained on static and well-established benchmarks. However, in real-world\nsettings -- where policies shift, human behavior adapts, and unexpected events\nunfold -- effective analysis must go beyond surface-level trends to uncover the\nactual forces driving them. The recent rise of Large Language Models (LLMs)\npresents new opportunities for rethinking time series analysis by integrating\nmultimodal inputs. However, as the use of LLMs becomes popular, we must remain\ncautious, asking why we use LLMs and how to exploit them effectively. Most\nexisting LLM-based methods still employ their numerical regression ability and\nignore their deeper reasoning potential. This paper argues for rethinking time\nseries with LLMs as a reasoning task that prioritizes causal structure and\nexplainability. This shift brings time series analysis closer to human-aligned\nunderstanding, enabling transparent and context-aware insights in complex\nreal-world environments."}
{"id": "2510.13084", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13084", "abs": "https://arxiv.org/abs/2510.13084", "authors": ["Yi Zuo", "Zitao Wang", "Lingling Li", "Xu Liu", "Fang Liu", "Licheng Jiao"], "title": "Edit-Your-Interest: Efficient Video Editing via Feature Most-Similar Propagation", "comment": "32 pages, 11 figures", "summary": "Text-to-image (T2I) diffusion models have recently demonstrated significant\nprogress in video editing.\n  However, existing video editing methods are severely limited by their high\ncomputational overhead and memory consumption.\n  Furthermore, these approaches often sacrifice visual fidelity, leading to\nundesirable temporal inconsistencies and artifacts such as blurring and\npronounced mosaic-like patterns.\n  We propose Edit-Your-Interest, a lightweight, text-driven, zero-shot video\nediting method.\n  Edit-Your-Interest introduces a spatio-temporal feature memory to cache\nfeatures from previous frames, significantly reducing computational overhead\ncompared to full-sequence spatio-temporal modeling approaches.\n  Specifically, we first introduce a Spatio-Temporal Feature Memory bank (SFM),\nwhich is designed to efficiently cache and retain the crucial image tokens\nprocessed by spatial attention.\n  Second, we propose the Feature Most-Similar Propagation (FMP) method. FMP\npropagates the most relevant tokens from previous frames to subsequent ones,\npreserving temporal consistency.\n  Finally, we introduce an SFM update algorithm that continuously refreshes the\ncached features, ensuring their long-term relevance and effectiveness\nthroughout the video sequence.\n  Furthermore, we leverage cross-attention maps to automatically extract masks\nfor the instances of interest.\n  These masks are seamlessly integrated into the diffusion denoising process,\nenabling fine-grained control over target objects and allowing\nEdit-Your-Interest to perform highly accurate edits while robustly preserving\nthe background integrity.\n  Extensive experiments decisively demonstrate that the proposed\nEdit-Your-Interest outperforms state-of-the-art methods in both efficiency and\nvisual fidelity, validating its superior effectiveness and practicality."}
{"id": "2510.13190", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.13190", "abs": "https://arxiv.org/abs/2510.13190", "authors": ["Juan Ren", "Mark Dras", "Usman Naseem"], "title": "SHIELD: Classifier-Guided Prompting for Robust and Safer LVLMs", "comment": "Preprint", "summary": "Large Vision-Language Models (LVLMs) unlock powerful multimodal reasoning but\nalso expand the attack surface, particularly through adversarial inputs that\nconceal harmful goals in benign prompts. We propose SHIELD, a lightweight,\nmodel-agnostic preprocessing framework that couples fine-grained safety\nclassification with category-specific guidance and explicit actions (Block,\nReframe, Forward). Unlike binary moderators, SHIELD composes tailored safety\nprompts that enforce nuanced refusals or safe redirection without retraining.\nAcross five benchmarks and five representative LVLMs, SHIELD consistently\nlowers jailbreak and non-following rates while preserving utility. Our method\nis plug-and-play, incurs negligible overhead, and is easily extendable to new\nattack types -- serving as a practical safety patch for both weakly and\nstrongly aligned LVLMs."}
{"id": "2510.12807", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.12807", "abs": "https://arxiv.org/abs/2510.12807", "authors": ["Mahdi Cherakhloo", "Arash Abbasi", "Mohammad Saeid Sarafraz", "Bijan Vosoughi Vahdat"], "title": "Benchmarking Open-Source Large Language Models for Persian in Zero-Shot and Few-Shot Learning", "comment": null, "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities across\nnumerous languages; however, their effectiveness in low-resource languages like\nPersian requires thorough investigation. This paper presents a comprehensive\nbenchmark of several open-source LLMs for Persian Natural Language Processing\n(NLP) tasks, utilizing both zero-shot and few-shot learning paradigms. We\nevaluate models across a range of tasks including sentiment analysis, named\nentity recognition, reading comprehension, and question answering, using\nestablished Persian datasets such as ParsiNLU and ArmanEmo. Our methodology\nencompasses rigorous experimental setups for both zero-shot and few-shot\nscenarios, employing metrics such as Accuracy, F1-score, BLEU, and ROUGE for\nperformance evaluation. The results reveal that Gemma 2 consistently\noutperforms other models across nearly all tasks in both learning paradigms,\nwith particularly strong performance in complex reasoning tasks. However, most\nmodels struggle with token-level understanding tasks like Named Entity\nRecognition, highlighting specific challenges in Persian language processing.\nThis study contributes to the growing body of research on multilingual LLMs,\nproviding valuable insights into their performance in Persian and offering a\nbenchmark for future model development."}
{"id": "2510.13105", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13105", "abs": "https://arxiv.org/abs/2510.13105", "authors": ["Xijun Wang", "Tanay Sharma", "Achin Kulshrestha", "Abhimitra Meka", "Aveek Purohit", "Dinesh Manocha"], "title": "EgoSocial: Benchmarking Proactive Intervention Ability of Omnimodal LLMs via Egocentric Social Interaction Perception", "comment": null, "summary": "As AR/VR technologies become integral to daily life, there's a growing need\nfor AI that understands human social dynamics from an egocentric perspective.\nHowever, current LLMs often lack the social awareness to discern when to\nintervene as AI assistant. This leads to constant, socially unaware responses\nthat may disrupt natural conversation and negatively impact user focus. To\naddress these limitations, we introduce EgoSocial, a large-scale egocentric\ndataset with 13,500 social video-question pairs, specifically designed to\nbenchmark intervention in social interaction perception. We also present an\nin-depth analysis of current omnimodal LLMs (OLLMs) to assess their\neffectiveness in detecting diverse social contextual cues. Experiments show\nthat OLLMs still struggle to detect the intervention timing (14.4% for Gemini\n2.5 Pro). We also propose EgoSoD (EgoSocial Detection), an end-to-end method\nfor robustly discerning social dynamics. Informed by our OLLM analysis, EgoSoD\nintegrates multimodal contextual cues (e.g., audio and visual cues) into a\nsocial thinking graph, dynamically modeling participants and interactions. Our\nmethod proactively detects intervention timing and social interactions,\nprecisely determining when to intervene. Our EgoSoD improves Phi-4 by 45.6% and\nGemini 2.5 Pro by 9.9% on Intervention Timing performance, and improves Phi-4\nby 20.4% and Gemini 2.5 Pro by 6.9% on overall Social Interaction performance.\nWe will release the dataset and code soon."}
{"id": "2510.13351", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13351", "abs": "https://arxiv.org/abs/2510.13351", "authors": ["Karthik Avinash", "Nikhil Pareek", "Rishav Hada"], "title": "Protect: Towards Robust Guardrailing Stack for Trustworthy Enterprise LLM Systems", "comment": null, "summary": "The increasing deployment of Large Language Models (LLMs) across enterprise\nand mission-critical domains has underscored the urgent need for robust\nguardrailing systems that ensure safety, reliability, and compliance. Existing\nsolutions often struggle with real-time oversight, multi-modal data handling,\nand explainability -- limitations that hinder their adoption in regulated\nenvironments. Existing guardrails largely operate in isolation, focused on text\nalone making them inadequate for multi-modal, production-scale environments. We\nintroduce Protect, natively multi-modal guardrailing model designed to operate\nseamlessly across text, image, and audio inputs, designed for enterprise-grade\ndeployment. Protect integrates fine-tuned, category-specific adapters trained\nvia Low-Rank Adaptation (LoRA) on an extensive, multi-modal dataset covering\nfour safety dimensions: toxicity, sexism, data privacy, and prompt injection.\nOur teacher-assisted annotation pipeline leverages reasoning and explanation\ntraces to generate high-fidelity, context-aware labels across modalities.\nExperimental results demonstrate state-of-the-art performance across all safety\ndimensions, surpassing existing open and proprietary models such as WildGuard,\nLlamaGuard-4, and GPT-4.1. Protect establishes a strong foundation for\ntrustworthy, auditable, and production-ready safety systems capable of\noperating across text, image, and audio modalities."}
{"id": "2510.12845", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.12845", "abs": "https://arxiv.org/abs/2510.12845", "authors": ["Jesse Atuhurra", "Iqra Ali", "Tomoya Iwakura", "Hidetaka Kamigaito", "Tatsuya Hiraoka"], "title": "VLURes: Benchmarking VLM Visual and Linguistic Understanding in Low-Resource Languages", "comment": null, "summary": "Vision Language Models (VLMs) are pivotal for advancing perception in\nintelligent agents. Yet, evaluation of VLMs remains limited to predominantly\nEnglish-centric benchmarks in which the image-text pairs comprise short texts.\nTo evaluate VLM fine-grained abilities, in four languages under long-text\nsettings, we introduce a novel multilingual benchmark VLURes featuring eight\nvision-and-language tasks, and a pioneering unrelatedness task, to probe the\nfine-grained Visual and Linguistic Understanding capabilities of VLMs across\nEnglish, Japanese, and low-resource languages, Swahili, and Urdu. Our datasets,\ncurated from web resources in the target language, encompass ten diverse image\ncategories and rich textual context, introducing valuable vision-language\nresources for Swahili and Urdu. By prompting VLMs to generate responses and\nrationales, evaluated automatically and by native speakers, we uncover\nperformance disparities across languages and tasks critical to intelligent\nagents, such as object recognition, scene understanding, and relationship\nunderstanding. We conducted evaluations of ten VLMs with VLURes. The best\nperforming model, GPT-4o, achieves an overall accuracy of 90.8% and lags human\nperformance by 6.7%, though the gap is larger for open-source models. The gap\nhighlights VLURes' critical role in developing intelligent agents to tackle\nmulti-modal visual reasoning."}
{"id": "2510.13108", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.13108", "abs": "https://arxiv.org/abs/2510.13108", "authors": ["Jingyu Song", "Zhenxin Li", "Shiyi Lan", "Xinglong Sun", "Nadine Chang", "Maying Shen", "Joshua Chen", "Katherine A. Skinner", "Jose M. Alvarez"], "title": "DriveCritic: Towards Context-Aware, Human-Aligned Evaluation for Autonomous Driving with Vision-Language Models", "comment": "9 pages, 3 figures", "summary": "Benchmarking autonomous driving planners to align with human judgment remains\na critical challenge, as state-of-the-art metrics like the Extended Predictive\nDriver Model Score (EPDMS) lack context awareness in nuanced scenarios. To\naddress this, we introduce DriveCritic, a novel framework featuring two key\ncontributions: the DriveCritic dataset, a curated collection of challenging\nscenarios where context is critical for correct judgment and annotated with\npairwise human preferences, and the DriveCritic model, a Vision-Language Model\n(VLM) based evaluator. Fine-tuned using a two-stage supervised and\nreinforcement learning pipeline, the DriveCritic model learns to adjudicate\nbetween trajectory pairs by integrating visual and symbolic context.\nExperiments show DriveCritic significantly outperforms existing metrics and\nbaselines in matching human preferences and demonstrates strong context\nawareness. Overall, our work provides a more reliable, human-aligned foundation\nto evaluating autonomous driving systems."}
{"id": "2510.13366", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13366", "abs": "https://arxiv.org/abs/2510.13366", "authors": ["Weishi Wang", "Hengchang Hu", "Zhijie Zhang", "Zhaochen Li", "Hongxin Shao", "Daniel Dahlmeier"], "title": "Document Intelligence in the Era of Large Language Models: A Survey", "comment": null, "summary": "Document AI (DAI) has emerged as a vital application area, and is\nsignificantly transformed by the advent of large language models (LLMs). While\nearlier approaches relied on encoder-decoder architectures, decoder-only LLMs\nhave revolutionized DAI, bringing remarkable advancements in understanding and\ngeneration. This survey provides a comprehensive overview of DAI's evolution,\nhighlighting current research attempts and future prospects of LLMs in this\nfield. We explore key advancements and challenges in multimodal, multilingual,\nand retrieval-augmented DAI, while also suggesting future research directions,\nincluding agent-based approaches and document-specific foundation models. This\npaper aims to provide a structured analysis of the state-of-the-art in DAI and\nits implications for both academic and practical applications."}
{"id": "2510.12953", "categories": ["cs.CV", "cs.AI", "cs.IR", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.12953", "abs": "https://arxiv.org/abs/2510.12953", "authors": ["Xiao He", "Huangxuan Zhao", "Guojia Wan", "Wei Zhou", "Yanxing Liu", "Juhua Liu", "Yongchao Xu", "Yong Luo", "Dacheng Tao", "Bo Du"], "title": "Epistemic-aware Vision-Language Foundation Model for Fetal Ultrasound Interpretation", "comment": null, "summary": "Recent medical vision-language models have shown promise on tasks such as\nVQA, report generation, and anomaly detection. However, most are adapted to\nstructured adult imaging and underperform in fetal ultrasound, which poses\nchallenges of multi-view image reasoning, numerous diseases, and image\ndiversity. To bridge this gap, we introduce FetalMind, a medical AI system\ntailored to fetal ultrasound for both report generation and diagnosis. Guided\nby clinical workflow, we propose Salient Epistemic Disentanglement (SED), which\ninjects an expert-curated bipartite graph into the model to decouple\nview-disease associations and to steer preference selection along clinically\nfaithful steps via reinforcement learning. This design mitigates variability\nacross diseases and heterogeneity across views, reducing learning bottlenecks\nwhile aligning the model's inference with obstetric practice. To train\nFetalMind at scale, we curate FetalSigma-1M dataset, the first large-scale\nfetal ultrasound report corpus, comprising 20K reports from twelve medical\ncenters, addressing the scarcity of domain data. Extensive experiments show\nthat FetalMind outperforms open- and closed-source baselines across all\ngestational stages, achieving +14% average gains and +61.2% higher accuracy on\ncritical conditions while remaining efficient, stable, and scalable. Project\nPage: https://hexiao0275.github.io/FetalMind."}
{"id": "2510.13131", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.13131", "abs": "https://arxiv.org/abs/2510.13131", "authors": ["Rongjun Chen", "Chengsi Yao", "Jinchang Ren", "Xianxian Zeng", "Peixian Wang", "Jun Yuan", "Jiawen Li", "Huimin Zhao", "Xu Lu"], "title": "OS-HGAdapter: Open Semantic Hypergraph Adapter for Large Language Models Assisted Entropy-Enhanced Image-Text Alignment", "comment": null, "summary": "Text-image alignment constitutes a foundational challenge in multimedia\ncontent understanding, where effective modeling of cross-modal semantic\ncorrespondences critically enhances retrieval system performance through joint\nembedding space optimization. Given the inherent difference in information\nentropy between texts and images, conventional approaches often show an\nimbalance in the mutual retrieval of these two modalities. To address this\nparticular challenge, we propose to use the open semantic knowledge of Large\nLanguage Model (LLM) to fill for the entropy gap and reproduce the alignment\nability of humans in these tasks. Our entropy-enhancing alignment is achieved\nthrough a two-step process: 1) a new prompt template that does not rely on\nexplicit knowledge in the task domain is designed to use LLM to enhance the\npolysemy description of the text modality. By analogy, the information entropy\nof the text modality relative to the visual modality is increased; 2) A\nhypergraph adapter is used to construct multilateral connections between the\ntext and image modalities, which can correct the positive and negative matching\nerrors for synonymous semantics in the same fixed embedding space, whilst\nreducing the noise caused by open semantic entropy by mapping the reduced\ndimensions back to the original dimensions. Comprehensive evaluations on the\nFlickr30K and MS-COCO benchmarks validate the superiority of our Open Semantic\nHypergraph Adapter (OS-HGAdapter), showcasing 16.8\\% (text-to-image) and 40.1\\%\n(image-to-text) cross-modal retrieval gains over existing methods while\nestablishing new state-of-the-art performance in semantic alignment tasks."}
{"id": "2510.13554", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.13554", "abs": "https://arxiv.org/abs/2510.13554", "authors": ["Yang Li", "Zhichen Dong", "Yuhan Sun", "Weixun Wang", "Shaopan Xiong", "Yijia Luo", "Jiashun Liu", "Han Lu", "Jiamang Wang", "Wenbo Su", "Bo Zheng", "Junchi Yan"], "title": "Attention Illuminates LLM Reasoning: The Preplan-and-Anchor Rhythm Enables Fine-Grained Policy Optimization", "comment": "23 pages, 8 figures, 5 tables", "summary": "The reasoning pattern of Large language models (LLMs) remains opaque, and\nReinforcement learning (RL) typically applies uniform credit across an entire\ngeneration, blurring the distinction between pivotal and routine steps. This\nwork positions attention as a privileged substrate that renders the internal\nlogic of LLMs legible, not merely as a byproduct of computation, but as a\nmechanistic blueprint of reasoning itself. We first distinguish attention heads\nbetween locally and globally focused information processing and reveal that\nlocally focused heads produce a sawtooth pattern near the diagonal indicating\nphrasal chunks, while globally focused heads expose tokens that exert broad\ndownstream influence over future tokens. We formalize these with two metrics:\n1) Windowed Average Attention Distance, which measures the extent of backward\nattention within a clipped window; 2) Future Attention Influence, which\nquantifies a token's global importance as the average attention it receives\nfrom subsequent tokens. Taken together, these signals reveal a recurring\npreplan-and-anchor mechanism, where the model first performs a long-range\ncontextual reference to generate an introductory token, which is immediately\nfollowed by or coincides with a semantic anchor token that organizes subsequent\nreasoning. Leveraging these insights, we introduce three novel RL strategies\nthat dynamically perform targeted credit assignment to critical nodes (preplan\ntokens, anchor tokens, and their temporal coupling) and show consistent\nperformance gains across various reasoning tasks. By aligning optimization with\nthe model's intrinsic reasoning rhythm, we aim to transform opaque optimization\ninto an actionable structure-aware process, hoping to offer a potential step\ntoward more transparent and effective optimization of LLM reasoning."}
{"id": "2510.13108", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.13108", "abs": "https://arxiv.org/abs/2510.13108", "authors": ["Jingyu Song", "Zhenxin Li", "Shiyi Lan", "Xinglong Sun", "Nadine Chang", "Maying Shen", "Joshua Chen", "Katherine A. Skinner", "Jose M. Alvarez"], "title": "DriveCritic: Towards Context-Aware, Human-Aligned Evaluation for Autonomous Driving with Vision-Language Models", "comment": "9 pages, 3 figures", "summary": "Benchmarking autonomous driving planners to align with human judgment remains\na critical challenge, as state-of-the-art metrics like the Extended Predictive\nDriver Model Score (EPDMS) lack context awareness in nuanced scenarios. To\naddress this, we introduce DriveCritic, a novel framework featuring two key\ncontributions: the DriveCritic dataset, a curated collection of challenging\nscenarios where context is critical for correct judgment and annotated with\npairwise human preferences, and the DriveCritic model, a Vision-Language Model\n(VLM) based evaluator. Fine-tuned using a two-stage supervised and\nreinforcement learning pipeline, the DriveCritic model learns to adjudicate\nbetween trajectory pairs by integrating visual and symbolic context.\nExperiments show DriveCritic significantly outperforms existing metrics and\nbaselines in matching human preferences and demonstrates strong context\nawareness. Overall, our work provides a more reliable, human-aligned foundation\nto evaluating autonomous driving systems."}
{"id": "2510.13151", "categories": ["cs.CV", "cs.GR", "I.2.10; I.4"], "pdf": "https://arxiv.org/pdf/2510.13151", "abs": "https://arxiv.org/abs/2510.13151", "authors": ["Lifeng Qiu Lin", "Henry Kam", "Qi Sun", "Kaan Akşit"], "title": "Foveation Improves Payload Capacity in Steganography", "comment": "SIGGRAPH Asia 2025 Posters Proceedings", "summary": "Steganography finds its use in visual medium such as providing metadata and\nwatermarking. With support of efficient latent representations and foveated\nrendering, we trained models that improve existing capacity limits from 100 to\n500 bits, while achieving better accuracy of up to 1 failure bit out of 2000,\nat 200K test bits. Finally, we achieve a comparable visual quality of 31.47 dB\nPSNR and 0.13 LPIPS, showing the effectiveness of novel perceptual design in\ncreating multi-modal latent representations in steganography."}
{"id": "2510.13632", "categories": ["cs.CL", "cs.AI", "eess.AS"], "pdf": "https://arxiv.org/pdf/2510.13632", "abs": "https://arxiv.org/abs/2510.13632", "authors": ["Santiago Cuervo", "Skyler Seto", "Maureen de Seyssel", "Richard He Bai", "Zijin Gu", "Tatiana Likhomanenko", "Navdeep Jaitly", "Zakaria Aldeneh"], "title": "Closing the Gap Between Text and Speech Understanding in LLMs", "comment": null, "summary": "Large Language Models (LLMs) can be adapted to extend their text capabilities\nto speech inputs. However, these speech-adapted LLMs consistently underperform\ntheir text-based counterparts--and even cascaded pipelines--on language\nunderstanding tasks. We term this shortfall the text-speech understanding gap:\nthe performance drop observed when a speech-adapted LLM processes spoken inputs\nrelative to when the original text-based LLM processes the equivalent text.\nRecent approaches to narrowing this gap either rely on large-scale speech\nsynthesis of text corpora, which is costly and heavily dependent on synthetic\ndata, or on large-scale proprietary speech datasets, which are not\nreproducible. As a result, there remains a need for more data-efficient\nalternatives for closing the text-speech understanding gap. In this work, we\nanalyze the gap as driven by two factors: (i) forgetting of text capabilities\nduring adaptation, and (ii) cross-modal misalignment between speech and text.\nBased on this analysis, we introduce SALAD--Sample-efficient Alignment with\nLearning through Active selection and cross-modal Distillation--which combines\ncross-modal distillation with targeted synthetic data to improve alignment\nwhile mitigating forgetting. Applied to 3B and 7B LLMs, SALAD achieves\ncompetitive performance with a strong open-weight model across broad-domain\nbenchmarks in knowledge, language understanding, and reasoning, while training\non over an order of magnitude less speech data from public corpora."}
{"id": "2510.13232", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13232", "abs": "https://arxiv.org/abs/2510.13232", "authors": ["Inha Kang", "Youngsun Lim", "Seonho Lee", "Jiho Choi", "Junsuk Choe", "Hyunjung Shim"], "title": "What \"Not\" to Detect: Negation-Aware VLMs via Structured Reasoning and Token Merging", "comment": "38 pages", "summary": "State-of-the-art vision-language models (VLMs) suffer from a critical failure\nin understanding negation, often referred to as affirmative bias. This\nlimitation is particularly severe in described object detection (DOD) tasks. To\naddress this, we propose two primary contributions: (1) a new dataset pipeline\nand (2) a novel, lightweight adaptation recipe. First, we introduce CoVAND, a\ndataset constructed with a systematic chain-of-thought (CoT) and VQA-based\npipeline to generate high-quality, instance-grounded negation data. Second, we\npropose NegToMe, a novel text token merging module that directly tackles the\narchitectural cause of affirmative bias. NegToMe fundamentally addresses the\nstructural loss of negation cues in tokenization, grouping them with attributes\ninto coherent semantic phrases. It maintains correct polarity at the input\nlevel, enabling robust negation understanding even with limited data. For\ninstance, to prevent a model from treating the fragmented tokens \"not\" and\n\"girl\" as simply \"girl\", NegToMe binds them into a single token whose meaning\nis correctly distinguished from that of \"girl\" alone. This module is integrated\nwith a parameter-efficient and strategic LoRA fine-tuning approach. Our method\nsignificantly improves performance on challenging negation benchmarks with a\nlowered false positive rate, boosting NMS-AP by up to +10.8 points on OVDEval\nand demonstrating generalization to SoTA VLMs. This work marks a crucial step\nforward in addressing negation understanding for real-world detection\napplications."}
{"id": "2510.13219", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13219", "abs": "https://arxiv.org/abs/2510.13219", "authors": ["Xi Xiao", "Yunbei Zhang", "Lin Zhao", "Yiyang Liu", "Xiaoying Liao", "Zheda Mai", "Xingjian Li", "Xiao Wang", "Hao Xu", "Jihun Hamm", "Xue Lin", "Min Xu", "Qifan Wang", "Tianyang Wang", "Cheng Han"], "title": "Prompt-based Adaptation in Large-scale Vision Models: A Survey", "comment": null, "summary": "In computer vision, Visual Prompting (VP) and Visual Prompt Tuning (VPT) have\nrecently emerged as lightweight and effective alternatives to full fine-tuning\nfor adapting large-scale vision models within the ``pretrain-then-finetune''\nparadigm. However, despite rapid progress, their conceptual boundaries remain\nblurred, as VP and VPT are frequently used interchangeably in current research,\nreflecting a lack of systematic distinction between these techniques and their\nrespective applications. In this survey, we revisit the designs of VP and VPT\nfrom first principles, and conceptualize them within a unified framework termed\nPrompt-based Adaptation (PA). We provide a taxonomy that categorizes existing\nmethods into learnable, generative, and non-learnable prompts, and further\norganizes them by injection granularity -- pixel-level and token-level. Beyond\nthe core methodologies, we examine PA's integrations across diverse domains,\nincluding medical imaging, 3D point clouds, and vision-language tasks, as well\nas its role in test-time adaptation and trustworthy AI. We also summarize\ncurrent benchmarks and identify key challenges and future directions. To the\nbest of our knowledge, we are the first comprehensive survey dedicated to PA's\nmethodologies and applications in light of their distinct characteristics. Our\nsurvey aims to provide a clear roadmap for researchers and practitioners in all\narea to understand and explore the evolving landscape of PA-related research."}
{"id": "2510.13721", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.13721", "abs": "https://arxiv.org/abs/2510.13721", "authors": ["Run Luo", "Xiaobo Xia", "Lu Wang", "Longze Chen", "Renke Shan", "Jing Luo", "Min Yang", "Tat-Seng Chua"], "title": "NExT-OMNI: Towards Any-to-Any Omnimodal Foundation Models with Discrete Flow Matching", "comment": null, "summary": "Next-generation multimodal foundation models capable of any-to-any\ncross-modal generation and multi-turn interaction will serve as core components\nof artificial general intelligence systems, playing a pivotal role in\nhuman-machine interaction. However, most existing multimodal models remain\nconstrained by autoregressive architectures, whose inherent limitations prevent\na balanced integration of understanding and generation capabilities. Although\nhybrid and decoupling strategies have been explored to address these tasks\nwithin unified frameworks separately, their redundant, non-integrated designs\nlimit their applicability to broader scenarios, such as cross-modal\nretrieval.In this work, we introduce NExT-OMNI, an open-source omnimodal\nfoundation model that achieves unified modeling through discrete flow\nparadigms. By leveraging metric-induced probability paths and kinetic optimal\nvelocities, NExT-OMNI natively supports any-to-any understanding and generation\nwith enhanced response efficiency, while enabling broader application scenarios\nthrough concise unified representations rather than task-decoupled designs.\nTrained on large-scale interleaved text, image, video, and audio data,\nNExT-OMNI delivers competitive performance on multimodal generation and\nunderstanding benchmarks, while outperforming prior unified models in\nmulti-turn multimodal interaction and cross-modal retrieval, highlighting its\narchitectural advantages as a next-generation multimodal foundation model. To\nadvance further research, we release training details, data protocols, and\nopen-source both the code and model checkpoints."}
{"id": "2510.13315", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13315", "abs": "https://arxiv.org/abs/2510.13315", "authors": ["Eun Woo Im", "Muhammad Kashif Ali", "Vivek Gupta"], "title": "Self-Augmented Visual Contrastive Decoding", "comment": null, "summary": "Large Vision-Language Models (LVLMs) have demonstrated remarkable multimodal\ncapabilities, but they inherit the tendency to hallucinate from their\nunderlying language models. While visual contrastive decoding has been proposed\nto mitigate this issue, existing methods often apply generic visual\naugmentations that disregard the specific context provided by the text query,\nlimiting their effectiveness. This study introduces a novel training-free\ndecoding strategy that addresses these limitations, featuring two key\ncontributions. First, a self-augmentation prompting strategy that leverages the\nintrinsic knowledge of the model to dynamically align semantics between the\nquery and the visual augmentation. Second, an adaptive thresholding algorithm\nthat adaptively adjusts next token candidate size based on the output sparsity,\nutilizing full information from the logit distribution. Extensive experiments\nacross four LVLMs and seven benchmarks demonstrate that the proposed decoding\nsignificantly enhances factual consistency compared to state-of-the-art\ndecoding methods. This work highlights the importance of integrating\nquery-dependent augmentation and entropy-aware decoding for improving effective\ngeneration of LVLMs."}
{"id": "2510.13232", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13232", "abs": "https://arxiv.org/abs/2510.13232", "authors": ["Inha Kang", "Youngsun Lim", "Seonho Lee", "Jiho Choi", "Junsuk Choe", "Hyunjung Shim"], "title": "What \"Not\" to Detect: Negation-Aware VLMs via Structured Reasoning and Token Merging", "comment": "38 pages", "summary": "State-of-the-art vision-language models (VLMs) suffer from a critical failure\nin understanding negation, often referred to as affirmative bias. This\nlimitation is particularly severe in described object detection (DOD) tasks. To\naddress this, we propose two primary contributions: (1) a new dataset pipeline\nand (2) a novel, lightweight adaptation recipe. First, we introduce CoVAND, a\ndataset constructed with a systematic chain-of-thought (CoT) and VQA-based\npipeline to generate high-quality, instance-grounded negation data. Second, we\npropose NegToMe, a novel text token merging module that directly tackles the\narchitectural cause of affirmative bias. NegToMe fundamentally addresses the\nstructural loss of negation cues in tokenization, grouping them with attributes\ninto coherent semantic phrases. It maintains correct polarity at the input\nlevel, enabling robust negation understanding even with limited data. For\ninstance, to prevent a model from treating the fragmented tokens \"not\" and\n\"girl\" as simply \"girl\", NegToMe binds them into a single token whose meaning\nis correctly distinguished from that of \"girl\" alone. This module is integrated\nwith a parameter-efficient and strategic LoRA fine-tuning approach. Our method\nsignificantly improves performance on challenging negation benchmarks with a\nlowered false positive rate, boosting NMS-AP by up to +10.8 points on OVDEval\nand demonstrating generalization to SoTA VLMs. This work marks a crucial step\nforward in addressing negation understanding for real-world detection\napplications."}
{"id": "2510.13796", "categories": ["cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13796", "abs": "https://arxiv.org/abs/2510.13796", "authors": ["Shuyu Wu", "Ziqiao Ma", "Xiaoxi Luo", "Yidong Huang", "Josue Torres-Fonseca", "Freda Shi", "Joyce Chai"], "title": "The Mechanistic Emergence of Symbol Grounding in Language Models", "comment": null, "summary": "Symbol grounding (Harnad, 1990) describes how symbols such as words acquire\ntheir meanings by connecting to real-world sensorimotor experiences. Recent\nwork has shown preliminary evidence that grounding may emerge in\n(vision-)language models trained at scale without using explicit grounding\nobjectives. Yet, the specific loci of this emergence and the mechanisms that\ndrive it remain largely unexplored. To address this problem, we introduce a\ncontrolled evaluation framework that systematically traces how symbol grounding\narises within the internal computations through mechanistic and causal\nanalysis. Our findings show that grounding concentrates in middle-layer\ncomputations and is implemented through the aggregate mechanism, where\nattention heads aggregate the environmental ground to support the prediction of\nlinguistic forms. This phenomenon replicates in multimodal dialogue and across\narchitectures (Transformers and state-space models), but not in unidirectional\nLSTMs. Our results provide behavioral and mechanistic evidence that symbol\ngrounding can emerge in language models, with practical implications for\npredicting and potentially controlling the reliability of generation."}
{"id": "2510.13351", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13351", "abs": "https://arxiv.org/abs/2510.13351", "authors": ["Karthik Avinash", "Nikhil Pareek", "Rishav Hada"], "title": "Protect: Towards Robust Guardrailing Stack for Trustworthy Enterprise LLM Systems", "comment": null, "summary": "The increasing deployment of Large Language Models (LLMs) across enterprise\nand mission-critical domains has underscored the urgent need for robust\nguardrailing systems that ensure safety, reliability, and compliance. Existing\nsolutions often struggle with real-time oversight, multi-modal data handling,\nand explainability -- limitations that hinder their adoption in regulated\nenvironments. Existing guardrails largely operate in isolation, focused on text\nalone making them inadequate for multi-modal, production-scale environments. We\nintroduce Protect, natively multi-modal guardrailing model designed to operate\nseamlessly across text, image, and audio inputs, designed for enterprise-grade\ndeployment. Protect integrates fine-tuned, category-specific adapters trained\nvia Low-Rank Adaptation (LoRA) on an extensive, multi-modal dataset covering\nfour safety dimensions: toxicity, sexism, data privacy, and prompt injection.\nOur teacher-assisted annotation pipeline leverages reasoning and explanation\ntraces to generate high-fidelity, context-aware labels across modalities.\nExperimental results demonstrate state-of-the-art performance across all safety\ndimensions, surpassing existing open and proprietary models such as WildGuard,\nLlamaGuard-4, and GPT-4.1. Protect establishes a strong foundation for\ntrustworthy, auditable, and production-ready safety systems capable of\noperating across text, image, and audio modalities."}
{"id": "2510.13235", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13235", "abs": "https://arxiv.org/abs/2510.13235", "authors": ["Yukuan Zhang", "Jiarui Zhao", "Shangqing Nie", "Jin Kuang", "Shengsheng Wang"], "title": "EPIPTrack: Rethinking Prompt Modeling with Explicit and Implicit Prompts for Multi-Object Tracking", "comment": null, "summary": "Multimodal semantic cues, such as textual descriptions, have shown strong\npotential in enhancing target perception for tracking. However, existing\nmethods rely on static textual descriptions from large language models, which\nlack adaptability to real-time target state changes and prone to\nhallucinations. To address these challenges, we propose a unified multimodal\nvision-language tracking framework, named EPIPTrack, which leverages explicit\nand implicit prompts for dynamic target modeling and semantic alignment.\nSpecifically, explicit prompts transform spatial motion information into\nnatural language descriptions to provide spatiotemporal guidance. Implicit\nprompts combine pseudo-words with learnable descriptors to construct\nindividualized knowledge representations capturing appearance attributes. Both\nprompts undergo dynamic adjustment via the CLIP text encoder to respond to\nchanges in target state. Furthermore, we design a Discriminative Feature\nAugmentor to enhance visual and cross-modal representations. Extensive\nexperiments on MOT17, MOT20, and DanceTrack demonstrate that EPIPTrack\noutperforms existing trackers in diverse scenarios, exhibiting robust\nadaptability and superior performance."}
{"id": "2510.12864", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.12864", "abs": "https://arxiv.org/abs/2510.12864", "authors": ["Imran Khan"], "title": "From Literal to Liberal: A Meta-Prompting Framework for Eliciting Human-Aligned Exception Handling in Large Language Models", "comment": "13 pages. Code and data are available at\n  https://github.com/strongSoda/LITERAL-TO-LIBERAL", "summary": "Large Language Models (LLMs) are increasingly being deployed as the reasoning\nengines for agentic AI systems, yet they exhibit a critical flaw: a rigid\nadherence to explicit rules that leads to decisions misaligned with human\ncommon sense and intent. This \"rule-rigidity\" is a significant barrier to\nbuilding trustworthy autonomous agents. While prior work has shown that\nsupervised fine-tuning (SFT) with human explanations can mitigate this issue,\nSFT is computationally expensive and inaccessible to many practitioners. To\naddress this gap, we introduce the Rule-Intent Distinction (RID) Framework, a\nnovel, low-compute meta-prompting technique designed to elicit human-aligned\nexception handling in LLMs in a zero-shot manner. The RID framework provides\nthe model with a structured cognitive schema for deconstructing tasks,\nclassifying rules, weighing conflicting outcomes, and justifying its final\ndecision. We evaluated the RID framework against baseline and Chain-of-Thought\n(CoT) prompting on a custom benchmark of 20 scenarios requiring nuanced\njudgment across diverse domains. Our human-verified results demonstrate that\nthe RID framework significantly improves performance, achieving a 95% Human\nAlignment Score (HAS), compared to 80% for the baseline and 75% for CoT.\nFurthermore, it consistently produces higher-quality, intent-driven reasoning.\nThis work presents a practical, accessible, and effective method for steering\nLLMs from literal instruction-following to liberal, goal-oriented reasoning,\npaving the way for more reliable and pragmatic AI agents."}
{"id": "2510.13364", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13364", "abs": "https://arxiv.org/abs/2510.13364", "authors": ["MingZe Tang", "Jubal Chandy Jacob"], "title": "Language as a Label: Zero-Shot Multimodal Classification of Everyday Postures under Data Scarcity", "comment": null, "summary": "Recent Vision-Language Models (VLMs) enable zero-shot classification by\naligning images and text in a shared space, a promising approach for\ndata-scarce conditions. However, the influence of prompt design on recognizing\nvisually similar categories, such as human postures, is not well understood.\nThis study investigates how prompt specificity affects the zero-shot\nclassification of sitting, standing, and walking/running on a small, 285-image\nCOCO-derived dataset. A suite of modern VLMs, including OpenCLIP, MetaCLIP 2,\nand SigLip, were evaluated using a three-tiered prompt design that\nsystematically increases linguistic detail. Our findings reveal a compelling,\ncounter-intuitive trend: for the highest-performing models (MetaCLIP 2 and\nOpenCLIP), the simplest, most basic prompts consistently achieve the best\nresults. Adding descriptive detail significantly degrades performance for\ninstance, MetaCLIP 2's multi-class accuracy drops from 68.8\\% to 55.1\\% a\nphenomenon we term \"prompt overfitting\". Conversely, the lower-performing\nSigLip model shows improved classification on ambiguous classes when given more\ndescriptive, body-cue-based prompts."}
{"id": "2510.13237", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.13237", "abs": "https://arxiv.org/abs/2510.13237", "authors": ["Haochuan Xu", "Yun Sing Koh", "Shuhuai Huang", "Zirun Zhou", "Di Wang", "Jun Sakuma", "Jingfeng Zhang"], "title": "Model-agnostic Adversarial Attack and Defense for Vision-Language-Action Models", "comment": null, "summary": "Vision-Language-Action (VLA) models have achieved revolutionary progress in\nrobot learning, enabling robots to execute complex physical robot tasks from\nnatural language instructions. Despite this progress, their adversarial\nrobustness remains underexplored. In this work, we propose both adversarial\npatch attack and corresponding defense strategies for VLA models. We first\nintroduce the Embedding Disruption Patch Attack (EDPA), a model-agnostic\nadversarial attack that generates patches directly placeable within the\ncamera's view. In comparison to prior methods, EDPA can be readily applied to\ndifferent VLA models without requiring prior knowledge of the model\narchitecture, or the controlled robotic manipulator. EDPA constructs these\npatches by (i) disrupting the semantic alignment between visual and textual\nlatent representations, and (ii) maximizing the discrepancy of latent\nrepresentations between adversarial and corresponding clean visual inputs.\nThrough the optimization of these objectives, EDPA distorts the VLA's\ninterpretation of visual information, causing the model to repeatedly generate\nincorrect actions and ultimately result in failure to complete the given\nrobotic task. To counter this, we propose an adversarial fine-tuning scheme for\nthe visual encoder, in which the encoder is optimized to produce similar latent\nrepresentations for both clean and adversarially perturbed visual inputs.\nExtensive evaluations on the widely recognized LIBERO robotic simulation\nbenchmark demonstrate that EDPA substantially increases the task failure rate\nof cutting-edge VLA models, while our proposed defense effectively mitigates\nthis degradation. The codebase is accessible via the homepage at\nhttps://edpa-attack.github.io/."}
{"id": "2510.12931", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.12931", "abs": "https://arxiv.org/abs/2510.12931", "authors": ["Sanghyun Byun", "Jung Ick Guack", "Mohanad Odema", "Baisub Lee", "Jacob Song", "Woo Seong Chung"], "title": "Unifying Vision-Language Latents for Zero-label Image Caption Enhancement", "comment": "Accepted to PMLR and NeurIPS 2025 UniReps", "summary": "Vision-language models (VLMs) achieve remarkable performance through\nlarge-scale image-text pretraining. However, their reliance on labeled image\ndatasets limits scalability and leaves vast amounts of unlabeled image data\nunderutilized. To address this, we propose Unified Vision-Language Alignment\nfor Zero-Label Enhancement (ViZer), an enhancement training framework that\nenables zero-label learning in image captioning, providing a practical starting\npoint for broader zero-label adaptation in vision-language tasks. Unlike prior\napproaches that rely on human or synthetically annotated datasets, ViZer\nactively aligns vision and language representation features during training,\nenabling existing VLMs to generate improved captions without requiring text\nlabels or full retraining. We demonstrate ViZer's advantage in qualitative\nevaluation, as automated caption metrics such as CIDEr and BERTScore often\npenalize details that are absent in reference captions. Applying ViZer on\nSmolVLM-Base and Qwen2-VL, we observe consistent qualitative improvements,\nproducing captions that are more grounded and descriptive than their baseline."}
{"id": "2510.13366", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13366", "abs": "https://arxiv.org/abs/2510.13366", "authors": ["Weishi Wang", "Hengchang Hu", "Zhijie Zhang", "Zhaochen Li", "Hongxin Shao", "Daniel Dahlmeier"], "title": "Document Intelligence in the Era of Large Language Models: A Survey", "comment": null, "summary": "Document AI (DAI) has emerged as a vital application area, and is\nsignificantly transformed by the advent of large language models (LLMs). While\nearlier approaches relied on encoder-decoder architectures, decoder-only LLMs\nhave revolutionized DAI, bringing remarkable advancements in understanding and\ngeneration. This survey provides a comprehensive overview of DAI's evolution,\nhighlighting current research attempts and future prospects of LLMs in this\nfield. We explore key advancements and challenges in multimodal, multilingual,\nand retrieval-augmented DAI, while also suggesting future research directions,\nincluding agent-based approaches and document-specific foundation models. This\npaper aims to provide a structured analysis of the state-of-the-art in DAI and\nits implications for both academic and practical applications."}
{"id": "2510.13243", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13243", "abs": "https://arxiv.org/abs/2510.13243", "authors": ["Francesco Barbato", "Matteo Caligiuri", "Pietro Zanuttigh"], "title": "FlyAwareV2: A Multimodal Cross-Domain UAV Dataset for Urban Scene Understanding", "comment": "20 pages, 7 figures, 10 tables, data and code available", "summary": "The development of computer vision algorithms for Unmanned Aerial Vehicle\n(UAV) applications in urban environments heavily relies on the availability of\nlarge-scale datasets with accurate annotations. However, collecting and\nannotating real-world UAV data is extremely challenging and costly. To address\nthis limitation, we present FlyAwareV2, a novel multimodal dataset encompassing\nboth real and synthetic UAV imagery tailored for urban scene understanding\ntasks. Building upon the recently introduced SynDrone and FlyAware datasets,\nFlyAwareV2 introduces several new key contributions: 1) Multimodal data (RGB,\ndepth, semantic labels) across diverse environmental conditions including\nvarying weather and daytime; 2) Depth maps for real samples computed via\nstate-of-the-art monocular depth estimation; 3) Benchmarks for RGB and\nmultimodal semantic segmentation on standard architectures; 4) Studies on\nsynthetic-to-real domain adaptation to assess the generalization capabilities\nof models trained on the synthetic data. With its rich set of annotations and\nenvironmental diversity, FlyAwareV2 provides a valuable resource for research\non UAV-based 3D urban scene understanding."}
{"id": "2510.13276", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.13276", "abs": "https://arxiv.org/abs/2510.13276", "authors": ["Keyan Zhou", "Zecheng Tang", "Lingfeng Ming", "Guanghao Zhou", "Qiguang Chen", "Dan Qiao", "Zheming Yang", "Libo Qin", "Minghui Qiu", "Juntao Li", "Min Zhang"], "title": "MMLongCite: A Benchmark for Evaluating Fidelity of Long-Context Vision-Language Models", "comment": null, "summary": "The rapid advancement of large vision language models (LVLMs) has led to a\nsignificant expansion of their context windows. However, an extended context\nwindow does not guarantee the effective utilization of the context, posing a\ncritical challenge for real-world applications. Current evaluations of such\nlong-context faithfulness are predominantly focused on the text-only domain,\nwhile multimodal assessments remain limited to short contexts. To bridge this\ngap, we introduce MMLongCite, a comprehensive benchmark designed to evaluate\nthe fidelity of LVLMs in long-context scenarios. MMLongCite comprises 8\ndistinct tasks spanning 6 context length intervals and incorporates diverse\nmodalities, including text, images, and videos. Our evaluation of\nstate-of-the-art LVLMs reveals their limited faithfulness in handling long\nmultimodal contexts. Furthermore, we provide an in-depth analysis of how\ncontext length and the position of crucial content affect the faithfulness of\nthese models."}
{"id": "2510.13515", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13515", "abs": "https://arxiv.org/abs/2510.13515", "authors": ["Tiancheng Gu", "Kaicheng Yang", "Kaichen Zhang", "Xiang An", "Ziyong Feng", "Yueyi Zhang", "Weidong Cai", "Jiankang Deng", "Lidong Bing"], "title": "UniME-V2: MLLM-as-a-Judge for Universal Multimodal Embedding Learning", "comment": "12 pages, 6 figures, 11 tables", "summary": "Universal multimodal embedding models are foundational to various tasks.\nExisting approaches typically employ in-batch negative mining by measuring the\nsimilarity of query-candidate pairs. However, these methods often struggle to\ncapture subtle semantic differences among candidates and lack diversity in\nnegative samples. Moreover, the embeddings exhibit limited discriminative\nability in distinguishing false and hard negatives. In this paper, we leverage\nthe advanced understanding capabilities of MLLMs to enhance representation\nlearning and present a novel Universal Multimodal Embedding (UniME-V2) model.\nOur approach first constructs a potential hard negative set through global\nretrieval. We then introduce the MLLM-as-a-Judge mechanism, which utilizes\nMLLMs to assess the semantic alignment of query-candidate pairs and generate\nsoft semantic matching scores. These scores serve as a foundation for hard\nnegative mining, mitigating the impact of false negatives and enabling the\nidentification of diverse, high-quality hard negatives. Furthermore, the\nsemantic matching scores are used as soft labels to mitigate the rigid\none-to-one mapping constraint. By aligning the similarity matrix with the soft\nsemantic matching score matrix, the model learns semantic distinctions among\ncandidates, significantly enhancing its discriminative capacity. To further\nimprove performance, we propose UniME-V2-Reranker, a reranking model trained on\nour mined hard negatives through a joint pairwise and listwise optimization\napproach. We conduct comprehensive experiments on the MMEB benchmark and\nmultiple retrieval tasks, demonstrating that our method achieves\nstate-of-the-art performance on average across all tasks."}
{"id": "2510.13251", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13251", "abs": "https://arxiv.org/abs/2510.13251", "authors": ["Minji Kim", "Taekyung Kim", "Bohyung Han"], "title": "Map the Flow: Revealing Hidden Pathways of Information in VideoLLMs", "comment": "23 pages, 28 figures, 8 tables", "summary": "Video Large Language Models (VideoLLMs) extend the capabilities of\nvision-language models to spatiotemporal inputs, enabling tasks such as video\nquestion answering (VideoQA). Despite recent advances in VideoLLMs, their\ninternal mechanisms on where and how they extract and propagate video and\ntextual information remain less explored. In this study, we investigate the\ninternal information flow of VideoLLMs using mechanistic interpretability\ntechniques. Our analysis reveals consistent patterns across diverse VideoQA\ntasks: (1) temporal reasoning in VideoLLMs initiates with active cross-frame\ninteractions in early-to-middle layers, (2) followed by progressive\nvideo-language integration in middle layers. This is facilitated by alignment\nbetween video representations and linguistic embeddings containing temporal\nconcepts. (3) Upon completion of this integration, the model is ready to\ngenerate correct answers in middle-to-late layers. (4) Based on our analysis,\nwe show that VideoLLMs can retain their VideoQA performance by selecting these\neffective information pathways while suppressing a substantial amount of\nattention edges, e.g., 58% in LLaVA-NeXT-7B-Video-FT. These findings provide a\nblueprint on how VideoLLMs perform temporal reasoning and offer practical\ninsights for improving model interpretability and downstream generalization.\nOur project page with the source code is available at\nhttps://map-the-flow.github.io"}
{"id": "2510.13804", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.13804", "abs": "https://arxiv.org/abs/2510.13804", "authors": ["Xinchen Zhang", "Xiaoying Zhang", "Youbin Wu", "Yanbin Cao", "Renrui Zhang", "Ruihang Chu", "Ling Yang", "Yujiu Yang"], "title": "Generative Universal Verifier as Multimodal Meta-Reasoner", "comment": null, "summary": "We introduce Generative Universal Verifier, a novel concept and plugin\ndesigned for next-generation multimodal reasoning in vision-language models and\nunified multimodal models, providing the fundamental capability of reflection\nand refinement on visual outcomes during the reasoning and generation process.\nThis work makes three main contributions: (1) We build ViVerBench, a\ncomprehensive benchmark spanning 16 categories of critical tasks for evaluating\nvisual outcomes in multimodal reasoning. Results show that existing VLMs\nconsistently underperform across these tasks, underscoring a substantial gap\nfrom human-level capability in reliable visual verification. (2) We design two\nautomated pipelines to construct large-scale visual verification data and train\nOmniVerifier-7B, the first omni-capable generative verifier trained for\nuniversal visual verification and achieves notable gains on ViVerBench(+8.3).\nThrough training, we identify three atomic capabilities in visual verification\nand demonstrate how they generalize and interact synergistically. (3) We\npropose OmniVerifier-TTS, a sequential test-time scaling paradigm that\nleverages the universal verifier to bridge image generation and editing within\nunified models, enhancing the upper bound of generative ability through\niterative fine-grained optimization. Beyond generation, we extend universal\nverifier to broader world-modeling interleaved reasoning scenarios.\nEmpirically, OmniVerifier-TTS achieves improvements on T2I-ReasonBench(+3.7),\nand GenEval++(+4.3), outperforming existing parallel test-time scaling methods,\nsuch as Best-of-N. By endowing multimodal reasoning with reliable visual\nverification, OmniVerifier advances both reliable reflection during generation\nand scalable test-time refinement, marking a step toward more trustworthy and\ncontrollable next-generation reasoning systems."}
{"id": "2510.13557", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13557", "abs": "https://arxiv.org/abs/2510.13557", "authors": ["David Freire-Obregón", "José Salas-Cáceres", "Javier Lorenzo-Navarro", "Oliverio J. Santana", "Daniel Hernández-Sosa", "Modesto Castrillón-Santana"], "title": "Modeling Cultural Bias in Facial Expression Recognition with Adaptive Agents", "comment": "Accepted for presentation at the International Symposium on Agentic\n  Artificial Intelligence Systems (AAIS 2025)", "summary": "Facial expression recognition (FER) must remain robust under both cultural\nvariation and perceptually degraded visual conditions, yet most existing\nevaluations assume homogeneous data and high-quality imagery. We introduce an\nagent-based, streaming benchmark that reveals how cross-cultural composition\nand progressive blurring interact to shape face recognition robustness. Each\nagent operates in a frozen CLIP feature space with a lightweight residual\nadapter trained online at sigma=0 and fixed during testing. Agents move and\ninteract on a 5x5 lattice, while the environment provides inputs with\nsigma-scheduled Gaussian blur. We examine monocultural populations\n(Western-only, Asian-only) and mixed environments with balanced (5/5) and\nimbalanced (8/2, 2/8) compositions, as well as different spatial contact\nstructures. Results show clear asymmetric degradation curves between cultural\ngroups: JAFFE (Asian) populations maintain higher performance at low blur but\nexhibit sharper drops at intermediate stages, whereas KDEF (Western)\npopulations degrade more uniformly. Mixed populations exhibit intermediate\npatterns, with balanced mixtures mitigating early degradation, but imbalanced\nsettings amplify majority-group weaknesses under high blur. These findings\nquantify how cultural composition and interaction structure influence the\nrobustness of FER as perceptual conditions deteriorate."}
{"id": "2510.13253", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13253", "abs": "https://arxiv.org/abs/2510.13253", "authors": ["Chunhao Lu", "Qiang Lu", "Meichen Dong", "Jake Luo"], "title": "End-to-End Multi-Modal Diffusion Mamba", "comment": "Accepted by ICCV 2025", "summary": "Current end-to-end multi-modal models utilize different encoders and decoders\nto process input and output information. This separation hinders the joint\nrepresentation learning of various modalities. To unify multi-modal processing,\nwe propose a novel architecture called MDM (Multi-modal Diffusion Mamba). MDM\nutilizes a Mamba-based multi-step selection diffusion model to progressively\ngenerate and refine modality-specific information through a unified variational\nautoencoder for both encoding and decoding. This innovative approach allows MDM\nto achieve superior performance when processing high-dimensional data,\nparticularly in generating high-resolution images and extended text sequences\nsimultaneously. Our evaluations in areas such as image generation, image\ncaptioning, visual question answering, text comprehension, and reasoning tasks\ndemonstrate that MDM significantly outperforms existing end-to-end models\n(MonoFormer, LlamaGen, and Chameleon etc.) and competes effectively with SOTA\nmodels like GPT-4V, Gemini Pro, and Mistral. Our results validate MDM's\neffectiveness in unifying multi-modal processes while maintaining computational\nefficiency, establishing a new direction for end-to-end multi-modal\narchitectures."}
{"id": "2510.13632", "categories": ["cs.CL", "cs.AI", "eess.AS"], "pdf": "https://arxiv.org/pdf/2510.13632", "abs": "https://arxiv.org/abs/2510.13632", "authors": ["Santiago Cuervo", "Skyler Seto", "Maureen de Seyssel", "Richard He Bai", "Zijin Gu", "Tatiana Likhomanenko", "Navdeep Jaitly", "Zakaria Aldeneh"], "title": "Closing the Gap Between Text and Speech Understanding in LLMs", "comment": null, "summary": "Large Language Models (LLMs) can be adapted to extend their text capabilities\nto speech inputs. However, these speech-adapted LLMs consistently underperform\ntheir text-based counterparts--and even cascaded pipelines--on language\nunderstanding tasks. We term this shortfall the text-speech understanding gap:\nthe performance drop observed when a speech-adapted LLM processes spoken inputs\nrelative to when the original text-based LLM processes the equivalent text.\nRecent approaches to narrowing this gap either rely on large-scale speech\nsynthesis of text corpora, which is costly and heavily dependent on synthetic\ndata, or on large-scale proprietary speech datasets, which are not\nreproducible. As a result, there remains a need for more data-efficient\nalternatives for closing the text-speech understanding gap. In this work, we\nanalyze the gap as driven by two factors: (i) forgetting of text capabilities\nduring adaptation, and (ii) cross-modal misalignment between speech and text.\nBased on this analysis, we introduce SALAD--Sample-efficient Alignment with\nLearning through Active selection and cross-modal Distillation--which combines\ncross-modal distillation with targeted synthetic data to improve alignment\nwhile mitigating forgetting. Applied to 3B and 7B LLMs, SALAD achieves\ncompetitive performance with a strong open-weight model across broad-domain\nbenchmarks in knowledge, language understanding, and reasoning, while training\non over an order of magnitude less speech data from public corpora."}
{"id": "2510.13276", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.13276", "abs": "https://arxiv.org/abs/2510.13276", "authors": ["Keyan Zhou", "Zecheng Tang", "Lingfeng Ming", "Guanghao Zhou", "Qiguang Chen", "Dan Qiao", "Zheming Yang", "Libo Qin", "Minghui Qiu", "Juntao Li", "Min Zhang"], "title": "MMLongCite: A Benchmark for Evaluating Fidelity of Long-Context Vision-Language Models", "comment": null, "summary": "The rapid advancement of large vision language models (LVLMs) has led to a\nsignificant expansion of their context windows. However, an extended context\nwindow does not guarantee the effective utilization of the context, posing a\ncritical challenge for real-world applications. Current evaluations of such\nlong-context faithfulness are predominantly focused on the text-only domain,\nwhile multimodal assessments remain limited to short contexts. To bridge this\ngap, we introduce MMLongCite, a comprehensive benchmark designed to evaluate\nthe fidelity of LVLMs in long-context scenarios. MMLongCite comprises 8\ndistinct tasks spanning 6 context length intervals and incorporates diverse\nmodalities, including text, images, and videos. Our evaluation of\nstate-of-the-art LVLMs reveals their limited faithfulness in handling long\nmultimodal contexts. Furthermore, we provide an in-depth analysis of how\ncontext length and the position of crucial content affect the faithfulness of\nthese models."}
{"id": "2510.13721", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.13721", "abs": "https://arxiv.org/abs/2510.13721", "authors": ["Run Luo", "Xiaobo Xia", "Lu Wang", "Longze Chen", "Renke Shan", "Jing Luo", "Min Yang", "Tat-Seng Chua"], "title": "NExT-OMNI: Towards Any-to-Any Omnimodal Foundation Models with Discrete Flow Matching", "comment": null, "summary": "Next-generation multimodal foundation models capable of any-to-any\ncross-modal generation and multi-turn interaction will serve as core components\nof artificial general intelligence systems, playing a pivotal role in\nhuman-machine interaction. However, most existing multimodal models remain\nconstrained by autoregressive architectures, whose inherent limitations prevent\na balanced integration of understanding and generation capabilities. Although\nhybrid and decoupling strategies have been explored to address these tasks\nwithin unified frameworks separately, their redundant, non-integrated designs\nlimit their applicability to broader scenarios, such as cross-modal\nretrieval.In this work, we introduce NExT-OMNI, an open-source omnimodal\nfoundation model that achieves unified modeling through discrete flow\nparadigms. By leveraging metric-induced probability paths and kinetic optimal\nvelocities, NExT-OMNI natively supports any-to-any understanding and generation\nwith enhanced response efficiency, while enabling broader application scenarios\nthrough concise unified representations rather than task-decoupled designs.\nTrained on large-scale interleaved text, image, video, and audio data,\nNExT-OMNI delivers competitive performance on multimodal generation and\nunderstanding benchmarks, while outperforming prior unified models in\nmulti-turn multimodal interaction and cross-modal retrieval, highlighting its\narchitectural advantages as a next-generation multimodal foundation model. To\nadvance further research, we release training details, data protocols, and\nopen-source both the code and model checkpoints."}
{"id": "2510.13282", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13282", "abs": "https://arxiv.org/abs/2510.13282", "authors": ["JiaKui Hu", "Zhengjian Yao", "Lujia Jin", "Yinghao Chen", "Yanye Lu"], "title": "Universal Image Restoration Pre-training via Masked Degradation Classification", "comment": null, "summary": "This study introduces a Masked Degradation Classification Pre-Training method\n(MaskDCPT), designed to facilitate the classification of degradation types in\ninput images, leading to comprehensive image restoration pre-training. Unlike\nconventional pre-training methods, MaskDCPT uses the degradation type of the\nimage as an extremely weak supervision, while simultaneously leveraging the\nimage reconstruction to enhance performance and robustness. MaskDCPT includes\nan encoder and two decoders: the encoder extracts features from the masked\nlow-quality input image. The classification decoder uses these features to\nidentify the degradation type, whereas the reconstruction decoder aims to\nreconstruct a corresponding high-quality image. This design allows the\npre-training to benefit from both masked image modeling and contrastive\nlearning, resulting in a generalized representation suited for restoration\ntasks. Benefit from the straightforward yet potent MaskDCPT, the pre-trained\nencoder can be used to address universal image restoration and achieve\noutstanding performance. Implementing MaskDCPT significantly improves\nperformance for both convolution neural networks (CNNs) and Transformers, with\na minimum increase in PSNR of 3.77 dB in the 5D all-in-one restoration task and\na 34.8% reduction in PIQE compared to baseline in real-world degradation\nscenarios. It also emergences strong generalization to previously unseen\ndegradation types and levels. In addition, we curate and release the UIR-2.5M\ndataset, which includes 2.5 million paired restoration samples across 19\ndegradation types and over 200 degradation levels, incorporating both synthetic\nand real-world data. The dataset, source code, and models are available at\nhttps://github.com/MILab-PKU/MaskDCPT."}
{"id": "2510.13756", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.13756", "abs": "https://arxiv.org/abs/2510.13756", "authors": ["Junhong Shen", "Mu Cai", "Bo Hu", "Ameet Talwalkar", "David A Ross", "Cordelia Schmid", "Alireza Fathi"], "title": "RECODE: Reasoning Through Code Generation for Visual Question Answering", "comment": null, "summary": "Multimodal Large Language Models (MLLMs) struggle with precise reasoning for\nstructured visuals like charts and diagrams, as pixel-based perception lacks a\nmechanism for verification. To address this, we propose to leverage derendering\n-- the process of reverse-engineering visuals into executable code -- as a new\nmodality for verifiable visual reasoning. Specifically, we propose RECODE, an\nagentic framework that first generates multiple candidate programs to reproduce\nthe input image. It then uses a critic to select the most faithful\nreconstruction and iteratively refines the code. This process not only\ntransforms an ambiguous perceptual task into a verifiable, symbolic problem,\nbut also enables precise calculations and logical inferences later on. On\nvarious visual reasoning benchmarks such as CharXiv, ChartQA, and Geometry3K,\nRECODE significantly outperforms methods that do not leverage code or only use\ncode for drawing auxiliary lines or cropping. Our work demonstrates that\ngrounding visual perception in executable code provides a new path toward more\naccurate and verifiable multimodal reasoning."}
{"id": "2510.13315", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13315", "abs": "https://arxiv.org/abs/2510.13315", "authors": ["Eun Woo Im", "Muhammad Kashif Ali", "Vivek Gupta"], "title": "Self-Augmented Visual Contrastive Decoding", "comment": null, "summary": "Large Vision-Language Models (LVLMs) have demonstrated remarkable multimodal\ncapabilities, but they inherit the tendency to hallucinate from their\nunderlying language models. While visual contrastive decoding has been proposed\nto mitigate this issue, existing methods often apply generic visual\naugmentations that disregard the specific context provided by the text query,\nlimiting their effectiveness. This study introduces a novel training-free\ndecoding strategy that addresses these limitations, featuring two key\ncontributions. First, a self-augmentation prompting strategy that leverages the\nintrinsic knowledge of the model to dynamically align semantics between the\nquery and the visual augmentation. Second, an adaptive thresholding algorithm\nthat adaptively adjusts next token candidate size based on the output sparsity,\nutilizing full information from the logit distribution. Extensive experiments\nacross four LVLMs and seven benchmarks demonstrate that the proposed decoding\nsignificantly enhances factual consistency compared to state-of-the-art\ndecoding methods. This work highlights the importance of integrating\nquery-dependent augmentation and entropy-aware decoding for improving effective\ngeneration of LVLMs."}
{"id": "2510.13795", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13795", "abs": "https://arxiv.org/abs/2510.13795", "authors": ["Yi Zhang", "Bolin Ni", "Xin-Sheng Chen", "Heng-Rui Zhang", "Yongming Rao", "Houwen Peng", "Qinglin Lu", "Han Hu", "Meng-Hao Guo", "Shi-Min Hu"], "title": "Bee: A High-Quality Corpus and Full-Stack Suite to Unlock Advanced Fully Open MLLMs", "comment": "homepage: https://open-bee.github.io/", "summary": "Fully open multimodal large language models (MLLMs) currently lag behind\nproprietary counterparts, primarily due to a significant gap in data quality\nfor supervised fine-tuning (SFT). Existing open-source datasets are often\nplagued by widespread noise and a critical deficit in complex reasoning data,\nsuch as Chain-of-Thought (CoT), which hinders the development of advanced model\ncapabilities. Addressing these challenges, our work makes three primary\ncontributions. First, we introduce Honey-Data-15M, a new SFT dataset comprising\napproximately 15 million QA pairs, processed through multiple cleaning\ntechniques and enhanced with a novel dual-level (short and long) CoT enrichment\nstrategy. Second, we introduce HoneyPipe, the data curation pipeline, and its\nunderlying framework DataStudio, providing the community with a transparent and\nadaptable methodology for data curation that moves beyond static dataset\nreleases. Finally, to validate our dataset and pipeline, we train Bee-8B, an 8B\nmodel on Honey-Data-15M. Experiments show that Bee-8B establishes a new\nstate-of-the-art (SOTA) for fully open MLLMs, achieving performance that is\ncompetitive with, and in some cases surpasses, recent semi-open models such as\nInternVL3.5-8B. Our work delivers to the community a suite of foundational\nresources, including: the Honey-Data-15M corpus; the full-stack suite\ncomprising HoneyPipe and DataStudio; training recipes; an evaluation harness;\nand the model weights. This effort demonstrates that a principled focus on data\nquality is a key pathway to developing fully open MLLMs that are highly\ncompetitive with their semi-open counterparts."}
{"id": "2510.13316", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13316", "abs": "https://arxiv.org/abs/2510.13316", "authors": ["Fitim Abdullahu", "Helmut Grabner"], "title": "Visual Interestingness Decoded: How GPT-4o Mirrors Human Interests", "comment": "ICCV 2025", "summary": "Our daily life is highly influenced by what we consume and see. Attracting\nand holding one's attention -- the definition of (visual) interestingness -- is\nessential. The rise of Large Multimodal Models (LMMs) trained on large-scale\nvisual and textual data has demonstrated impressive capabilities. We explore\nthese models' potential to understand to what extent the concepts of visual\ninterestingness are captured and examine the alignment between human\nassessments and GPT-4o's, a leading LMM, predictions through comparative\nanalysis. Our studies reveal partial alignment between humans and GPT-4o. It\nalready captures the concept as best compared to state-of-the-art methods.\nHence, this allows for the effective labeling of image pairs according to their\n(commonly) interestingness, which are used as training data to distill the\nknowledge into a learning-to-rank model. The insights pave the way for a deeper\nunderstanding of human interest."}
{"id": "2510.13804", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.13804", "abs": "https://arxiv.org/abs/2510.13804", "authors": ["Xinchen Zhang", "Xiaoying Zhang", "Youbin Wu", "Yanbin Cao", "Renrui Zhang", "Ruihang Chu", "Ling Yang", "Yujiu Yang"], "title": "Generative Universal Verifier as Multimodal Meta-Reasoner", "comment": null, "summary": "We introduce Generative Universal Verifier, a novel concept and plugin\ndesigned for next-generation multimodal reasoning in vision-language models and\nunified multimodal models, providing the fundamental capability of reflection\nand refinement on visual outcomes during the reasoning and generation process.\nThis work makes three main contributions: (1) We build ViVerBench, a\ncomprehensive benchmark spanning 16 categories of critical tasks for evaluating\nvisual outcomes in multimodal reasoning. Results show that existing VLMs\nconsistently underperform across these tasks, underscoring a substantial gap\nfrom human-level capability in reliable visual verification. (2) We design two\nautomated pipelines to construct large-scale visual verification data and train\nOmniVerifier-7B, the first omni-capable generative verifier trained for\nuniversal visual verification and achieves notable gains on ViVerBench(+8.3).\nThrough training, we identify three atomic capabilities in visual verification\nand demonstrate how they generalize and interact synergistically. (3) We\npropose OmniVerifier-TTS, a sequential test-time scaling paradigm that\nleverages the universal verifier to bridge image generation and editing within\nunified models, enhancing the upper bound of generative ability through\niterative fine-grained optimization. Beyond generation, we extend universal\nverifier to broader world-modeling interleaved reasoning scenarios.\nEmpirically, OmniVerifier-TTS achieves improvements on T2I-ReasonBench(+3.7),\nand GenEval++(+4.3), outperforming existing parallel test-time scaling methods,\nsuch as Best-of-N. By endowing multimodal reasoning with reliable visual\nverification, OmniVerifier advances both reliable reflection during generation\nand scalable test-time refinement, marking a step toward more trustworthy and\ncontrollable next-generation reasoning systems."}
{"id": "2510.13349", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13349", "abs": "https://arxiv.org/abs/2510.13349", "authors": ["Sipeng Yang", "Jiayu Ji", "Qingchuan Zhu", "Zhiyao Yang", "Xiaogang Jin"], "title": "No-Reference Rendered Video Quality Assessment: Dataset and Metrics", "comment": null, "summary": "Quality assessment of videos is crucial for many computer graphics\napplications, including video games, virtual reality, and augmented reality,\nwhere visual performance has a significant impact on user experience. When test\nvideos cannot be perfectly aligned with references or when references are\nunavailable, the significance of no-reference video quality assessment (NR-VQA)\nmethods is undeniable. However, existing NR-VQA datasets and metrics are\nprimarily focused on camera-captured videos; applying them directly to rendered\nvideos would result in biased predictions, as rendered videos are more prone to\ntemporal artifacts. To address this, we present a large rendering-oriented\nvideo dataset with subjective quality annotations, as well as a designed NR-VQA\nmetric specific to rendered videos. The proposed dataset includes a wide range\nof 3D scenes and rendering settings, with quality scores annotated for various\ndisplay types to better reflect real-world application scenarios. Building on\nthis dataset, we calibrate our NR-VQA metric to assess rendered video quality\nby looking at both image quality and temporal stability. We compare our metric\nto existing NR-VQA metrics, demonstrating its superior performance on rendered\nvideos. Finally, we demonstrate that our metric can be used to benchmark\nsupersampling methods and assess frame generation strategies in real-time\nrendering."}
{"id": "2510.13364", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13364", "abs": "https://arxiv.org/abs/2510.13364", "authors": ["MingZe Tang", "Jubal Chandy Jacob"], "title": "Language as a Label: Zero-Shot Multimodal Classification of Everyday Postures under Data Scarcity", "comment": null, "summary": "Recent Vision-Language Models (VLMs) enable zero-shot classification by\naligning images and text in a shared space, a promising approach for\ndata-scarce conditions. However, the influence of prompt design on recognizing\nvisually similar categories, such as human postures, is not well understood.\nThis study investigates how prompt specificity affects the zero-shot\nclassification of sitting, standing, and walking/running on a small, 285-image\nCOCO-derived dataset. A suite of modern VLMs, including OpenCLIP, MetaCLIP 2,\nand SigLip, were evaluated using a three-tiered prompt design that\nsystematically increases linguistic detail. Our findings reveal a compelling,\ncounter-intuitive trend: for the highest-performing models (MetaCLIP 2 and\nOpenCLIP), the simplest, most basic prompts consistently achieve the best\nresults. Adding descriptive detail significantly degrades performance for\ninstance, MetaCLIP 2's multi-class accuracy drops from 68.8\\% to 55.1\\% a\nphenomenon we term \"prompt overfitting\". Conversely, the lower-performing\nSigLip model shows improved classification on ambiguous classes when given more\ndescriptive, body-cue-based prompts."}
{"id": "2510.13375", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13375", "abs": "https://arxiv.org/abs/2510.13375", "authors": ["Tianyuan Yuan", "Yicheng Liu", "Chenhao Lu", "Zhuoguang Chen", "Tao Jiang", "Hang Zhao"], "title": "DepthVLA: Enhancing Vision-Language-Action Models with Depth-Aware Spatial Reasoning", "comment": null, "summary": "Vision-Language-Action (VLA) models have recently shown impressive\ngeneralization and language-guided manipulation capabilities. However, their\nperformance degrades on tasks requiring precise spatial reasoning due to\nlimited spatial reasoning inherited from Vision-Language Models (VLMs).\nExisting VLAs rely on extensive action-data pretraining to ground VLMs in 3D\nspace, which reduces training efficiency and is still insufficient for accurate\nspatial understanding. In this work, we present DepthVLA, a simple yet\neffective VLA architecture that explicitly incorporates spatial awareness\nthrough a pretrained depth prediction module. DepthVLA adopts a\nmixture-of-transformers design that unifies a VLM, a depth transformer, and an\naction expert with fully shared attentions, forming an end-to-end model with\nenhanced spatial reasoning. Extensive evaluations in both real-world and\nsimulated environments show that DepthVLA outperforms state-of-the-art\napproaches, achieving 78.5% vs. 65.0% progress in real-world tasks, 94.9% vs.\n93.6% in the LIBERO simulator, and 74.8% vs. 58.8% in the Simpler simulator.\nOur code will be made publicly available."}
{"id": "2510.13390", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13390", "abs": "https://arxiv.org/abs/2510.13390", "authors": ["Feng-Qi Cui", "Yu-Tong Guo", "Tianyue Zheng", "Jinyang Huang"], "title": "Generalizing WiFi Gesture Recognition via Large-Model-Aware Semantic Distillation and Alignment", "comment": "Accepted by IEEE ICPADS 2025", "summary": "WiFi-based gesture recognition has emerged as a promising RF sensing paradigm\nfor enabling non-contact and privacy-preserving human-computer interaction in\nAIoT environments. However, existing methods often suffer from limited\ngeneralization and semantic expressiveness due to the domain-sensitive nature\nof Channel State Information and the lack of high-level gesture abstraction. To\naddress these challenges, we propose a novel generalization framework, termed\nLarge-Model-Aware Semantic Distillation and Alignment (GLSDA), which leverages\nthe semantic prior of pre-trained large foundation models to enhance gesture\nrepresentation learning in both in-domain and cross-domain scenarios.\nSpecifically, we first design a dual-path CSI encoding pipeline that captures\ngeometric and dynamic gesture patterns via CSI-Ratio phase sequences and\nDoppler spectrograms. These representations are then fed into a Multiscale\nSemantic Encoder, which learns robust temporal embeddings and aligns them with\ngesture semantics through cross-modal attention mechanisms. To further enhance\ncategory discrimination, we introduce a Semantic-Aware Soft Supervision scheme\nthat encodes inter-class correlations and reduces label ambiguity, especially\nfor semantically similar gestures. Finally, we develop a Robust\nDual-Distillation strategy to compress the aligned model into a lightweight\nstudent network, jointly distilling intermediate features and semantic-informed\nsoft labels from the teacher model. Extensive experiments on the Widar3.0\nbenchmark show that GLSDA consistently outperforms state-of-the-art methods in\nboth in-domain and cross-domain gesture recognition tasks, while significantly\nreducing model size and inference latency. Our method offers a scalable and\ndeployable solution for generalized RF-based gesture interfaces in real-world\nAIoT applications."}
{"id": "2510.13394", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13394", "abs": "https://arxiv.org/abs/2510.13394", "authors": ["Xinmiao Huang", "Qisong He", "Zhenglin Huang", "Boxuan Wang", "Zhuoyun Li", "Guangliang Cheng", "Yi Dong", "Xiaowei Huang"], "title": "Spatial-DISE: A Unified Benchmark for Evaluating Spatial Reasoning in Vision-Language Models", "comment": null, "summary": "Spatial reasoning ability is crucial for Vision Language Models (VLMs) to\nsupport real-world applications in diverse domains including robotics,\naugmented reality, and autonomous navigation. Unfortunately, existing\nbenchmarks are inadequate in assessing spatial reasoning ability, especially\nthe \\emph{intrinsic-dynamic} spatial reasoning which is a fundamental aspect of\nhuman spatial cognition. In this paper, we propose a unified benchmark,\n\\textbf{Spatial-DISE}, based on a cognitively grounded taxonomy that\ncategorizes tasks into four fundamental quadrants:\n\\textbf{I}ntrinsic-\\textbf{S}tatic, Intrinsic-\\textbf{D}ynamic,\n\\textbf{E}xtrinsic-Static, and Extrinsic-Dynamic spatial reasoning. Moreover,\nto address the issue of data scarcity, we develop a scalable and automated\npipeline to generate diverse and verifiable spatial reasoning questions,\nresulting in a new \\textbf{Spatial-DISE} dataset that includes Spatial-DISE\nBench (559 evaluation VQA pairs) and Spatial-DISE-12K (12K+ training VQA\npairs). Our comprehensive evaluation across 28 state-of-the-art VLMs reveals\nthat, current VLMs have a large and consistent gap to human competence,\nespecially on multi-step multi-view spatial reasoning. Spatial-DISE offers a\nrobust framework, valuable dataset, and clear direction for future research\ntoward human-like spatial intelligence. Benchmark, dataset, and code will be\npublicly released."}
{"id": "2510.13418", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13418", "abs": "https://arxiv.org/abs/2510.13418", "authors": ["Yifu Luo", "Xinhao Hu", "Keyu Fan", "Haoyuan Sun", "Zeyu Chen", "Bo Xia", "Tiantian Zhang", "Yongzhe Chang", "Xueqian Wang"], "title": "Reinforcement Learning Meets Masked Generative Models: Mask-GRPO for Text-to-Image Generation", "comment": null, "summary": "Reinforcement learning (RL) has garnered increasing attention in\ntext-to-image (T2I) generation. However, most existing RL approaches are\ntailored to either diffusion models or autoregressive models, overlooking an\nimportant alternative: masked generative models. In this work, we propose\nMask-GRPO, the first method to incorporate Group Relative Policy Optimization\n(GRPO)-based RL into this overlooked paradigm. Our core insight is to redefine\nthe transition probability, which is different from current approaches, and\nformulate the unmasking process as a multi-step decision-making problem. To\nfurther enhance our method, we explore several useful strategies, including\nremoving the KL constraint, applying the reduction strategy, and filtering out\nlow-quality samples. Using Mask-GRPO, we improve a base model, Show-o, with\nsubstantial improvements on standard T2I benchmarks and preference alignment,\noutperforming existing state-of-the-art approaches. The code is available on\nhttps://github.com/xingzhejun/Mask-GRPO"}
{"id": "2510.13515", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13515", "abs": "https://arxiv.org/abs/2510.13515", "authors": ["Tiancheng Gu", "Kaicheng Yang", "Kaichen Zhang", "Xiang An", "Ziyong Feng", "Yueyi Zhang", "Weidong Cai", "Jiankang Deng", "Lidong Bing"], "title": "UniME-V2: MLLM-as-a-Judge for Universal Multimodal Embedding Learning", "comment": "12 pages, 6 figures, 11 tables", "summary": "Universal multimodal embedding models are foundational to various tasks.\nExisting approaches typically employ in-batch negative mining by measuring the\nsimilarity of query-candidate pairs. However, these methods often struggle to\ncapture subtle semantic differences among candidates and lack diversity in\nnegative samples. Moreover, the embeddings exhibit limited discriminative\nability in distinguishing false and hard negatives. In this paper, we leverage\nthe advanced understanding capabilities of MLLMs to enhance representation\nlearning and present a novel Universal Multimodal Embedding (UniME-V2) model.\nOur approach first constructs a potential hard negative set through global\nretrieval. We then introduce the MLLM-as-a-Judge mechanism, which utilizes\nMLLMs to assess the semantic alignment of query-candidate pairs and generate\nsoft semantic matching scores. These scores serve as a foundation for hard\nnegative mining, mitigating the impact of false negatives and enabling the\nidentification of diverse, high-quality hard negatives. Furthermore, the\nsemantic matching scores are used as soft labels to mitigate the rigid\none-to-one mapping constraint. By aligning the similarity matrix with the soft\nsemantic matching score matrix, the model learns semantic distinctions among\ncandidates, significantly enhancing its discriminative capacity. To further\nimprove performance, we propose UniME-V2-Reranker, a reranking model trained on\nour mined hard negatives through a joint pairwise and listwise optimization\napproach. We conduct comprehensive experiments on the MMEB benchmark and\nmultiple retrieval tasks, demonstrating that our method achieves\nstate-of-the-art performance on average across all tasks."}
{"id": "2510.13557", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13557", "abs": "https://arxiv.org/abs/2510.13557", "authors": ["David Freire-Obregón", "José Salas-Cáceres", "Javier Lorenzo-Navarro", "Oliverio J. Santana", "Daniel Hernández-Sosa", "Modesto Castrillón-Santana"], "title": "Modeling Cultural Bias in Facial Expression Recognition with Adaptive Agents", "comment": "Accepted for presentation at the International Symposium on Agentic\n  Artificial Intelligence Systems (AAIS 2025)", "summary": "Facial expression recognition (FER) must remain robust under both cultural\nvariation and perceptually degraded visual conditions, yet most existing\nevaluations assume homogeneous data and high-quality imagery. We introduce an\nagent-based, streaming benchmark that reveals how cross-cultural composition\nand progressive blurring interact to shape face recognition robustness. Each\nagent operates in a frozen CLIP feature space with a lightweight residual\nadapter trained online at sigma=0 and fixed during testing. Agents move and\ninteract on a 5x5 lattice, while the environment provides inputs with\nsigma-scheduled Gaussian blur. We examine monocultural populations\n(Western-only, Asian-only) and mixed environments with balanced (5/5) and\nimbalanced (8/2, 2/8) compositions, as well as different spatial contact\nstructures. Results show clear asymmetric degradation curves between cultural\ngroups: JAFFE (Asian) populations maintain higher performance at low blur but\nexhibit sharper drops at intermediate stages, whereas KDEF (Western)\npopulations degrade more uniformly. Mixed populations exhibit intermediate\npatterns, with balanced mixtures mitigating early degradation, but imbalanced\nsettings amplify majority-group weaknesses under high blur. These findings\nquantify how cultural composition and interaction structure influence the\nrobustness of FER as perceptual conditions deteriorate."}
{"id": "2510.13620", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13620", "abs": "https://arxiv.org/abs/2510.13620", "authors": ["Chen Chen", "Kangcheng Bin", "Ting Hu", "Jiahao Qi", "Xingyue Liu", "Tianpeng Liu", "Zhen Liu", "Yongxiang Liu", "Ping Zhong"], "title": "Fusion Meets Diverse Conditions: A High-diversity Benchmark and Baseline for UAV-based Multimodal Object Detection with Condition Cues", "comment": null, "summary": "Unmanned aerial vehicles (UAV)-based object detection with visible (RGB) and\ninfrared (IR) images facilitates robust around-the-clock detection, driven by\nadvancements in deep learning techniques and the availability of high-quality\ndataset. However, the existing dataset struggles to fully capture real-world\ncomplexity for limited imaging conditions. To this end, we introduce a\nhigh-diversity dataset ATR-UMOD covering varying scenarios, spanning altitudes\nfrom 80m to 300m, angles from 0{\\deg} to 75{\\deg}, and all-day, all-year time\nvariations in rich weather and illumination conditions. Moreover, each RGB-IR\nimage pair is annotated with 6 condition attributes, offering valuable\nhigh-level contextual information. To meet the challenge raised by such diverse\nconditions, we propose a novel prompt-guided condition-aware dynamic fusion\n(PCDF) to adaptively reassign multimodal contributions by leveraging annotated\ncondition cues. By encoding imaging conditions as text prompts, PCDF\neffectively models the relationship between conditions and multimodal\ncontributions through a task-specific soft-gating transformation. A\nprompt-guided condition-decoupling module further ensures the availability in\npractice without condition annotations. Experiments on ATR-UMOD dataset reveal\nthe effectiveness of PCDF."}
{"id": "2510.13630", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13630", "abs": "https://arxiv.org/abs/2510.13630", "authors": ["Amjid Ali", "Zulfiqar Ahmad Khan", "Altaf Hussain", "Muhammad Munsif", "Adnan Hussain", "Sung Wook Baik"], "title": "AVAR-Net: A Lightweight Audio-Visual Anomaly Recognition Framework with a Benchmark Dataset", "comment": null, "summary": "Anomaly recognition plays a vital role in surveillance, transportation,\nhealthcare, and public safety. However, most existing approaches rely solely on\nvisual data, making them unreliable under challenging conditions such as\nocclusion, low illumination, and adverse weather. Moreover, the absence of\nlarge-scale synchronized audio-visual datasets has hindered progress in\nmultimodal anomaly recognition. To address these limitations, this study\npresents AVAR-Net, a lightweight and efficient audio-visual anomaly recognition\nframework designed for real-world environments. AVAR-Net consists of four main\nmodules: an audio feature extractor, a video feature extractor, fusion\nstrategy, and a sequential pattern learning network that models cross-modal\nrelationships for anomaly recognition. Specifically, the Wav2Vec2 model\nextracts robust temporal features from raw audio, while MobileViT captures both\nlocal and global visual representations from video frames. An early fusion\nmechanism combines these modalities, and a Multi-Stage Temporal Convolutional\nNetwork (MTCN) model that learns long-range temporal dependencies within the\nfused representation, enabling robust spatiotemporal reasoning. A novel\nVisual-Audio Anomaly Recognition (VAAR) dataset, is also introduced, serving as\na medium-scale benchmark containing 3,000 real-world videos with synchronized\naudio across ten diverse anomaly classes. Experimental evaluations demonstrate\nthat AVAR-Net achieves 89.29% accuracy on VAAR and 88.56% Average Precision on\nthe XD-Violence dataset, improving Average Precision by 2.8% over existing\nstate-of-the-art methods. These results highlight the effectiveness,\nefficiency, and generalization capability of the proposed framework, as well as\nthe utility of VAAR as a benchmark for advancing multimodal anomaly recognition\nresearch."}
{"id": "2510.13638", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13638", "abs": "https://arxiv.org/abs/2510.13638", "authors": ["Chun Wai Chin", "Haniza Yazid", "Hoi Leong Lee"], "title": "Challenges, Advances, and Evaluation Metrics in Medical Image Enhancement: A Systematic Literature Review", "comment": null, "summary": "Medical image enhancement is crucial for improving the quality and\ninterpretability of diagnostic images, ultimately supporting early detection,\naccurate diagnosis, and effective treatment planning. Despite advancements in\nimaging technologies such as X-ray, CT, MRI, and ultrasound, medical images\noften suffer from challenges like noise, artifacts, and low contrast, which\nlimit their diagnostic potential. Addressing these challenges requires robust\npreprocessing, denoising algorithms, and advanced enhancement methods, with\ndeep learning techniques playing an increasingly significant role. This\nsystematic literature review, following the PRISMA approach, investigates the\nkey challenges, recent advancements, and evaluation metrics in medical image\nenhancement. By analyzing findings from 39 peer-reviewed studies, this review\nprovides insights into the effectiveness of various enhancement methods across\ndifferent imaging modalities and the importance of evaluation metrics in\nassessing their impact. Key issues like low contrast and noise are identified\nas the most frequent, with MRI and multi-modal imaging receiving the most\nattention, while specialized modalities such as histopathology, endoscopy, and\nbone scintigraphy remain underexplored. Out of the 39 studies, 29 utilize\nconventional mathematical methods, 9 focus on deep learning techniques, and 1\nexplores a hybrid approach. In terms of image quality assessment, 18 studies\nemploy both reference-based and non-reference-based metrics, 9 rely solely on\nreference-based metrics, and 12 use only non-reference-based metrics, with a\ntotal of 65 IQA metrics introduced, predominantly non-reference-based. This\nreview highlights current limitations, research gaps, and potential future\ndirections for advancing medical image enhancement."}
{"id": "2510.13649", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13649", "abs": "https://arxiv.org/abs/2510.13649", "authors": ["Sanchar Palit", "Subhasis Chaudhuri", "Biplab Banerjee"], "title": "Local-Global Context-Aware and Structure-Preserving Image Super-Resolution", "comment": "10 pages, 11 figures", "summary": "Diffusion models have recently achieved significant success in various image\nmanipulation tasks, including image super-resolution and perceptual quality\nenhancement. Pretrained text-to-image models, such as Stable Diffusion, have\nexhibited strong capabilities in synthesizing realistic image content, which\nmakes them particularly attractive for addressing super-resolution tasks. While\nsome existing approaches leverage these models to achieve state-of-the-art\nresults, they often struggle when applied to diverse and highly degraded\nimages, leading to noise amplification or incorrect content generation. To\naddress these limitations, we propose a contextually precise image\nsuper-resolution framework that effectively maintains both local and global\npixel relationships through Local-Global Context-Aware Attention, enabling the\ngeneration of high-quality images. Furthermore, we propose a distribution- and\nperceptual-aligned conditioning mechanism in the pixel space to enhance\nperceptual fidelity. This mechanism captures fine-grained pixel-level\nrepresentations while progressively preserving and refining structural\ninformation, transitioning from local content details to the global structural\ncomposition. During inference, our method generates high-quality images that\nare structurally consistent with the original content, mitigating artifacts and\nensuring realistic detail restoration. Extensive experiments on multiple\nsuper-resolution benchmarks demonstrate the effectiveness of our approach in\nproducing high-fidelity, perceptually accurate reconstructions."}
{"id": "2510.13660", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13660", "abs": "https://arxiv.org/abs/2510.13660", "authors": ["Hongyu Qu", "Jianan Wei", "Xiangbo Shu", "Yazhou Yao", "Wenguan Wang", "Jinhui Tang"], "title": "OmniGaze: Reward-inspired Generalizable Gaze Estimation In The Wild", "comment": "Accepted to NeurIPS 2025; Project page:\n  \\url{https://github.com/quhongyu/OmniGaze}", "summary": "Current 3D gaze estimation methods struggle to generalize across diverse data\ndomains, primarily due to i) the scarcity of annotated datasets, and ii) the\ninsufficient diversity of labeled data. In this work, we present OmniGaze, a\nsemi-supervised framework for 3D gaze estimation, which utilizes large-scale\nunlabeled data collected from diverse and unconstrained real-world environments\nto mitigate domain bias and generalize gaze estimation in the wild. First, we\nbuild a diverse collection of unlabeled facial images, varying in facial\nappearances, background environments, illumination conditions, head poses, and\neye occlusions. In order to leverage unlabeled data spanning a broader\ndistribution, OmniGaze adopts a standard pseudo-labeling strategy and devises a\nreward model to assess the reliability of pseudo labels. Beyond pseudo labels\nas 3D direction vectors, the reward model also incorporates visual embeddings\nextracted by an off-the-shelf visual encoder and semantic cues from gaze\nperspective generated by prompting a Multimodal Large Language Model to compute\nconfidence scores. Then, these scores are utilized to select high-quality\npseudo labels and weight them for loss computation. Extensive experiments\ndemonstrate that OmniGaze achieves state-of-the-art performance on five\ndatasets under both in-domain and cross-domain settings. Furthermore, we also\nevaluate the efficacy of OmniGaze as a scalable data engine for gaze\nestimation, which exhibits robust zero-shot generalization on four unseen\ndatasets."}
{"id": "2510.13675", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.13675", "abs": "https://arxiv.org/abs/2510.13675", "authors": ["Hongkuan Zhou", "Lavdim Halilaj", "Sebastian Monka", "Stefan Schmid", "Yuqicheng Zhu", "Jingcheng Wu", "Nadeem Nazer", "Steffen Staab"], "title": "Seeing and Knowing in the Wild: Open-domain Visual Entity Recognition with Large-scale Knowledge Graphs via Contrastive Learning", "comment": null, "summary": "Open-domain visual entity recognition aims to identify and link entities\ndepicted in images to a vast and evolving set of real-world concepts, such as\nthose found in Wikidata. Unlike conventional classification tasks with fixed\nlabel sets, it operates under open-set conditions, where most target entities\nare unseen during training and exhibit long-tail distributions. This makes the\ntask inherently challenging due to limited supervision, high visual ambiguity,\nand the need for semantic disambiguation. In this work, we propose a\nKnowledge-guided Contrastive Learning (KnowCoL) framework that combines both\nimages and text descriptions into a shared semantic space grounded by\nstructured information from Wikidata. By abstracting visual and textual inputs\nto a conceptual level, the model leverages entity descriptions, type\nhierarchies, and relational context to support zero-shot entity recognition. We\nevaluate our approach on the OVEN benchmark, a large-scale open-domain visual\nrecognition dataset with Wikidata IDs as the label space. Our experiments show\nthat using visual, textual, and structured knowledge greatly improves accuracy,\nespecially for rare and unseen entities. Our smallest model improves the\naccuracy on unseen entities by 10.5% compared to the state-of-the-art, despite\nbeing 35 times smaller."}
{"id": "2510.13698", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13698", "abs": "https://arxiv.org/abs/2510.13698", "authors": ["Jonghyun Park", "Minhyuk Seo", "Jonghyun Choi"], "title": "Risk-adaptive Activation Steering for Safe Multimodal Large Language Models", "comment": null, "summary": "One of the key challenges of modern AI models is ensuring that they provide\nhelpful responses to benign queries while refusing malicious ones. But often,\nthe models are vulnerable to multimodal queries with harmful intent embedded in\nimages. One approach for safety alignment is training with extensive safety\ndatasets at the significant costs in both dataset curation and training.\nInference-time alignment mitigates these costs, but introduces two drawbacks:\nexcessive refusals from misclassified benign queries and slower inference speed\ndue to iterative output adjustments. To overcome these limitations, we propose\nto reformulate queries to strengthen cross-modal attention to safety-critical\nimage regions, enabling accurate risk assessment at the query level. Using the\nassessed risk, it adaptively steers activations to generate responses that are\nsafe and helpful without overhead from iterative output adjustments. We call\nthis Risk-adaptive Activation Steering (RAS). Extensive experiments across\nmultiple benchmarks on multimodal safety and utility demonstrate that the RAS\nsignificantly reduces attack success rates, preserves general task performance,\nand improves inference speed over prior inference-time defenses."}
{"id": "2510.13735", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13735", "abs": "https://arxiv.org/abs/2510.13735", "authors": ["Zhenxuan Zhang", "Peiyuan Jing", "Zi Wang", "Ula Briski", "Coraline Beitone", "Yue Yang", "Yinzhe Wu", "Fanwen Wang", "Liutao Yang", "Jiahao Huang", "Zhifan Gao", "Zhaolin Chen", "Kh Tohidul Islam", "Guang Yang", "Peter J. Lally"], "title": "Cyclic Self-Supervised Diffusion for Ultra Low-field to High-field MRI Synthesis", "comment": null, "summary": "Synthesizing high-quality images from low-field MRI holds significant\npotential. Low-field MRI is cheaper, more accessible, and safer, but suffers\nfrom low resolution and poor signal-to-noise ratio. This synthesis process can\nreduce reliance on costly acquisitions and expand data availability. However,\nsynthesizing high-field MRI still suffers from a clinical fidelity gap. There\nis a need to preserve anatomical fidelity, enhance fine-grained structural\ndetails, and bridge domain gaps in image contrast. To address these issues, we\npropose a \\emph{cyclic self-supervised diffusion (CSS-Diff)} framework for\nhigh-field MRI synthesis from real low-field MRI data. Our core idea is to\nreformulate diffusion-based synthesis under a cycle-consistent constraint. It\nenforces anatomical preservation throughout the generative process rather than\njust relying on paired pixel-level supervision. The CSS-Diff framework further\nincorporates two novel processes. The slice-wise gap perception network aligns\ninter-slice inconsistencies via contrastive learning. The local structure\ncorrection network enhances local feature restoration through\nself-reconstruction of masked and perturbed patches. Extensive experiments on\ncross-field synthesis tasks demonstrate the effectiveness of our method,\nachieving state-of-the-art performance (e.g., 31.80 $\\pm$ 2.70 dB in PSNR,\n0.943 $\\pm$ 0.102 in SSIM, and 0.0864 $\\pm$ 0.0689 in LPIPS). Beyond pixel-wise\nfidelity, our method also preserves fine-grained anatomical structures compared\nwith the original low-field MRI (e.g., left cerebral white matter error drops\nfrom 12.1$\\%$ to 2.1$\\%$, cortex from 4.2$\\%$ to 3.7$\\%$). To conclude, our\nCSS-Diff can synthesize images that are both quantitatively reliable and\nanatomically consistent."}
{"id": "2510.13747", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13747", "abs": "https://arxiv.org/abs/2510.13747", "authors": ["Wenwen Tong", "Hewei Guo", "Dongchuan Ran", "Jiangnan Chen", "Jiefan Lu", "Kaibin Wang", "Keqiang Li", "Xiaoxu Zhu", "Jiakui Li", "Kehan Li", "Xueheng Li", "Lumin Li", "Chenxu Guo", "Jiasheng Zhou", "Jiandong Chen", "Xianye Wu", "Jiahao Wang", "Silei Wu", "Lei Chen", "Hanming Deng", "Yuxuan Song", "Dinghao Zhou", "Guiping Zhong", "Ken Zheng", "Shiyin Kang", "Lewei Lu"], "title": "InteractiveOmni: A Unified Omni-modal Model for Audio-Visual Multi-turn Dialogue", "comment": null, "summary": "We introduce InteractiveOmni, a unified and open-source omni-modal large\nlanguage model for audio-visual multi-turn interaction, ranging from 4B to 8B\nparameters, designed to lead the field of lightweight models by offering\ncomprehensive omni-modal understanding and speech generation capabilities. To\nachieve this, we integrate the vision encoder, audio encoder, large language\nmodel, and speech decoder into a unified model for understanding and generation\ntasks. We design a multi-stage training strategy to ensure robust cross-modal\ncapabilities, including pre-training for omni-modal understanding, followed by\npost-training with speech conversation and audio-visual interaction. To enable\nhuman-like long-term conversational ability, we meticulously curate a\nmulti-turn training dataset that enhances the model's ability to handle complex\nand multi-turn interactions. To effectively evaluate the multi-turn memory and\nspeech interaction capabilities, we construct the multi-modal multi-turn memory\nbenchmark and the multi-turn speech interaction benchmark. Experiments\ndemonstrate that InteractiveOmni significantly outperforms leading open-source\nmodels and provides a more intelligent multi-turn audio-visual experience,\nparticularly in its long-term memory capabilities. Notably, InteractiveOmni-4B\nis comparable to the much larger model like Qwen2.5-Omni-7B on general\nbenchmarks, and it can retain 97% of the performance of the InteractiveOmni-8B\nwhile utilizing only 50% of the model size. Achieving state-of-the-art results\nagainst similarly sized models across image, audio, video understanding, and\nspeech generation tasks, InteractiveOmni is an accessible, open-source\nfoundation for next-generation intelligent interactive systems."}
{"id": "2510.13756", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.13756", "abs": "https://arxiv.org/abs/2510.13756", "authors": ["Junhong Shen", "Mu Cai", "Bo Hu", "Ameet Talwalkar", "David A Ross", "Cordelia Schmid", "Alireza Fathi"], "title": "RECODE: Reasoning Through Code Generation for Visual Question Answering", "comment": null, "summary": "Multimodal Large Language Models (MLLMs) struggle with precise reasoning for\nstructured visuals like charts and diagrams, as pixel-based perception lacks a\nmechanism for verification. To address this, we propose to leverage derendering\n-- the process of reverse-engineering visuals into executable code -- as a new\nmodality for verifiable visual reasoning. Specifically, we propose RECODE, an\nagentic framework that first generates multiple candidate programs to reproduce\nthe input image. It then uses a critic to select the most faithful\nreconstruction and iteratively refines the code. This process not only\ntransforms an ambiguous perceptual task into a verifiable, symbolic problem,\nbut also enables precise calculations and logical inferences later on. On\nvarious visual reasoning benchmarks such as CharXiv, ChartQA, and Geometry3K,\nRECODE significantly outperforms methods that do not leverage code or only use\ncode for drawing auxiliary lines or cropping. Our work demonstrates that\ngrounding visual perception in executable code provides a new path toward more\naccurate and verifiable multimodal reasoning."}
{"id": "2510.13759", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13759", "abs": "https://arxiv.org/abs/2510.13759", "authors": ["Kai Zou", "Ziqi Huang", "Yuhao Dong", "Shulin Tian", "Dian Zheng", "Hongbo Liu", "Jingwen He", "Bin Liu", "Yu Qiao", "Ziwei Liu"], "title": "Uni-MMMU: A Massive Multi-discipline Multimodal Unified Benchmark", "comment": "Equal contributions from frst three authors. Project page:\n  https://vchitect.github.io/Uni-MMMU-Project/ Code:\n  https://github.com/vchitect/Uni-MMMU", "summary": "Unified multimodal models aim to jointly enable visual understanding and\ngeneration, yet current benchmarks rarely examine their true integration.\nExisting evaluations either treat the two abilities in isolation or overlook\ntasks that inherently couple them. To address this gap, we present Uni-MMMU, a\ncomprehensive and discipline-aware benchmark that systematically unfolds the\nbidirectional synergy between generation and understanding across eight\nreasoning-centric domains, including science, coding, mathematics, and puzzles.\nEach task is bidirectionally coupled, demanding models to (i) leverage\nconceptual understanding to guide precise visual synthesis, or (ii) utilize\ngeneration as a cognitive scaffold for analytical reasoning. Uni-MMMU\nincorporates verifiable intermediate reasoning steps, unique ground truths, and\na reproducible scoring protocol for both textual and visual outputs. Through\nextensive evaluation of state-of-the-art unified, generation-only, and\nunderstanding-only models, we reveal substantial performance disparities and\ncross-modal dependencies, offering new insights into when and how these\nabilities reinforce one another, and establishing a reliable foundation for\nadvancing unified models."}
{"id": "2510.13787", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13787", "abs": "https://arxiv.org/abs/2510.13787", "authors": ["Seyed Mohammad Mousavi", "Morteza Analoui"], "title": "Adaptive Visual Conditioning for Semantic Consistency in Diffusion-Based Story Continuation", "comment": null, "summary": "Story continuation focuses on generating the next image in a narrative\nsequence so that it remains coherent with both the ongoing text description and\nthe previously observed images. A central challenge in this setting lies in\nutilizing prior visual context effectively, while ensuring semantic alignment\nwith the current textual input. In this work, we introduce AVC (Adaptive Visual\nConditioning), a framework for diffusion-based story continuation. AVC employs\nthe CLIP model to retrieve the most semantically aligned image from previous\nframes. Crucially, when no sufficiently relevant image is found, AVC adaptively\nrestricts the influence of prior visuals to only the early stages of the\ndiffusion process. This enables the model to exploit visual context when\nbeneficial, while avoiding the injection of misleading or irrelevant\ninformation. Furthermore, we improve data quality by re-captioning a noisy\ndataset using large language models, thereby strengthening textual supervision\nand semantic alignment. Quantitative results and human evaluations demonstrate\nthat AVC achieves superior coherence, semantic consistency, and visual fidelity\ncompared to strong baselines, particularly in challenging cases where prior\nvisuals conflict with the current input."}
{"id": "2510.13795", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.13795", "abs": "https://arxiv.org/abs/2510.13795", "authors": ["Yi Zhang", "Bolin Ni", "Xin-Sheng Chen", "Heng-Rui Zhang", "Yongming Rao", "Houwen Peng", "Qinglin Lu", "Han Hu", "Meng-Hao Guo", "Shi-Min Hu"], "title": "Bee: A High-Quality Corpus and Full-Stack Suite to Unlock Advanced Fully Open MLLMs", "comment": "homepage: https://open-bee.github.io/", "summary": "Fully open multimodal large language models (MLLMs) currently lag behind\nproprietary counterparts, primarily due to a significant gap in data quality\nfor supervised fine-tuning (SFT). Existing open-source datasets are often\nplagued by widespread noise and a critical deficit in complex reasoning data,\nsuch as Chain-of-Thought (CoT), which hinders the development of advanced model\ncapabilities. Addressing these challenges, our work makes three primary\ncontributions. First, we introduce Honey-Data-15M, a new SFT dataset comprising\napproximately 15 million QA pairs, processed through multiple cleaning\ntechniques and enhanced with a novel dual-level (short and long) CoT enrichment\nstrategy. Second, we introduce HoneyPipe, the data curation pipeline, and its\nunderlying framework DataStudio, providing the community with a transparent and\nadaptable methodology for data curation that moves beyond static dataset\nreleases. Finally, to validate our dataset and pipeline, we train Bee-8B, an 8B\nmodel on Honey-Data-15M. Experiments show that Bee-8B establishes a new\nstate-of-the-art (SOTA) for fully open MLLMs, achieving performance that is\ncompetitive with, and in some cases surpasses, recent semi-open models such as\nInternVL3.5-8B. Our work delivers to the community a suite of foundational\nresources, including: the Honey-Data-15M corpus; the full-stack suite\ncomprising HoneyPipe and DataStudio; training recipes; an evaluation harness;\nand the model weights. This effort demonstrates that a principled focus on data\nquality is a key pathway to developing fully open MLLMs that are highly\ncompetitive with their semi-open counterparts."}
{"id": "2510.13800", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13800", "abs": "https://arxiv.org/abs/2510.13800", "authors": ["Yiming Chen", "Zekun Qi", "Wenyao Zhang", "Xin Jin", "Li Zhang", "Peidong Liu"], "title": "Reasoning in Space via Grounding in the World", "comment": "20 pages, 7 figures", "summary": "In this paper, we claim that 3D visual grounding is the cornerstone of\nspatial reasoning and introduce the Grounded-Spatial Reasoner (GS-Reasoner) to\nexplore the effective spatial representations that bridge the gap between them.\nExisting 3D LLMs suffer from the absence of a unified 3D representation capable\nof jointly capturing semantic and geometric information. This deficiency is\nmanifested either in poor performance on grounding or in an excessive reliance\non external modules, ultimately hindering the seamless integration of grounding\nand spatial reasoning. To address this, we propose a simple yet effective\ndual-path pooling mechanism that tightly aligns geometric features with both\nsemantic and positional cues, constructing a unified image patch-based 3D\nrepresentation that encapsulates all essential information without increasing\nthe number of input tokens. Leveraging this holistic representation,\nGS-Reasoner is the first 3D LLM that achieves autoregressive grounding entirely\nwithout external modules while delivering performance comparable to\nstate-of-the-art models, establishing a unified and self-contained framework\nfor 3D spatial reasoning. To further bridge grounding and spatial reasoning, we\nintroduce the Grounded Chain-of-Thought (GCoT) dataset. This dataset is\nmeticulously curated to include both 3D bounding box annotations for objects\nreferenced in reasoning questions and step-by-step reasoning paths that\nintegrate grounding as a core component of the problem-solving process.\nExtensive experiments demonstrate that GS-Reasoner achieves impressive results\non 3D visual grounding, which in turn significantly enhances its spatial\nreasoning capabilities, leading to state-of-the-art performance."}
{"id": "2510.13804", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.13804", "abs": "https://arxiv.org/abs/2510.13804", "authors": ["Xinchen Zhang", "Xiaoying Zhang", "Youbin Wu", "Yanbin Cao", "Renrui Zhang", "Ruihang Chu", "Ling Yang", "Yujiu Yang"], "title": "Generative Universal Verifier as Multimodal Meta-Reasoner", "comment": null, "summary": "We introduce Generative Universal Verifier, a novel concept and plugin\ndesigned for next-generation multimodal reasoning in vision-language models and\nunified multimodal models, providing the fundamental capability of reflection\nand refinement on visual outcomes during the reasoning and generation process.\nThis work makes three main contributions: (1) We build ViVerBench, a\ncomprehensive benchmark spanning 16 categories of critical tasks for evaluating\nvisual outcomes in multimodal reasoning. Results show that existing VLMs\nconsistently underperform across these tasks, underscoring a substantial gap\nfrom human-level capability in reliable visual verification. (2) We design two\nautomated pipelines to construct large-scale visual verification data and train\nOmniVerifier-7B, the first omni-capable generative verifier trained for\nuniversal visual verification and achieves notable gains on ViVerBench(+8.3).\nThrough training, we identify three atomic capabilities in visual verification\nand demonstrate how they generalize and interact synergistically. (3) We\npropose OmniVerifier-TTS, a sequential test-time scaling paradigm that\nleverages the universal verifier to bridge image generation and editing within\nunified models, enhancing the upper bound of generative ability through\niterative fine-grained optimization. Beyond generation, we extend universal\nverifier to broader world-modeling interleaved reasoning scenarios.\nEmpirically, OmniVerifier-TTS achieves improvements on T2I-ReasonBench(+3.7),\nand GenEval++(+4.3), outperforming existing parallel test-time scaling methods,\nsuch as Best-of-N. By endowing multimodal reasoning with reliable visual\nverification, OmniVerifier advances both reliable reflection during generation\nand scalable test-time refinement, marking a step toward more trustworthy and\ncontrollable next-generation reasoning systems."}
{"id": "2510.13808", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13808", "abs": "https://arxiv.org/abs/2510.13808", "authors": ["Dominick Reilly", "Manish Kumar Govind", "Le Xue", "Srijan Das"], "title": "VisCoP: Visual Probing for Video Domain Adaptation of Vision Language Models", "comment": null, "summary": "Large Vision-Language Models (VLMs) excel at general visual reasoning tasks\nbut exhibit sharp performance degradation when applied to novel domains with\nsubstantial distribution shifts from pretraining data. Existing domain\nadaptation approaches finetune different VLM components, but this often results\nin limited domain-specific feature learning or catastrophic forgetting of prior\ncapabilities. To address these issues, we introduce Vision Contextualized\nProbing (VisCoP), which augments the VLM's vision encoder with a compact set of\nlearnable visual probes. These probes enable efficient domain-specific\nadaptation with minimal modification to pretrained parameters. We evaluate\nVisCoP across three challenging domain adaptation settings-cross-view\n(exocentric to egocentric), cross-modal (RGB to depth), and cross-task (human\nunderstanding to robot control). Experiments show that VisCoP consistently\noutperforms existing adaptation strategies, achieving superior performance on\ntarget domains while effectively retaining source-domain knowledge."}
{"id": "2510.12845", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.12845", "abs": "https://arxiv.org/abs/2510.12845", "authors": ["Jesse Atuhurra", "Iqra Ali", "Tomoya Iwakura", "Hidetaka Kamigaito", "Tatsuya Hiraoka"], "title": "VLURes: Benchmarking VLM Visual and Linguistic Understanding in Low-Resource Languages", "comment": null, "summary": "Vision Language Models (VLMs) are pivotal for advancing perception in\nintelligent agents. Yet, evaluation of VLMs remains limited to predominantly\nEnglish-centric benchmarks in which the image-text pairs comprise short texts.\nTo evaluate VLM fine-grained abilities, in four languages under long-text\nsettings, we introduce a novel multilingual benchmark VLURes featuring eight\nvision-and-language tasks, and a pioneering unrelatedness task, to probe the\nfine-grained Visual and Linguistic Understanding capabilities of VLMs across\nEnglish, Japanese, and low-resource languages, Swahili, and Urdu. Our datasets,\ncurated from web resources in the target language, encompass ten diverse image\ncategories and rich textual context, introducing valuable vision-language\nresources for Swahili and Urdu. By prompting VLMs to generate responses and\nrationales, evaluated automatically and by native speakers, we uncover\nperformance disparities across languages and tasks critical to intelligent\nagents, such as object recognition, scene understanding, and relationship\nunderstanding. We conducted evaluations of ten VLMs with VLURes. The best\nperforming model, GPT-4o, achieves an overall accuracy of 90.8% and lags human\nperformance by 6.7%, though the gap is larger for open-source models. The gap\nhighlights VLURes' critical role in developing intelligent agents to tackle\nmulti-modal visual reasoning."}
{"id": "2510.13721", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.13721", "abs": "https://arxiv.org/abs/2510.13721", "authors": ["Run Luo", "Xiaobo Xia", "Lu Wang", "Longze Chen", "Renke Shan", "Jing Luo", "Min Yang", "Tat-Seng Chua"], "title": "NExT-OMNI: Towards Any-to-Any Omnimodal Foundation Models with Discrete Flow Matching", "comment": null, "summary": "Next-generation multimodal foundation models capable of any-to-any\ncross-modal generation and multi-turn interaction will serve as core components\nof artificial general intelligence systems, playing a pivotal role in\nhuman-machine interaction. However, most existing multimodal models remain\nconstrained by autoregressive architectures, whose inherent limitations prevent\na balanced integration of understanding and generation capabilities. Although\nhybrid and decoupling strategies have been explored to address these tasks\nwithin unified frameworks separately, their redundant, non-integrated designs\nlimit their applicability to broader scenarios, such as cross-modal\nretrieval.In this work, we introduce NExT-OMNI, an open-source omnimodal\nfoundation model that achieves unified modeling through discrete flow\nparadigms. By leveraging metric-induced probability paths and kinetic optimal\nvelocities, NExT-OMNI natively supports any-to-any understanding and generation\nwith enhanced response efficiency, while enabling broader application scenarios\nthrough concise unified representations rather than task-decoupled designs.\nTrained on large-scale interleaved text, image, video, and audio data,\nNExT-OMNI delivers competitive performance on multimodal generation and\nunderstanding benchmarks, while outperforming prior unified models in\nmulti-turn multimodal interaction and cross-modal retrieval, highlighting its\narchitectural advantages as a next-generation multimodal foundation model. To\nadvance further research, we release training details, data protocols, and\nopen-source both the code and model checkpoints."}
{"id": "2510.13796", "categories": ["cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2510.13796", "abs": "https://arxiv.org/abs/2510.13796", "authors": ["Shuyu Wu", "Ziqiao Ma", "Xiaoxi Luo", "Yidong Huang", "Josue Torres-Fonseca", "Freda Shi", "Joyce Chai"], "title": "The Mechanistic Emergence of Symbol Grounding in Language Models", "comment": null, "summary": "Symbol grounding (Harnad, 1990) describes how symbols such as words acquire\ntheir meanings by connecting to real-world sensorimotor experiences. Recent\nwork has shown preliminary evidence that grounding may emerge in\n(vision-)language models trained at scale without using explicit grounding\nobjectives. Yet, the specific loci of this emergence and the mechanisms that\ndrive it remain largely unexplored. To address this problem, we introduce a\ncontrolled evaluation framework that systematically traces how symbol grounding\narises within the internal computations through mechanistic and causal\nanalysis. Our findings show that grounding concentrates in middle-layer\ncomputations and is implemented through the aggregate mechanism, where\nattention heads aggregate the environmental ground to support the prediction of\nlinguistic forms. This phenomenon replicates in multimodal dialogue and across\narchitectures (Transformers and state-space models), but not in unidirectional\nLSTMs. Our results provide behavioral and mechanistic evidence that symbol\ngrounding can emerge in language models, with practical implications for\npredicting and potentially controlling the reliability of generation."}
