{"id": "2510.19954", "categories": ["cs.AI", "cs.DB", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.19954", "abs": "https://arxiv.org/abs/2510.19954", "authors": ["Joseph Meyer", "Divyansha Lachi", "Reza Mohammadi", "Roshan Reddy Upendra", "Eva L. Dyer", "Mark Li", "Tom Palczewski"], "title": "RELATE: A Schema-Agnostic Perceiver Encoder for Multimodal Relational Graphs", "comment": "6 pages", "summary": "Relational multi-table data is common in domains such as e-commerce,\nhealthcare, and scientific research, and can be naturally represented as\nheterogeneous temporal graphs with multi-modal node attributes. Existing graph\nneural networks (GNNs) rely on schema-specific feature encoders, requiring\nseparate modules for each node type and feature column, which hinders\nscalability and parameter sharing. We introduce RELATE (Relational Encoder for\nLatent Aggregation of Typed Entities), a schema-agnostic, plug-and-play feature\nencoder that can be used with any general purpose GNN. RELATE employs shared\nmodality-specific encoders for categorical, numerical, textual, and temporal\nattributes, followed by a Perceiver-style cross-attention module that\naggregates features into a fixed-size, permutation-invariant node\nrepresentation. We evaluate RELATE on ReLGNN and HGT in the RelBench benchmark,\nwhere it achieves performance within 3% of schema-specific encoders while\nreducing parameter counts by up to 5x. This design supports varying schemas and\nenables multi-dataset pretraining for general-purpose GNNs, paving the way\ntoward foundation models for relational graph data."}
{"id": "2510.20310", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20310", "abs": "https://arxiv.org/abs/2510.20310", "authors": ["Mingliang Zhai", "Hansheng Liang", "Xiaomeng Fan", "Zhi Gao", "Chuanhao Li", "Che Sun", "Xu Bin", "Yuwei Wu", "Yunde Jia"], "title": "Multi-Step Reasoning for Embodied Question Answering via Tool Augmentation", "comment": "16 pages, 7 figures, 8 tables", "summary": "Embodied Question Answering (EQA) requires agents to explore 3D environments\nto obtain observations and answer questions related to the scene. Existing\nmethods leverage VLMs to directly explore the environment and answer questions\nwithout explicit thinking or planning, which limits their reasoning ability and\nresults in excessive or inefficient exploration as well as ineffective\nresponses. In this paper, we introduce ToolEQA, an agent that integrates\nexternal tools with multi-step reasoning, where external tools can provide more\nuseful information for completing the task, helping the model derive better\nexploration directions in the next step of reasoning and thus obtaining\nadditional effective information. This enables ToolEQA to generate more\naccurate responses with a shorter exploration distance. To enhance the model's\nability for tool-usage and multi-step reasoning, we further design a novel EQA\ndata generation pipeline that automatically constructs large-scale EQA tasks\nwith reasoning trajectories and corresponding answers. Based on the pipeline,\nwe collect the EQA-RT dataset that contains about 18K tasks, divided into a\ntraining set EQA-RT-Train, and two test sets EQA-RT-Seen (scenes overlapping\nwith the training set) and EQA-RT-Unseen (novel scenes). Experiments on\nEQA-RT-Seen and EQA-RT-Unseen show that ToolEQA improves the success rate by\n9.2~20.2% over state-of-the-art baselines, while outperforming the zero-shot\nToolEQA by 10% in success rate. In addition, ToolEQA also achieves\nstate-of-the-art performance on the HM-EQA, OpenEQA, and EXPRESS-Bench\ndatasets, demonstrating its generality. Our homepage see\nhttps://tooleqa.github.io."}
{"id": "2510.20345", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20345", "abs": "https://arxiv.org/abs/2510.20345", "authors": ["Haonan Bian"], "title": "LLM-empowered knowledge graph construction: A survey", "comment": null, "summary": "Knowledge Graphs (KGs) have long served as a fundamental infrastructure for\nstructured knowledge representation and reasoning. With the advent of Large\nLanguage Models (LLMs), the construction of KGs has entered a new\nparadigm-shifting from rule-based and statistical pipelines to language-driven\nand generative frameworks. This survey provides a comprehensive overview of\nrecent progress in LLM-empowered knowledge graph construction, systematically\nanalyzing how LLMs reshape the classical three-layered pipeline of ontology\nengineering, knowledge extraction, and knowledge fusion.\n  We first revisit traditional KG methodologies to establish conceptual\nfoundations, and then review emerging LLM-driven approaches from two\ncomplementary perspectives: schema-based paradigms, which emphasize structure,\nnormalization, and consistency; and schema-free paradigms, which highlight\nflexibility, adaptability, and open discovery. Across each stage, we synthesize\nrepresentative frameworks, analyze their technical mechanisms, and identify\ntheir limitations.\n  Finally, the survey outlines key trends and future research directions,\nincluding KG-based reasoning for LLMs, dynamic knowledge memory for agentic\nsystems, and multimodal KG construction. Through this systematic review, we aim\nto clarify the evolving interplay between LLMs and knowledge graphs, bridging\nsymbolic knowledge engineering and neural semantic understanding toward the\ndevelopment of adaptive, explainable, and intelligent knowledge systems."}
{"id": "2510.20632", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20632", "abs": "https://arxiv.org/abs/2510.20632", "authors": ["Shuyi Xie", "Ziqin Liew", "Hailing Zhang", "Haibo Zhang", "Ling Hu", "Zhiqiang Zhou", "Shuman Liu", "Anxiang Zeng"], "title": "Towards Reliable Evaluation of Large Language Models for Multilingual and Multimodal E-Commerce Applications", "comment": null, "summary": "Large Language Models (LLMs) excel on general-purpose NLP benchmarks, yet\ntheir capabilities in specialized domains remain underexplored. In e-commerce,\nexisting evaluations-such as EcomInstruct, ChineseEcomQA, eCeLLM, and Shopping\nMMLU-suffer from limited task diversity (e.g., lacking product guidance and\nafter-sales issues), limited task modalities (e.g., absence of multimodal\ndata), synthetic or curated data, and a narrow focus on English and Chinese,\nleaving practitioners without reliable tools to assess models on complex,\nreal-world shopping scenarios. We introduce EcomEval, a comprehensive\nmultilingual and multimodal benchmark for evaluating LLMs in e-commerce.\nEcomEval covers six categories and 37 tasks (including 8 multimodal tasks),\nsourced primarily from authentic customer queries and transaction logs,\nreflecting the noisy and heterogeneous nature of real business interactions. To\nensure both quality and scalability of reference answers, we adopt a\nsemi-automatic pipeline in which large models draft candidate responses\nsubsequently reviewed and modified by over 50 expert annotators with strong\ne-commerce and multilingual expertise. We define difficulty levels for each\nquestion and task category by averaging evaluation scores across models with\ndifferent sizes and capabilities, enabling challenge-oriented and fine-grained\nassessment. EcomEval also spans seven languages-including five low-resource\nSoutheast Asian languages-offering a multilingual perspective absent from prior\nwork."}
{"id": "2510.19955", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.19955", "abs": "https://arxiv.org/abs/2510.19955", "authors": ["Márcus Vinícius Lobo Costa", "Sherlon Almeida da Silva", "Bárbara Caroline Benato", "Leo Sampaio Ferraz Ribeiro", "Moacir Antonelli Ponti"], "title": "Transformed Multi-view 3D Shape Features with Contrastive Learning", "comment": null, "summary": "This paper addresses the challenges in representation learning of 3D shape\nfeatures by investigating state-of-the-art backbones paired with both\ncontrastive supervised and self-supervised learning objectives. Computer vision\nmethods struggle with recognizing 3D objects from 2D images, often requiring\nextensive labeled data and relying on Convolutional Neural Networks (CNNs) that\nmay overlook crucial shape relationships. Our work demonstrates that Vision\nTransformers (ViTs) based architectures, when paired with modern contrastive\nobjectives, achieve promising results in multi-view 3D analysis on our\ndownstream tasks, unifying contrastive and 3D shape understanding pipelines.\nFor example, supervised contrastive losses reached about 90.6% accuracy on\nModelNet10. The use of ViTs and contrastive learning, leveraging ViTs' ability\nto understand overall shapes and contrastive learning's effectiveness,\novercomes the need for extensive labeled data and the limitations of CNNs in\ncapturing crucial shape relationships. The success stems from capturing global\nshape semantics via ViTs and refining local discriminative features through\ncontrastive optimization. Importantly, our approach is empirical, as it is\ngrounded on extensive experimental evaluation to validate the effectiveness of\ncombining ViTs with contrastive objectives for 3D representation learning."}
{"id": "2510.19871", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.19871", "abs": "https://arxiv.org/abs/2510.19871", "authors": ["Yatai Ji", "Teng Wang", "Yuying Ge", "Zhiheng Liu", "Sidi Yang", "Ying Shan", "Ping Luo"], "title": "From Denoising to Refining: A Corrective Framework for Vision-Language Diffusion Model", "comment": null, "summary": "Discrete diffusion models have emerged as a promising direction for\nvision-language tasks, offering bidirectional context modeling and theoretical\nparallelization. However, their practical application is severely hindered by a\ntrain-inference discrepancy, which leads to catastrophic error cascades:\ninitial token errors during parallel decoding pollute the generation context,\ntriggering a chain reaction of compounding errors and leading to syntactic\nerrors and semantic hallucinations. To address this fundamental challenge, we\nreframe the generation process from passive denoising to active refining. We\nintroduce ReDiff, a refining-enhanced diffusion framework that teaches the\nmodel to identify and correct its own errors. Our approach features a two-stage\ntraining process: first, we instill a foundational revision capability by\ntraining the model to revise synthetic errors; second, we implement a novel\nonline self-correction loop where the model is explicitly trained to revise its\nown flawed drafts by learning from an expert's corrections. This mistake-driven\nlearning endows the model with the crucial ability to revisit and refine its\nalready generated output, effectively breaking the error cascade. Extensive\nexperiments demonstrate that ReDiff significantly improves the coherence and\nfactual accuracy of generated content, enabling stable and efficient parallel\ngeneration far superior to traditional denoising methods. Our codes and models\nare available at https://rediff-hku.github.io/."}
{"id": "2510.19892", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.19892", "abs": "https://arxiv.org/abs/2510.19892", "authors": ["Nishant Balepur", "Dang Nguyen", "Dayeon Ki"], "title": "Can They Dixit? Yes they Can! Dixit as a Playground for Multimodal Language Model Capabilities", "comment": "Accepted as a Spotlight paper at the EMNLP 2025 Wordplay Workshop", "summary": "Multi-modal large language models (MLMs) are often assessed on static,\nindividual benchmarks -- which cannot jointly assess MLM capabilities in a\nsingle task -- or rely on human or model pairwise comparisons -- which is\nhighly subjective, expensive, and allows models to exploit superficial\nshortcuts (e.g., verbosity) to inflate their win-rates. To overcome these\nissues, we propose game-based evaluations to holistically assess MLM\ncapabilities. Games require multiple abilities for players to win, are\ninherently competitive, and are governed by fix, objective rules, and makes\nevaluation more engaging, providing a robust framework to address the\naforementioned challenges. We manifest this evaluation specifically through\nDixit, a fantasy card game where players must generate captions for a card that\ntrick some, but not all players, into selecting the played card. Our\nquantitative experiments with five MLMs show Dixit win-rate rankings are\nperfectly correlated with those on popular MLM benchmarks, while games between\nhuman and MLM players in Dixit reveal several differences between agent\nstrategies and areas of improvement for MLM reasoning."}
{"id": "2510.19981", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.19981", "abs": "https://arxiv.org/abs/2510.19981", "authors": ["Martha Teiko Teye", "Ori Maoz", "Matthias Rottmann"], "title": "FutrTrack: A Camera-LiDAR Fusion Transformer for 3D Multiple Object Tracking", "comment": null, "summary": "We propose FutrTrack, a modular camera-LiDAR multi-object tracking framework\nthat builds on existing 3D detectors by introducing a transformer-based\nsmoother and a fusion-driven tracker. Inspired by query-based tracking\nframeworks, FutrTrack employs a multimodal two-stage transformer refinement and\ntracking pipeline. Our fusion tracker integrates bounding boxes with multimodal\nbird's-eye-view (BEV) fusion features from multiple cameras and LiDAR without\nthe need for an explicit motion model. The tracker assigns and propagates\nidentities across frames, leveraging both geometric and semantic cues for\nrobust re-identification under occlusion and viewpoint changes. Prior to\ntracking, we refine sequences of bounding boxes with a temporal smoother over a\nmoving window to refine trajectories, reduce jitter, and improve spatial\nconsistency. Evaluated on nuScenes and KITTI, FutrTrack demonstrates that\nquery-based transformer tracking methods benefit significantly from multimodal\nsensor features compared with previous single-sensor approaches. With an aMOTA\nof 74.7 on the nuScenes test set, FutrTrack achieves strong performance on 3D\nMOT benchmarks, reducing identity switches while maintaining competitive\naccuracy. Our approach provides an efficient framework for improving\ntransformer-based trackers to compete with other neural-network-based methods\neven with limited data and without pretraining."}
{"id": "2510.19892", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.19892", "abs": "https://arxiv.org/abs/2510.19892", "authors": ["Nishant Balepur", "Dang Nguyen", "Dayeon Ki"], "title": "Can They Dixit? Yes they Can! Dixit as a Playground for Multimodal Language Model Capabilities", "comment": "Accepted as a Spotlight paper at the EMNLP 2025 Wordplay Workshop", "summary": "Multi-modal large language models (MLMs) are often assessed on static,\nindividual benchmarks -- which cannot jointly assess MLM capabilities in a\nsingle task -- or rely on human or model pairwise comparisons -- which is\nhighly subjective, expensive, and allows models to exploit superficial\nshortcuts (e.g., verbosity) to inflate their win-rates. To overcome these\nissues, we propose game-based evaluations to holistically assess MLM\ncapabilities. Games require multiple abilities for players to win, are\ninherently competitive, and are governed by fix, objective rules, and makes\nevaluation more engaging, providing a robust framework to address the\naforementioned challenges. We manifest this evaluation specifically through\nDixit, a fantasy card game where players must generate captions for a card that\ntrick some, but not all players, into selecting the played card. Our\nquantitative experiments with five MLMs show Dixit win-rate rankings are\nperfectly correlated with those on popular MLM benchmarks, while games between\nhuman and MLM players in Dixit reveal several differences between agent\nstrategies and areas of improvement for MLM reasoning."}
{"id": "2510.20093", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20093", "abs": "https://arxiv.org/abs/2510.20093", "authors": ["Jiho Park", "Sieun Choi", "Jaeyoon Seo", "Jihie Kim"], "title": "StableSketcher: Enhancing Diffusion Model for Pixel-based Sketch Generation via Visual Question Answering Feedback", "comment": "Under review at IEEE Access. Author-submitted preprint. Not the\n  IEEE-published version", "summary": "Although recent advancements in diffusion models have significantly enriched\nthe quality of generated images, challenges remain in synthesizing pixel-based\nhuman-drawn sketches, a representative example of abstract expression. To\ncombat these challenges, we propose StableSketcher, a novel framework that\nempowers diffusion models to generate hand-drawn sketches with high prompt\nfidelity. Within this framework, we fine-tune the variational autoencoder to\noptimize latent decoding, enabling it to better capture the characteristics of\nsketches. In parallel, we integrate a new reward function for reinforcement\nlearning based on visual question answering, which improves text-image\nalignment and semantic consistency. Extensive experiments demonstrate that\nStableSketcher generates sketches with improved stylistic fidelity, achieving\nbetter alignment with prompts compared to the Stable Diffusion baseline.\nAdditionally, we introduce SketchDUO, to the best of our knowledge, the first\ndataset comprising instance-level sketches paired with captions and\nquestion-answer pairs, thereby addressing the limitations of existing datasets\nthat rely on image-label pairs. Our code and dataset will be made publicly\navailable upon acceptance."}
{"id": "2510.20042", "categories": ["cs.CV", "I.2.10; I.2.6; I.4.9"], "pdf": "https://arxiv.org/pdf/2510.20042", "abs": "https://arxiv.org/abs/2510.20042", "authors": ["Huichan Seo", "Sieun Choi", "Minki Hong", "Yi Zhou", "Junseo Kim", "Lukman Ismaila", "Naome Etori", "Mehul Agarwal", "Zhixuan Liu", "Jihie Kim", "Jean Oh"], "title": "Exposing Blindspots: Cultural Bias Evaluation in Generative Image Models", "comment": "28 pages, 8 figures. Submitted to the Second Conference of the\n  International Association for Safe and Ethical Artificial Intelligence\n  (IASEAI '26)", "summary": "Generative image models produce striking visuals yet often misrepresent\nculture. Prior work has examined cultural bias mainly in text-to-image (T2I)\nsystems, leaving image-to-image (I2I) editors underexplored. We bridge this gap\nwith a unified evaluation across six countries, an 8-category/36-subcategory\nschema, and era-aware prompts, auditing both T2I generation and I2I editing\nunder a standardized protocol that yields comparable diagnostics. Using open\nmodels with fixed settings, we derive cross-country, cross-era, and\ncross-category evaluations. Our framework combines standard automatic metrics,\na culture-aware retrieval-augmented VQA, and expert human judgments collected\nfrom native reviewers. To enable reproducibility, we release the complete image\ncorpus, prompts, and configurations. Our study reveals three findings: (1)\nunder country-agnostic prompts, models default to Global-North, modern-leaning\ndepictions that flatten cross-country distinctions; (2) iterative I2I editing\nerodes cultural fidelity even when conventional metrics remain flat or improve;\nand (3) I2I models apply superficial cues (palette shifts, generic props)\nrather than era-consistent, context-aware changes, often retaining source\nidentity for Global-South targets. These results highlight that\nculture-sensitive edits remain unreliable in current systems. By releasing\nstandardized data, prompts, and human evaluation protocols, we provide a\nreproducible, culture-centered benchmark for diagnosing and tracking cultural\nbias in generative image models."}
{"id": "2510.20154", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20154", "abs": "https://arxiv.org/abs/2510.20154", "authors": ["Anthony Dubreuil", "Antoine Gourru", "Christine Largeron", "Amine Trabelsi"], "title": "Are Stereotypes Leading LLMs' Zero-Shot Stance Detection ?", "comment": "Accepted in EMNLP 2025 (Main)", "summary": "Large Language Models inherit stereotypes from their pretraining data,\nleading to biased behavior toward certain social groups in many Natural\nLanguage Processing tasks, such as hateful speech detection or sentiment\nanalysis. Surprisingly, the evaluation of this kind of bias in stance detection\nmethods has been largely overlooked by the community. Stance Detection involves\nlabeling a statement as being against, in favor, or neutral towards a specific\ntarget and is among the most sensitive NLP tasks, as it often relates to\npolitical leanings. In this paper, we focus on the bias of Large Language\nModels when performing stance detection in a zero-shot setting. We\nautomatically annotate posts in pre-existing stance detection datasets with two\nattributes: dialect or vernacular of a specific group and text\ncomplexity/readability, to investigate whether these attributes influence the\nmodel's stance detection decisions. Our results show that LLMs exhibit\nsignificant stereotypes in stance detection tasks, such as incorrectly\nassociating pro-marijuana views with low text complexity and African American\ndialect with opposition to Donald Trump."}
{"id": "2510.20154", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20154", "abs": "https://arxiv.org/abs/2510.20154", "authors": ["Anthony Dubreuil", "Antoine Gourru", "Christine Largeron", "Amine Trabelsi"], "title": "Are Stereotypes Leading LLMs' Zero-Shot Stance Detection ?", "comment": "Accepted in EMNLP 2025 (Main)", "summary": "Large Language Models inherit stereotypes from their pretraining data,\nleading to biased behavior toward certain social groups in many Natural\nLanguage Processing tasks, such as hateful speech detection or sentiment\nanalysis. Surprisingly, the evaluation of this kind of bias in stance detection\nmethods has been largely overlooked by the community. Stance Detection involves\nlabeling a statement as being against, in favor, or neutral towards a specific\ntarget and is among the most sensitive NLP tasks, as it often relates to\npolitical leanings. In this paper, we focus on the bias of Large Language\nModels when performing stance detection in a zero-shot setting. We\nautomatically annotate posts in pre-existing stance detection datasets with two\nattributes: dialect or vernacular of a specific group and text\ncomplexity/readability, to investigate whether these attributes influence the\nmodel's stance detection decisions. Our results show that LLMs exhibit\nsignificant stereotypes in stance detection tasks, such as incorrectly\nassociating pro-marijuana views with low text complexity and African American\ndialect with opposition to Donald Trump."}
{"id": "2510.20093", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20093", "abs": "https://arxiv.org/abs/2510.20093", "authors": ["Jiho Park", "Sieun Choi", "Jaeyoon Seo", "Jihie Kim"], "title": "StableSketcher: Enhancing Diffusion Model for Pixel-based Sketch Generation via Visual Question Answering Feedback", "comment": "Under review at IEEE Access. Author-submitted preprint. Not the\n  IEEE-published version", "summary": "Although recent advancements in diffusion models have significantly enriched\nthe quality of generated images, challenges remain in synthesizing pixel-based\nhuman-drawn sketches, a representative example of abstract expression. To\ncombat these challenges, we propose StableSketcher, a novel framework that\nempowers diffusion models to generate hand-drawn sketches with high prompt\nfidelity. Within this framework, we fine-tune the variational autoencoder to\noptimize latent decoding, enabling it to better capture the characteristics of\nsketches. In parallel, we integrate a new reward function for reinforcement\nlearning based on visual question answering, which improves text-image\nalignment and semantic consistency. Extensive experiments demonstrate that\nStableSketcher generates sketches with improved stylistic fidelity, achieving\nbetter alignment with prompts compared to the Stable Diffusion baseline.\nAdditionally, we introduce SketchDUO, to the best of our knowledge, the first\ndataset comprising instance-level sketches paired with captions and\nquestion-answer pairs, thereby addressing the limitations of existing datasets\nthat rely on image-label pairs. Our code and dataset will be made publicly\navailable upon acceptance."}
{"id": "2510.20381", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20381", "abs": "https://arxiv.org/abs/2510.20381", "authors": ["Son T. Luu", "Trung Vo", "Hiep Nguyen", "Khanh Quoc Tran", "Kiet Van Nguyen", "Vu Tran", "Ngan Luu-Thuy Nguyen", "Le-Minh Nguyen"], "title": "VLSP 2025 MLQA-TSR Challenge: Vietnamese Multimodal Legal Question Answering on Traffic Sign Regulation", "comment": "VLSP 2025 MLQA-TSR Share Task", "summary": "This paper presents the VLSP 2025 MLQA-TSR - the multimodal legal question\nanswering on traffic sign regulation shared task at VLSP 2025. VLSP 2025\nMLQA-TSR comprises two subtasks: multimodal legal retrieval and multimodal\nquestion answering. The goal is to advance research on Vietnamese multimodal\nlegal text processing and to provide a benchmark dataset for building and\nevaluating intelligent systems in multimodal legal domains, with a focus on\ntraffic sign regulation in Vietnam. The best-reported results on VLSP 2025\nMLQA-TSR are an F2 score of 64.55% for multimodal legal retrieval and an\naccuracy of 86.30% for multimodal question answering."}
{"id": "2510.20229", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.20229", "abs": "https://arxiv.org/abs/2510.20229", "authors": ["Ge Zheng", "Jiaye Qian", "Jiajin Tang", "Sibei Yang"], "title": "Why LVLMs Are More Prone to Hallucinations in Longer Responses: The Role of Context", "comment": null, "summary": "Large Vision-Language Models (LVLMs) have made significant progress in recent\nyears but are also prone to hallucination issues. They exhibit more\nhallucinations in longer, free-form responses, often attributed to accumulated\nuncertainties. In this paper, we ask: Does increased hallucination result\nsolely from length-induced errors, or is there a deeper underlying mechanism?\nAfter a series of preliminary experiments and findings, we suggest that the\nrisk of hallucinations is not caused by length itself but by the increased\nreliance on context for coherence and completeness in longer responses.\nBuilding on these insights, we propose a novel \"induce-detect-suppress\"\nframework that actively induces hallucinations through deliberately designed\ncontexts, leverages induced instances for early detection of high-risk cases,\nand ultimately suppresses potential object-level hallucinations during actual\ndecoding. Our approach achieves consistent, significant improvements across all\nbenchmarks, demonstrating its efficacy. The strong detection and improved\nhallucination mitigation not only validate our framework but, more importantly,\nre-validate our hypothesis on context. Rather than solely pursuing performance\ngains, this study aims to provide new insights and serves as a first step\ntoward a deeper exploration of hallucinations in LVLMs' longer responses."}
{"id": "2510.20095", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.20095", "abs": "https://arxiv.org/abs/2510.20095", "authors": ["Ziheng Zhang", "Xinyue Ma", "Arpita Chowdhury", "Elizabeth G. Campolongo", "Matthew J. Thompson", "Net Zhang", "Samuel Stevens", "Hilmar Lapp", "Tanya Berger-Wolf", "Yu Su", "Wei-Lun Chao", "Jianyang Gu"], "title": "BIOCAP: Exploiting Synthetic Captions Beyond Labels in Biological Foundation Models", "comment": "Project page: https://imageomics.github.io/biocap/", "summary": "This work investigates descriptive captions as an additional source of\nsupervision for biological multimodal foundation models. Images and captions\ncan be viewed as complementary samples from the latent morphospace of a\nspecies, each capturing certain biological traits. Incorporating captions\nduring training encourages alignment with this shared latent structure,\nemphasizing potentially diagnostic characters while suppressing spurious\ncorrelations. The main challenge, however, lies in obtaining faithful,\ninstance-specific captions at scale. This requirement has limited the\nutilization of natural language supervision in organismal biology compared with\nmany other scientific domains. We complement this gap by generating synthetic\ncaptions with multimodal large language models (MLLMs), guided by\nWikipedia-derived visual information and taxon-tailored format examples. These\ndomain-specific contexts help reduce hallucination and yield accurate,\ninstance-based descriptive captions. Using these captions, we train BIOCAP\n(i.e., BIOCLIP with Captions), a biological foundation model that captures rich\nsemantics and achieves strong performance in species classification and\ntext-image retrieval. These results demonstrate the value of descriptive\ncaptions beyond labels in bridging biological images with multimodal foundation\nmodels."}
{"id": "2510.20727", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20727", "abs": "https://arxiv.org/abs/2510.20727", "authors": ["Xizhi Wu", "Madeline S. Kreider", "Philip E. Empey", "Chenyu Li", "Yanshan Wang"], "title": "Automated Extraction of Fluoropyrimidine Treatment and Treatment-Related Toxicities from Clinical Notes Using Natural Language Processing", "comment": null, "summary": "Objective: Fluoropyrimidines are widely prescribed for colorectal and breast\ncancers, but are associated with toxicities such as hand-foot syndrome and\ncardiotoxicity. Since toxicity documentation is often embedded in clinical\nnotes, we aimed to develop and evaluate natural language processing (NLP)\nmethods to extract treatment and toxicity information.\n  Materials and Methods: We constructed a gold-standard dataset of 236 clinical\nnotes from 204,165 adult oncology patients. Domain experts annotated categories\nrelated to treatment regimens and toxicities. We developed rule-based, machine\nlearning-based (Random Forest, Support Vector Machine [SVM], Logistic\nRegression [LR]), deep learning-based (BERT, ClinicalBERT), and large language\nmodels (LLM)-based NLP approaches (zero-shot and error-analysis prompting).\nModels used an 80:20 train-test split.\n  Results: Sufficient data existed to train and evaluate 5 annotated\ncategories. Error-analysis prompting achieved optimal precision, recall, and F1\nscores (F1=1.000) for treatment and toxicities extraction, whereas zero-shot\nprompting reached F1=1.000 for treatment and F1=0.876 for toxicities\nextraction.LR and SVM ranked second for toxicities (F1=0.937). Deep learning\nunderperformed, with BERT (F1=0.873 treatment; F1= 0.839 toxicities) and\nClinicalBERT (F1=0.873 treatment; F1 = 0.886 toxicities). Rule-based methods\nserved as our baseline with F1 scores of 0.857 in treatment and 0.858 in\ntoxicities.\n  Discussion: LMM-based approaches outperformed all others, followed by machine\nlearning methods. Machine and deep learning approaches were limited by small\ntraining data and showed limited generalizability, particularly for rare\ncategories.\n  Conclusion: LLM-based NLP most effectively extracted fluoropyrimidine\ntreatment and toxicity information from clinical notes, and has strong\npotential to support oncology research and pharmacovigilance."}
{"id": "2510.20287", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.20287", "abs": "https://arxiv.org/abs/2510.20287", "authors": ["Sauptik Dhar", "Naveen Ramakrishnan", "Michelle Munson"], "title": "Breakdance Video classification in the age of Generative AI", "comment": "11 pages", "summary": "Large Vision Language models have seen huge application in several sports\nuse-cases recently. Most of these works have been targeted towards a limited\nsubset of popular sports like soccer, cricket, basketball etc; focusing on\ngenerative tasks like visual question answering, highlight generation. This\nwork analyzes the applicability of the modern video foundation models (both\nencoder and decoder) for a very niche but hugely popular dance sports -\nbreakdance. Our results show that Video Encoder models continue to outperform\nstate-of-the-art Video Language Models for prediction tasks. We provide\ninsights on how to choose the encoder model and provide a thorough analysis\ninto the workings of a finetuned decoder model for breakdance video\nclassification."}
{"id": "2510.20134", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20134", "abs": "https://arxiv.org/abs/2510.20134", "authors": ["Jiachen Liang", "Ruibing Hou", "Minyang Hu", "Hong Chang", "Shiguang Shan", "Xilin Chen"], "title": "Revisiting Logit Distributions for Reliable Out-of-Distribution Detection", "comment": "Accepted by NeurIPS 2025", "summary": "Out-of-distribution (OOD) detection is critical for ensuring the reliability\nof deep learning models in open-world applications. While post-hoc methods are\nfavored for their efficiency and ease of deployment, existing approaches often\nunderexploit the rich information embedded in the model's logits space. In this\npaper, we propose LogitGap, a novel post-hoc OOD detection method that\nexplicitly exploits the relationship between the maximum logit and the\nremaining logits to enhance the separability between in-distribution (ID) and\nOOD samples. To further improve its effectiveness, we refine LogitGap by\nfocusing on a more compact and informative subset of the logit space.\nSpecifically, we introduce a training-free strategy that automatically\nidentifies the most informative logits for scoring. We provide both theoretical\nanalysis and empirical evidence to validate the effectiveness of our approach.\nExtensive experiments on both vision-language and vision-only models\ndemonstrate that LogitGap consistently achieves state-of-the-art performance\nacross diverse OOD detection scenarios and benchmarks. Code is available at\nhttps://github.com/GIT-LJc/LogitGap."}
{"id": "2510.20095", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.20095", "abs": "https://arxiv.org/abs/2510.20095", "authors": ["Ziheng Zhang", "Xinyue Ma", "Arpita Chowdhury", "Elizabeth G. Campolongo", "Matthew J. Thompson", "Net Zhang", "Samuel Stevens", "Hilmar Lapp", "Tanya Berger-Wolf", "Yu Su", "Wei-Lun Chao", "Jianyang Gu"], "title": "BIOCAP: Exploiting Synthetic Captions Beyond Labels in Biological Foundation Models", "comment": "Project page: https://imageomics.github.io/biocap/", "summary": "This work investigates descriptive captions as an additional source of\nsupervision for biological multimodal foundation models. Images and captions\ncan be viewed as complementary samples from the latent morphospace of a\nspecies, each capturing certain biological traits. Incorporating captions\nduring training encourages alignment with this shared latent structure,\nemphasizing potentially diagnostic characters while suppressing spurious\ncorrelations. The main challenge, however, lies in obtaining faithful,\ninstance-specific captions at scale. This requirement has limited the\nutilization of natural language supervision in organismal biology compared with\nmany other scientific domains. We complement this gap by generating synthetic\ncaptions with multimodal large language models (MLLMs), guided by\nWikipedia-derived visual information and taxon-tailored format examples. These\ndomain-specific contexts help reduce hallucination and yield accurate,\ninstance-based descriptive captions. Using these captions, we train BIOCAP\n(i.e., BIOCLIP with Captions), a biological foundation model that captures rich\nsemantics and achieves strong performance in species classification and\ntext-image retrieval. These results demonstrate the value of descriptive\ncaptions beyond labels in bridging biological images with multimodal foundation\nmodels."}
{"id": "2510.20291", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20291", "abs": "https://arxiv.org/abs/2510.20291", "authors": ["LinFeng Li", "Jian Zhao", "Zepeng Yang", "Yuhang Song", "Bojun Lin", "Tianle Zhang", "Yuchen Yuan", "Chi Zhang", "Xuelong Li"], "title": "A Parameter-Efficient Mixture-of-Experts Framework for Cross-Modal Geo-Localization", "comment": null, "summary": "We present a winning solution to RoboSense 2025 Track 4: Cross-Modal Drone\nNavigation. The task retrieves the most relevant geo-referenced image from a\nlarge multi-platform corpus (satellite/drone/ground) given a natural-language\nquery. Two obstacles are severe inter-platform heterogeneity and a domain gap\nbetween generic training descriptions and platform-specific test queries. We\nmitigate these with a domain-aligned preprocessing pipeline and a\nMixture-of-Experts (MoE) framework: (i) platform-wise partitioning, satellite\naugmentation, and removal of orientation words; (ii) an LLM-based caption\nrefinement pipeline to align textual semantics with the distinct visual\ncharacteristics of each platform. Using BGE-M3 (text) and EVA-CLIP (image), we\ntrain three platform experts using a progressive two-stage, hard-negative\nmining strategy to enhance discriminative power, and fuse their scores at\ninference. The system tops the official leaderboard, demonstrating robust\ncross-modal geo-localization under heterogeneous viewpoints."}
{"id": "2510.20162", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20162", "abs": "https://arxiv.org/abs/2510.20162", "authors": ["Xudong Yan", "Songhe Feng"], "title": "TOMCAT: Test-time Comprehensive Knowledge Accumulation for Compositional Zero-Shot Learning", "comment": "Accepted to NeurIPS 2025", "summary": "Compositional Zero-Shot Learning (CZSL) aims to recognize novel\nattribute-object compositions based on the knowledge learned from seen ones.\nExisting methods suffer from performance degradation caused by the distribution\nshift of label space at test time, which stems from the inclusion of unseen\ncompositions recombined from attributes and objects. To overcome the challenge,\nwe propose a novel approach that accumulates comprehensive knowledge in both\ntextual and visual modalities from unsupervised data to update multimodal\nprototypes at test time. Building on this, we further design an adaptive update\nweight to control the degree of prototype adjustment, enabling the model to\nflexibly adapt to distribution shift during testing. Moreover, a dynamic\npriority queue is introduced that stores high-confidence images to acquire\nvisual knowledge from historical images for inference. Considering the semantic\nconsistency of multimodal knowledge, we align textual and visual prototypes by\nmultimodal collaborative representation learning. Extensive experiments\nindicate that our approach achieves state-of-the-art performance on four\nbenchmark datasets under both closed-world and open-world settings. Code will\nbe available at https://github.com/xud-yan/TOMCAT ."}
{"id": "2510.20229", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.20229", "abs": "https://arxiv.org/abs/2510.20229", "authors": ["Ge Zheng", "Jiaye Qian", "Jiajin Tang", "Sibei Yang"], "title": "Why LVLMs Are More Prone to Hallucinations in Longer Responses: The Role of Context", "comment": null, "summary": "Large Vision-Language Models (LVLMs) have made significant progress in recent\nyears but are also prone to hallucination issues. They exhibit more\nhallucinations in longer, free-form responses, often attributed to accumulated\nuncertainties. In this paper, we ask: Does increased hallucination result\nsolely from length-induced errors, or is there a deeper underlying mechanism?\nAfter a series of preliminary experiments and findings, we suggest that the\nrisk of hallucinations is not caused by length itself but by the increased\nreliance on context for coherence and completeness in longer responses.\nBuilding on these insights, we propose a novel \"induce-detect-suppress\"\nframework that actively induces hallucinations through deliberately designed\ncontexts, leverages induced instances for early detection of high-risk cases,\nand ultimately suppresses potential object-level hallucinations during actual\ndecoding. Our approach achieves consistent, significant improvements across all\nbenchmarks, demonstrating its efficacy. The strong detection and improved\nhallucination mitigation not only validate our framework but, more importantly,\nre-validate our hypothesis on context. Rather than solely pursuing performance\ngains, this study aims to provide new insights and serves as a first step\ntoward a deeper exploration of hallucinations in LVLMs' longer responses."}
{"id": "2510.20381", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20381", "abs": "https://arxiv.org/abs/2510.20381", "authors": ["Son T. Luu", "Trung Vo", "Hiep Nguyen", "Khanh Quoc Tran", "Kiet Van Nguyen", "Vu Tran", "Ngan Luu-Thuy Nguyen", "Le-Minh Nguyen"], "title": "VLSP 2025 MLQA-TSR Challenge: Vietnamese Multimodal Legal Question Answering on Traffic Sign Regulation", "comment": "VLSP 2025 MLQA-TSR Share Task", "summary": "This paper presents the VLSP 2025 MLQA-TSR - the multimodal legal question\nanswering on traffic sign regulation shared task at VLSP 2025. VLSP 2025\nMLQA-TSR comprises two subtasks: multimodal legal retrieval and multimodal\nquestion answering. The goal is to advance research on Vietnamese multimodal\nlegal text processing and to provide a benchmark dataset for building and\nevaluating intelligent systems in multimodal legal domains, with a focus on\ntraffic sign regulation in Vietnam. The best-reported results on VLSP 2025\nMLQA-TSR are an F2 score of 64.55% for multimodal legal retrieval and an\naccuracy of 86.30% for multimodal question answering."}
{"id": "2510.20189", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20189", "abs": "https://arxiv.org/abs/2510.20189", "authors": ["Xinyi Hu", "Yuran Wang", "Yue Li", "Wenxuan Liu", "Zheng Wang"], "title": "SPAN: Continuous Modeling of Suspicion Progression for Temporal Intention Localization", "comment": null, "summary": "Temporal Intention Localization (TIL) is crucial for video surveillance,\nfocusing on identifying varying levels of suspicious intentions to improve\nsecurity monitoring. However, existing discrete classification methods fail to\ncapture the continuous nature of suspicious intentions, limiting early\nintervention and explainability. In this paper, we propose the Suspicion\nProgression Analysis Network (SPAN), which shifts from discrete classification\nto continuous regression, enabling the capture of fluctuating and evolving\nsuspicious intentions. We reveal that suspicion exhibits long-term dependencies\nand cumulative effects, similar to Temporal Point Process (TPP) theory. Based\non these insights, we define a suspicion score formula that models continuous\nchanges while accounting for temporal characteristics. We also introduce\nSuspicion Coefficient Modulation, which adjusts suspicion coefficients using\nmultimodal information to reflect the varying impacts of suspicious actions.\nAdditionally, the Concept-Anchored Mapping method is proposed to link\nsuspicious actions to predefined intention concepts, offering insights into\nboth the actions and their potential underlying intentions. Extensive\nexperiments on the HAI dataset show that SPAN significantly outperforms\nexisting methods, reducing MSE by 19.8% and improving average mAP by 1.78%.\nNotably, SPAN achieves a 2.74% mAP gain in low-frequency cases, demonstrating\nits superior ability to capture subtle behavioral changes. Compared to discrete\nclassification systems, our continuous suspicion modeling approach enables\nearlier detection and proactive intervention, greatly enhancing system\nexplainability and practical utility in security applications."}
{"id": "2510.20256", "categories": ["cs.CV", "cs.CL", "cs.LG", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.20256", "abs": "https://arxiv.org/abs/2510.20256", "authors": ["Guowei Zhong", "Junjie Li", "Huaiyu Zhu", "Ruohong Huan", "Yun Pan"], "title": "Calibrating Multimodal Consensus for Emotion Recognition", "comment": null, "summary": "In recent years, Multimodal Emotion Recognition (MER) has made substantial\nprogress. Nevertheless, most existing approaches neglect the semantic\ninconsistencies that may arise across modalities, such as conflicting emotional\ncues between text and visual inputs. Besides, current methods are often\ndominated by the text modality due to its strong representational capacity,\nwhich can compromise recognition accuracy. To address these challenges, we\npropose a model termed Calibrated Multimodal Consensus (CMC). CMC introduces a\nPseudo Label Generation Module (PLGM) to produce pseudo unimodal labels,\nenabling unimodal pretraining in a self-supervised fashion. It then employs a\nParameter-free Fusion Module (PFM) and a Multimodal Consensus Router (MCR) for\nmultimodal finetuning, thereby mitigating text dominance and guiding the fusion\nprocess toward a more reliable consensus. Experimental results demonstrate that\nCMC achieves performance on par with or superior to state-of-the-art methods\nacross four datasets, CH-SIMS, CH-SIMS v2, CMU-MOSI, and CMU-MOSEI, and\nexhibits notable advantages in scenarios with semantic inconsistencies on\nCH-SIMS and CH-SIMS v2. The implementation of this work is publicly accessible\nat https://github.com/gw-zhong/CMC."}
{"id": "2510.20519", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20519", "abs": "https://arxiv.org/abs/2510.20519", "authors": ["Xiaohan Lan", "Fanfan Liu", "Haibo Qiu", "Siqi Yang", "Delian Ruan", "Peng Shi", "Lin Ma"], "title": "Metis-HOME: Hybrid Optimized Mixture-of-Experts for Multimodal Reasoning", "comment": null, "summary": "Inspired by recent advancements in LLM reasoning, the field of multimodal\nreasoning has seen remarkable progress, achieving significant performance gains\non intricate tasks such as mathematical problem-solving. Despite this progress,\ncurrent multimodal large reasoning models exhibit two key limitations. They\ntend to employ computationally expensive reasoning even for simple queries,\nleading to inefficiency. Furthermore, this focus on specialized reasoning often\nimpairs their broader, more general understanding capabilities. In this paper,\nwe propose Metis-HOME: a Hybrid Optimized Mixture-of-Experts framework designed\nto address this trade-off. Metis-HOME enables a ''Hybrid Thinking'' paradigm by\nstructuring the original dense model into two distinct expert branches: a\nthinking branch tailored for complex, multi-step reasoning, and a non-thinking\nbranch optimized for rapid, direct inference on tasks like general VQA and OCR.\nA lightweight, trainable router dynamically allocates queries to the most\nsuitable expert. We instantiate Metis-HOME by adapting the Qwen2.5-VL-7B into\nan MoE architecture. Comprehensive evaluations reveal that our approach not\nonly substantially enhances complex reasoning abilities but also improves the\nmodel's general capabilities, reversing the degradation trend observed in other\nreasoning-specialized models. Our work establishes a new paradigm for building\npowerful and versatile MLLMs, effectively resolving the prevalent\nreasoning-vs-generalization dilemma."}
{"id": "2510.20212", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20212", "abs": "https://arxiv.org/abs/2510.20212", "authors": ["Yanghao Wang", "Zhen Wang", "Long Chen"], "title": "FlowCycle: Pursuing Cycle-Consistent Flows for Text-based Editing", "comment": null, "summary": "Recent advances in pre-trained text-to-image flow models have enabled\nremarkable progress in text-based image editing. Mainstream approaches always\nadopt a corruption-then-restoration paradigm, where the source image is first\ncorrupted into an ``intermediate state'' and then restored to the target image\nunder the prompt guidance. However, current methods construct this intermediate\nstate in a target-agnostic manner, i.e., they primarily focus on realizing\nsource image reconstruction while neglecting the semantic gaps towards the\nspecific editing target. This design inherently results in limited editability\nor inconsistency when the desired modifications substantially deviate from the\nsource. In this paper, we argue that the intermediate state should be\ntarget-aware, i.e., selectively corrupting editing-relevant contents while\npreserving editing-irrelevant ones. To this end, we propose FlowCycle, a novel\ninversion-free and flow-based editing framework that parameterizes corruption\nwith learnable noises and optimizes them through a cycle-consistent process. By\niteratively editing the source to the target and recovering back to the source\nwith dual consistency constraints, FlowCycle learns to produce a target-aware\nintermediate state, enabling faithful modifications while preserving source\nconsistency. Extensive ablations have demonstrated that FlowCycle achieves\nsuperior editing quality and consistency over state-of-the-art methods."}
{"id": "2510.20812", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.20812", "abs": "https://arxiv.org/abs/2510.20812", "authors": ["Yuhan Liu", "Lianhui Qin", "Shengjie Wang"], "title": "Small Drafts, Big Verdict: Information-Intensive Visual Reasoning via Speculation", "comment": null, "summary": "Large Vision-Language Models (VLMs) have achieved remarkable progress in\nmultimodal understanding, yet they struggle when reasoning over\ninformation-intensive images that densely interleave textual annotations with\nfine-grained graphical elements. The main challenges lie in precisely\nlocalizing critical cues in dense layouts and multi-hop reasoning to integrate\ndispersed evidence. We propose Speculative Verdict (SV), a training-free\nframework inspired by speculative decoding that combines multiple lightweight\ndraft experts with a large verdict model. In the draft stage, small VLMs act as\ndraft experts to generate reasoning paths that provide diverse localization\ncandidates; in the verdict stage, a strong VLM synthesizes these paths to\nproduce the final answer, minimizing computational cost while recovering\ncorrect answers. To further improve efficiency and accuracy, SV introduces a\nconsensus expert selection mechanism that forwards only high-agreement\nreasoning paths to the verdict. Empirically, SV achieves consistent gains on\nchallenging information-intensive and high-resolution visual question answering\nbenchmarks, including InfographicVQA, ChartMuseum, ChartQAPro, and HR-Bench 4K.\nBy synthesizing correct insights from multiple partially accurate reasoning\npaths, SV achieves both error correction and cost-efficiency compared to large\nproprietary models or training pipelines. Code is available at\nhttps://github.com/Tinaliu0123/speculative-verdict"}
{"id": "2510.20531", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20531", "abs": "https://arxiv.org/abs/2510.20531", "authors": ["Lixiong Qin", "Yang Zhang", "Mei Wang", "Jiani Hu", "Weihong Deng", "Weiran Xu"], "title": "Fake-in-Facext: Towards Fine-Grained Explainable DeepFake Analysis", "comment": "25 pages, 9 figures, 17 tables", "summary": "The advancement of Multimodal Large Language Models (MLLMs) has bridged the\ngap between vision and language tasks, enabling the implementation of\nExplainable DeepFake Analysis (XDFA). However, current methods suffer from a\nlack of fine-grained awareness: the description of artifacts in data annotation\nis unreliable and coarse-grained, and the models fail to support the output of\nconnections between textual forgery explanations and the visual evidence of\nartifacts, as well as the input of queries for arbitrary facial regions. As a\nresult, their responses are not sufficiently grounded in Face Visual Context\n(Facext). To address this limitation, we propose the Fake-in-Facext (FiFa)\nframework, with contributions focusing on data annotation and model\nconstruction. We first define a Facial Image Concept Tree (FICT) to divide\nfacial images into fine-grained regional concepts, thereby obtaining a more\nreliable data annotation pipeline, FiFa-Annotator, for forgery explanation.\nBased on this dedicated data annotation, we introduce a novel\nArtifact-Grounding Explanation (AGE) task, which generates textual forgery\nexplanations interleaved with segmentation masks of manipulated artifacts. We\npropose a unified multi-task learning architecture, FiFa-MLLM, to\nsimultaneously support abundant multimodal inputs and outputs for fine-grained\nExplainable DeepFake Analysis. With multiple auxiliary supervision tasks,\nFiFa-MLLM can outperform strong baselines on the AGE task and achieve SOTA\nperformance on existing XDFA datasets. The code and data will be made\nopen-source at https://github.com/lxq1000/Fake-in-Facext."}
{"id": "2510.20214", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20214", "abs": "https://arxiv.org/abs/2510.20214", "authors": ["Talha Ilyas", "Duong Nhu", "Allison Thomas", "Arie Levin", "Lim Wei Yap", "Shu Gong", "David Vera Anaya", "Yiwen Jiang", "Deval Mehta", "Ritesh Warty", "Vinayak Smith", "Maya Reddy", "Euan Wallace", "Wenlong Cheng", "Zongyuan Ge", "Faezeh Marzbanrad"], "title": "Towards Objective Obstetric Ultrasound Assessment: Contrastive Representation Learning for Fetal Movement Detection", "comment": "This is the preprint version of the manuscript submitted to IEEE\n  Journal of Biomedical and Health Informatics (JBHI) for review", "summary": "Accurate fetal movement (FM) detection is essential for assessing prenatal\nhealth, as abnormal movement patterns can indicate underlying complications\nsuch as placental dysfunction or fetal distress. Traditional methods, including\nmaternal perception and cardiotocography (CTG), suffer from subjectivity and\nlimited accuracy. To address these challenges, we propose Contrastive\nUltrasound Video Representation Learning (CURL), a novel self-supervised\nlearning framework for FM detection from extended fetal ultrasound video\nrecordings. Our approach leverages a dual-contrastive loss, incorporating both\nspatial and temporal contrastive learning, to learn robust motion\nrepresentations. Additionally, we introduce a task-specific sampling strategy,\nensuring the effective separation of movement and non-movement segments during\nself-supervised training, while enabling flexible inference on arbitrarily long\nultrasound recordings through a probabilistic fine-tuning approach. Evaluated\non an in-house dataset of 92 subjects, each with 30-minute ultrasound sessions,\nCURL achieves a sensitivity of 78.01% and an AUROC of 81.60%, demonstrating its\npotential for reliable and objective FM analysis. These results highlight the\npotential of self-supervised contrastive learning for fetal movement analysis,\npaving the way for improved prenatal monitoring and clinical decision-making."}
{"id": "2510.20579", "categories": ["cs.CV", "cs.AI", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.20579", "abs": "https://arxiv.org/abs/2510.20579", "authors": ["Jiahao Meng", "Xiangtai Li", "Haochen Wang", "Yue Tan", "Tao Zhang", "Lingdong Kong", "Yunhai Tong", "Anran Wang", "Zhiyang Teng", "Yujing Wang", "Zhuochen Wang"], "title": "Open-o3 Video: Grounded Video Reasoning with Explicit Spatio-Temporal Evidence", "comment": null, "summary": "Most video reasoning models only generate textual reasoning traces without\nindicating when and where key evidence appears. Recent models such as OpenAI-o3\nhave sparked wide interest in evidence-centered reasoning for images, yet\nextending this ability to videos is more challenging, as it requires joint\ntemporal tracking and spatial localization across dynamic scenes. We introduce\nOpen-o3 Video, a non-agent framework that integrates explicit spatio-temporal\nevidence into video reasoning, and carefully collect training data and design\ntraining strategies to address the aforementioned challenges. The model\nhighlights key timestamps, objects, and bounding boxes alongside its answers,\nallowing reasoning to be grounded in concrete visual observations. To enable\nthis functionality, we first curate and build two high-quality datasets,\nSTGR-CoT-30k for SFT and STGR-RL-36k for RL, with carefully constructed\ntemporal and spatial annotations, since most existing datasets offer either\ntemporal spans for videos or spatial boxes on images, lacking unified\nspatio-temporal supervision and reasoning traces. Then, we adopt a cold-start\nreinforcement learning strategy with multiple specially designed rewards that\njointly encourage answer accuracy, temporal alignment, and spatial precision.\nOn V-STAR benchmark, Open-o3 Video achieves state-of-the-art performance,\nraising mAM by 14.4% and mLGM by 24.2% on the Qwen2.5-VL baseline. Consistent\nimprovements are also observed on a broad range of video understanding\nbenchmarks, including VideoMME, WorldSense, VideoMMMU, and TVGBench. Beyond\naccuracy, the reasoning traces produced by Open-o3 Video also provide valuable\nsignals for test-time scaling, enabling confidence-aware verification and\nimproving answer reliability."}
{"id": "2510.20229", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.20229", "abs": "https://arxiv.org/abs/2510.20229", "authors": ["Ge Zheng", "Jiaye Qian", "Jiajin Tang", "Sibei Yang"], "title": "Why LVLMs Are More Prone to Hallucinations in Longer Responses: The Role of Context", "comment": null, "summary": "Large Vision-Language Models (LVLMs) have made significant progress in recent\nyears but are also prone to hallucination issues. They exhibit more\nhallucinations in longer, free-form responses, often attributed to accumulated\nuncertainties. In this paper, we ask: Does increased hallucination result\nsolely from length-induced errors, or is there a deeper underlying mechanism?\nAfter a series of preliminary experiments and findings, we suggest that the\nrisk of hallucinations is not caused by length itself but by the increased\nreliance on context for coherence and completeness in longer responses.\nBuilding on these insights, we propose a novel \"induce-detect-suppress\"\nframework that actively induces hallucinations through deliberately designed\ncontexts, leverages induced instances for early detection of high-risk cases,\nand ultimately suppresses potential object-level hallucinations during actual\ndecoding. Our approach achieves consistent, significant improvements across all\nbenchmarks, demonstrating its efficacy. The strong detection and improved\nhallucination mitigation not only validate our framework but, more importantly,\nre-validate our hypothesis on context. Rather than solely pursuing performance\ngains, this study aims to provide new insights and serves as a first step\ntoward a deeper exploration of hallucinations in LVLMs' longer responses."}
{"id": "2510.20596", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20596", "abs": "https://arxiv.org/abs/2510.20596", "authors": ["Ziyu Ye", "Chen Ju", "Chaofan Ma", "Xiaoyun Zhang"], "title": "Unsupervised Domain Adaptation via Similarity-based Prototypes for Cross-Modality Segmentation", "comment": "MICCAI 2021", "summary": "Deep learning models have achieved great success on various vision\nchallenges, but a well-trained model would face drastic performance degradation\nwhen applied to unseen data. Since the model is sensitive to domain shift,\nunsupervised domain adaptation attempts to reduce the domain gap and avoid\ncostly annotation of unseen domains. This paper proposes a novel framework for\ncross-modality segmentation via similarity-based prototypes. In specific, we\nlearn class-wise prototypes within an embedding space, then introduce a\nsimilarity constraint to make these prototypes representative for each semantic\nclass while separable from different classes. Moreover, we use dictionaries to\nstore prototypes extracted from different images, which prevents the\nclass-missing problem and enables the contrastive learning of prototypes, and\nfurther improves performance. Extensive experiments show that our method\nachieves better results than other state-of-the-art methods."}
{"id": "2510.20244", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.20244", "abs": "https://arxiv.org/abs/2510.20244", "authors": ["Minseok Kang", "Minhyeok Lee", "Minjung Kim", "Donghyeong Kim", "Sangyoun Lee"], "title": "Empower Words: DualGround for Structured Phrase and Sentence-Level Temporal Grounding", "comment": "Comments: 28 pages, including appendix. 5 figures. Full version of\n  the NeurIPS 2025 paper", "summary": "Video Temporal Grounding (VTG) aims to localize temporal segments in long,\nuntrimmed videos that align with a given natural language query. This task\ntypically comprises two subtasks: Moment Retrieval (MR) and Highlight Detection\n(HD). While recent advances have been progressed by powerful pretrained\nvision-language models such as CLIP and InternVideo2, existing approaches\ncommonly treat all text tokens uniformly during crossmodal attention,\ndisregarding their distinct semantic roles. To validate the limitations of this\napproach, we conduct controlled experiments demonstrating that VTG models\noverly rely on [EOS]-driven global semantics while failing to effectively\nutilize word-level signals, which limits their ability to achieve fine-grained\ntemporal alignment. Motivated by this limitation, we propose DualGround, a\ndual-branch architecture that explicitly separates global and local semantics\nby routing the [EOS] token through a sentence-level path and clustering word\ntokens into phrase-level units for localized grounding. Our method introduces\n(1) tokenrole- aware cross modal interaction strategies that align video\nfeatures with sentence-level and phrase-level semantics in a structurally\ndisentangled manner, and (2) a joint modeling framework that not only improves\nglobal sentence-level alignment but also enhances finegrained temporal\ngrounding by leveraging structured phrase-aware context. This design allows the\nmodel to capture both coarse and localized semantics, enabling more expressive\nand context-aware video grounding. DualGround achieves state-of-the-art\nperformance on both Moment Retrieval and Highlight Detection tasks across\nQVHighlights and Charades- STA benchmarks, demonstrating the effectiveness of\ndisentangled semantic modeling in video-language alignment."}
{"id": "2510.20727", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20727", "abs": "https://arxiv.org/abs/2510.20727", "authors": ["Xizhi Wu", "Madeline S. Kreider", "Philip E. Empey", "Chenyu Li", "Yanshan Wang"], "title": "Automated Extraction of Fluoropyrimidine Treatment and Treatment-Related Toxicities from Clinical Notes Using Natural Language Processing", "comment": null, "summary": "Objective: Fluoropyrimidines are widely prescribed for colorectal and breast\ncancers, but are associated with toxicities such as hand-foot syndrome and\ncardiotoxicity. Since toxicity documentation is often embedded in clinical\nnotes, we aimed to develop and evaluate natural language processing (NLP)\nmethods to extract treatment and toxicity information.\n  Materials and Methods: We constructed a gold-standard dataset of 236 clinical\nnotes from 204,165 adult oncology patients. Domain experts annotated categories\nrelated to treatment regimens and toxicities. We developed rule-based, machine\nlearning-based (Random Forest, Support Vector Machine [SVM], Logistic\nRegression [LR]), deep learning-based (BERT, ClinicalBERT), and large language\nmodels (LLM)-based NLP approaches (zero-shot and error-analysis prompting).\nModels used an 80:20 train-test split.\n  Results: Sufficient data existed to train and evaluate 5 annotated\ncategories. Error-analysis prompting achieved optimal precision, recall, and F1\nscores (F1=1.000) for treatment and toxicities extraction, whereas zero-shot\nprompting reached F1=1.000 for treatment and F1=0.876 for toxicities\nextraction.LR and SVM ranked second for toxicities (F1=0.937). Deep learning\nunderperformed, with BERT (F1=0.873 treatment; F1= 0.839 toxicities) and\nClinicalBERT (F1=0.873 treatment; F1 = 0.886 toxicities). Rule-based methods\nserved as our baseline with F1 scores of 0.857 in treatment and 0.858 in\ntoxicities.\n  Discussion: LMM-based approaches outperformed all others, followed by machine\nlearning methods. Machine and deep learning approaches were limited by small\ntraining data and showed limited generalizability, particularly for rare\ncategories.\n  Conclusion: LLM-based NLP most effectively extracted fluoropyrimidine\ntreatment and toxicity information from clinical notes, and has strong\npotential to support oncology research and pharmacovigilance."}
{"id": "2510.20256", "categories": ["cs.CV", "cs.CL", "cs.LG", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.20256", "abs": "https://arxiv.org/abs/2510.20256", "authors": ["Guowei Zhong", "Junjie Li", "Huaiyu Zhu", "Ruohong Huan", "Yun Pan"], "title": "Calibrating Multimodal Consensus for Emotion Recognition", "comment": null, "summary": "In recent years, Multimodal Emotion Recognition (MER) has made substantial\nprogress. Nevertheless, most existing approaches neglect the semantic\ninconsistencies that may arise across modalities, such as conflicting emotional\ncues between text and visual inputs. Besides, current methods are often\ndominated by the text modality due to its strong representational capacity,\nwhich can compromise recognition accuracy. To address these challenges, we\npropose a model termed Calibrated Multimodal Consensus (CMC). CMC introduces a\nPseudo Label Generation Module (PLGM) to produce pseudo unimodal labels,\nenabling unimodal pretraining in a self-supervised fashion. It then employs a\nParameter-free Fusion Module (PFM) and a Multimodal Consensus Router (MCR) for\nmultimodal finetuning, thereby mitigating text dominance and guiding the fusion\nprocess toward a more reliable consensus. Experimental results demonstrate that\nCMC achieves performance on par with or superior to state-of-the-art methods\nacross four datasets, CH-SIMS, CH-SIMS v2, CMU-MOSI, and CMU-MOSEI, and\nexhibits notable advantages in scenarios with semantic inconsistencies on\nCH-SIMS and CH-SIMS v2. The implementation of this work is publicly accessible\nat https://github.com/gw-zhong/CMC."}
{"id": "2510.20812", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.20812", "abs": "https://arxiv.org/abs/2510.20812", "authors": ["Yuhan Liu", "Lianhui Qin", "Shengjie Wang"], "title": "Small Drafts, Big Verdict: Information-Intensive Visual Reasoning via Speculation", "comment": null, "summary": "Large Vision-Language Models (VLMs) have achieved remarkable progress in\nmultimodal understanding, yet they struggle when reasoning over\ninformation-intensive images that densely interleave textual annotations with\nfine-grained graphical elements. The main challenges lie in precisely\nlocalizing critical cues in dense layouts and multi-hop reasoning to integrate\ndispersed evidence. We propose Speculative Verdict (SV), a training-free\nframework inspired by speculative decoding that combines multiple lightweight\ndraft experts with a large verdict model. In the draft stage, small VLMs act as\ndraft experts to generate reasoning paths that provide diverse localization\ncandidates; in the verdict stage, a strong VLM synthesizes these paths to\nproduce the final answer, minimizing computational cost while recovering\ncorrect answers. To further improve efficiency and accuracy, SV introduces a\nconsensus expert selection mechanism that forwards only high-agreement\nreasoning paths to the verdict. Empirically, SV achieves consistent gains on\nchallenging information-intensive and high-resolution visual question answering\nbenchmarks, including InfographicVQA, ChartMuseum, ChartQAPro, and HR-Bench 4K.\nBy synthesizing correct insights from multiple partially accurate reasoning\npaths, SV achieves both error correction and cost-efficiency compared to large\nproprietary models or training pipelines. Code is available at\nhttps://github.com/Tinaliu0123/speculative-verdict"}
{"id": "2510.20268", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.20268", "abs": "https://arxiv.org/abs/2510.20268", "authors": ["Guangyu Dai", "Dong Chen", "Siliang Tang", "Yueting Zhuang"], "title": "GMFVAD: Using Grained Multi-modal Feature to Improve Video Anomaly Detection", "comment": null, "summary": "Video anomaly detection (VAD) is a challenging task that detects anomalous\nframes in continuous surveillance videos. Most previous work utilizes the\nspatio-temporal correlation of visual features to distinguish whether there are\nabnormalities in video snippets. Recently, some works attempt to introduce\nmulti-modal information, like text feature, to enhance the results of video\nanomaly detection. However, these works merely incorporate text features into\nvideo snippets in a coarse manner, overlooking the significant amount of\nredundant information that may exist within the video snippets. Therefore, we\npropose to leverage the diversity among multi-modal information to further\nrefine the extracted features, reducing the redundancy in visual features, and\nwe propose Grained Multi-modal Feature for Video Anomaly Detection (GMFVAD).\nSpecifically, we generate more grained multi-modal feature based on the video\nsnippet, which summarizes the main content, and text features based on the\ncaptions of original video will be introduced to further enhance the visual\nfeatures of highlighted portions. Experiments show that the proposed GMFVAD\nachieves state-of-the-art performance on four mainly datasets. Ablation\nexperiments also validate that the improvement of GMFVAD is due to the\nreduction of redundant information."}
{"id": "2510.20285", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.20285", "abs": "https://arxiv.org/abs/2510.20285", "authors": ["Jiayi Zou", "Chaofan Chen", "Bing-Kun Bao", "Changsheng Xu"], "title": "DMC$^3$: Dual-Modal Counterfactual Contrastive Construction for Egocentric Video Question Answering", "comment": null, "summary": "Egocentric Video Question Answering (Egocentric VideoQA) plays an important\nrole in egocentric video understanding, which refers to answering questions\nbased on first-person videos. Although existing methods have made progress\nthrough the paradigm of pre-training and fine-tuning, they ignore the unique\nchallenges posed by the first-person perspective, such as understanding\nmultiple events and recognizing hand-object interactions. To deal with these\nchallenges, we propose a Dual-Modal Counterfactual Contrastive Construction\n(DMC$^3$) framework, which contains an egocentric videoqa baseline, a\ncounterfactual sample construction module and a counterfactual sample-involved\ncontrastive optimization. Specifically, We first develop a counterfactual\nsample construction module to generate positive and negative samples for\ntextual and visual modalities through event description paraphrasing and core\ninteraction mining, respectively. Then, We feed these samples together with the\noriginal samples into the baseline. Finally, in the counterfactual\nsample-involved contrastive optimization module, we apply contrastive loss to\nminimize the distance between the original sample features and the positive\nsample features, while maximizing the distance from the negative samples.\nExperiments show that our method achieve 52.51\\% and 46.04\\% on the\n\\textit{normal} and \\textit{indirect} splits of EgoTaskQA, and 13.2\\% on\nQAEGO4D, both reaching the state-of-the-art performance."}
{"id": "2510.20287", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.20287", "abs": "https://arxiv.org/abs/2510.20287", "authors": ["Sauptik Dhar", "Naveen Ramakrishnan", "Michelle Munson"], "title": "Breakdance Video classification in the age of Generative AI", "comment": "11 pages", "summary": "Large Vision Language models have seen huge application in several sports\nuse-cases recently. Most of these works have been targeted towards a limited\nsubset of popular sports like soccer, cricket, basketball etc; focusing on\ngenerative tasks like visual question answering, highlight generation. This\nwork analyzes the applicability of the modern video foundation models (both\nencoder and decoder) for a very niche but hugely popular dance sports -\nbreakdance. Our results show that Video Encoder models continue to outperform\nstate-of-the-art Video Language Models for prediction tasks. We provide\ninsights on how to choose the encoder model and provide a thorough analysis\ninto the workings of a finetuned decoder model for breakdance video\nclassification."}
{"id": "2510.20291", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20291", "abs": "https://arxiv.org/abs/2510.20291", "authors": ["LinFeng Li", "Jian Zhao", "Zepeng Yang", "Yuhang Song", "Bojun Lin", "Tianle Zhang", "Yuchen Yuan", "Chi Zhang", "Xuelong Li"], "title": "A Parameter-Efficient Mixture-of-Experts Framework for Cross-Modal Geo-Localization", "comment": null, "summary": "We present a winning solution to RoboSense 2025 Track 4: Cross-Modal Drone\nNavigation. The task retrieves the most relevant geo-referenced image from a\nlarge multi-platform corpus (satellite/drone/ground) given a natural-language\nquery. Two obstacles are severe inter-platform heterogeneity and a domain gap\nbetween generic training descriptions and platform-specific test queries. We\nmitigate these with a domain-aligned preprocessing pipeline and a\nMixture-of-Experts (MoE) framework: (i) platform-wise partitioning, satellite\naugmentation, and removal of orientation words; (ii) an LLM-based caption\nrefinement pipeline to align textual semantics with the distinct visual\ncharacteristics of each platform. Using BGE-M3 (text) and EVA-CLIP (image), we\ntrain three platform experts using a progressive two-stage, hard-negative\nmining strategy to enhance discriminative power, and fuse their scores at\ninference. The system tops the official leaderboard, demonstrating robust\ncross-modal geo-localization under heterogeneous viewpoints."}
{"id": "2510.20322", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20322", "abs": "https://arxiv.org/abs/2510.20322", "authors": ["Zelin Peng", "Zhengqin Xu", "Qingyang Liu", "Xiaokang Yang", "Wei Shen"], "title": "HyperET: Efficient Training in Hyperbolic Space for Multi-modal Large Language Models", "comment": "Accepted by NeurIPS2025", "summary": "Multi-modal large language models (MLLMs) have emerged as a transformative\napproach for aligning visual and textual understanding. They typically require\nextremely high computational resources (e.g., thousands of GPUs) for training\nto achieve cross-modal alignment at multi-granularity levels. We argue that a\nkey source of this inefficiency lies in the vision encoders they widely equip\nwith, e.g., CLIP and SAM, which lack the alignment with language at\nmulti-granularity levels. To address this issue, in this paper, we leverage\nhyperbolic space, which inherently models hierarchical levels and thus provides\na principled framework for bridging the granularity gap between visual and\ntextual modalities at an arbitrary granularity level. Concretely, we propose an\nefficient training paradigm for MLLMs, dubbed as HyperET, which can optimize\nvisual representations to align with their textual counterparts at an arbitrary\ngranularity level through dynamic hyperbolic radius adjustment in hyperbolic\nspace. HyperET employs learnable matrices with M\\\"{o}bius multiplication\noperations, implemented via three effective configurations: diagonal scaling\nmatrices, block-diagonal matrices, and banded matrices, providing a flexible\nyet efficient parametrization strategy. Comprehensive experiments across\nmultiple MLLM benchmarks demonstrate that HyperET consistently improves both\nexisting pre-training and fine-tuning MLLMs clearly with less than 1\\%\nadditional parameters."}
{"id": "2510.20393", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.20393", "abs": "https://arxiv.org/abs/2510.20393", "authors": ["Qing Wang", "Chong-Wah Ngo", "Yu Cao", "Ee-Peng Lim"], "title": "Mitigating Cross-modal Representation Bias for Multicultural Image-to-Recipe Retrieval", "comment": "ACM Multimedia 2025", "summary": "Existing approaches for image-to-recipe retrieval have the implicit\nassumption that a food image can fully capture the details textually documented\nin its recipe. However, a food image only reflects the visual outcome of a\ncooked dish and not the underlying cooking process. Consequently, learning\ncross-modal representations to bridge the modality gap between images and\nrecipes tends to ignore subtle, recipe-specific details that are not visually\napparent but are crucial for recipe retrieval. Specifically, the\nrepresentations are biased to capture the dominant visual elements, resulting\nin difficulty in ranking similar recipes with subtle differences in use of\ningredients and cooking methods. The bias in representation learning is\nexpected to be more severe when the training data is mixed of images and\nrecipes sourced from different cuisines. This paper proposes a novel causal\napproach that predicts the culinary elements potentially overlooked in images,\nwhile explicitly injecting these elements into cross-modal representation\nlearning to mitigate biases. Experiments are conducted on the standard\nmonolingual Recipe1M dataset and a newly curated multilingual multicultural\ncuisine dataset. The results indicate that the proposed causal representation\nlearning is capable of uncovering subtle ingredients and cooking actions and\nachieves impressive retrieval performance on both monolingual and multilingual\nmulticultural datasets."}
{"id": "2510.20470", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20470", "abs": "https://arxiv.org/abs/2510.20470", "authors": ["Kun Ouyang", "Yuanxin Liu", "Linli Yao", "Yishuo Cai", "Hao Zhou", "Jie Zhou", "Fandong Meng", "Xu Sun"], "title": "Conan: Progressive Learning to Reason Like a Detective over Multi-Scale Visual Evidence", "comment": null, "summary": "Video reasoning, which requires multi-step deduction across frames, remains a\nmajor challenge for multimodal large language models (MLLMs). While\nreinforcement learning (RL)-based methods enhance reasoning capabilities, they\noften rely on text-only chains that yield ungrounded or hallucinated\nconclusions. Conversely, frame-retrieval approaches introduce visual grounding\nbut still struggle with inaccurate evidence localization. To address these\nchallenges, we present Conan, a framework for evidence-grounded multi-step\nvideo reasoning. Conan identifies contextual and evidence frames, reasons over\ncross-frame clues, and adaptively decides when to conclude or explore further.\nTo achieve this, we (1) construct Conan-91K, a large-scale dataset of\nautomatically generated reasoning traces that includes frame identification,\nevidence reasoning, and action decision, and (2) design a multi-stage\nprogressive cold-start strategy combined with an\nIdentification-Reasoning-Action (AIR) RLVR training framework to jointly\nenhance multi-step visual reasoning. Extensive experiments on six multi-step\nreasoning benchmarks demonstrate that Conan surpasses the baseline\nQwen2.5-VL-7B-Instruct by an average of over 10% in accuracy, achieving\nstate-of-the-art performance. Furthermore, Conan generalizes effectively to\nlong-video understanding tasks, validating its strong scalability and\nrobustness."}
{"id": "2510.20512", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20512", "abs": "https://arxiv.org/abs/2510.20512", "authors": ["Yixiong Yang", "Tao Wu", "Senmao Li", "Shiqi Yang", "Yaxing Wang", "Joost van de Weijer", "Kai Wang"], "title": "EchoDistill: Bidirectional Concept Distillation for One-Step Diffusion Personalization", "comment": "Project page available at\n  https://liulisixin.github.io/EchoDistill-page/", "summary": "Recent advances in accelerating text-to-image (T2I) diffusion models have\nenabled the synthesis of high-fidelity images even in a single step. However,\npersonalizing these models to incorporate novel concepts remains a challenge\ndue to the limited capacity of one-step models to capture new concept\ndistributions effectively. We propose a bidirectional concept distillation\nframework, EchoDistill, to enable one-step diffusion personalization (1-SDP).\nOur approach involves an end-to-end training process where a multi-step\ndiffusion model (teacher) and a one-step diffusion model (student) are trained\nsimultaneously. The concept is first distilled from the teacher model to the\nstudent, and then echoed back from the student to the teacher. During the\nEchoDistill, we share the text encoder between the two models to ensure\nconsistent semantic understanding. Following this, the student model is\noptimized with adversarial losses to align with the real image distribution and\nwith alignment losses to maintain consistency with the teacher's output.\nFurthermore, we introduce the bidirectional echoing refinement strategy,\nwherein the student model leverages its faster generation capability to\nfeedback to the teacher model. This bidirectional concept distillation\nmechanism not only enhances the student ability to personalize novel concepts\nbut also improves the generative quality of the teacher model. Our experiments\ndemonstrate that this collaborative framework significantly outperforms\nexisting personalization methods over the 1-SDP setup, establishing a novel\nparadigm for rapid and effective personalization in T2I diffusion models."}
{"id": "2510.20519", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20519", "abs": "https://arxiv.org/abs/2510.20519", "authors": ["Xiaohan Lan", "Fanfan Liu", "Haibo Qiu", "Siqi Yang", "Delian Ruan", "Peng Shi", "Lin Ma"], "title": "Metis-HOME: Hybrid Optimized Mixture-of-Experts for Multimodal Reasoning", "comment": null, "summary": "Inspired by recent advancements in LLM reasoning, the field of multimodal\nreasoning has seen remarkable progress, achieving significant performance gains\non intricate tasks such as mathematical problem-solving. Despite this progress,\ncurrent multimodal large reasoning models exhibit two key limitations. They\ntend to employ computationally expensive reasoning even for simple queries,\nleading to inefficiency. Furthermore, this focus on specialized reasoning often\nimpairs their broader, more general understanding capabilities. In this paper,\nwe propose Metis-HOME: a Hybrid Optimized Mixture-of-Experts framework designed\nto address this trade-off. Metis-HOME enables a ''Hybrid Thinking'' paradigm by\nstructuring the original dense model into two distinct expert branches: a\nthinking branch tailored for complex, multi-step reasoning, and a non-thinking\nbranch optimized for rapid, direct inference on tasks like general VQA and OCR.\nA lightweight, trainable router dynamically allocates queries to the most\nsuitable expert. We instantiate Metis-HOME by adapting the Qwen2.5-VL-7B into\nan MoE architecture. Comprehensive evaluations reveal that our approach not\nonly substantially enhances complex reasoning abilities but also improves the\nmodel's general capabilities, reversing the degradation trend observed in other\nreasoning-specialized models. Our work establishes a new paradigm for building\npowerful and versatile MLLMs, effectively resolving the prevalent\nreasoning-vs-generalization dilemma."}
{"id": "2510.20531", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20531", "abs": "https://arxiv.org/abs/2510.20531", "authors": ["Lixiong Qin", "Yang Zhang", "Mei Wang", "Jiani Hu", "Weihong Deng", "Weiran Xu"], "title": "Fake-in-Facext: Towards Fine-Grained Explainable DeepFake Analysis", "comment": "25 pages, 9 figures, 17 tables", "summary": "The advancement of Multimodal Large Language Models (MLLMs) has bridged the\ngap between vision and language tasks, enabling the implementation of\nExplainable DeepFake Analysis (XDFA). However, current methods suffer from a\nlack of fine-grained awareness: the description of artifacts in data annotation\nis unreliable and coarse-grained, and the models fail to support the output of\nconnections between textual forgery explanations and the visual evidence of\nartifacts, as well as the input of queries for arbitrary facial regions. As a\nresult, their responses are not sufficiently grounded in Face Visual Context\n(Facext). To address this limitation, we propose the Fake-in-Facext (FiFa)\nframework, with contributions focusing on data annotation and model\nconstruction. We first define a Facial Image Concept Tree (FICT) to divide\nfacial images into fine-grained regional concepts, thereby obtaining a more\nreliable data annotation pipeline, FiFa-Annotator, for forgery explanation.\nBased on this dedicated data annotation, we introduce a novel\nArtifact-Grounding Explanation (AGE) task, which generates textual forgery\nexplanations interleaved with segmentation masks of manipulated artifacts. We\npropose a unified multi-task learning architecture, FiFa-MLLM, to\nsimultaneously support abundant multimodal inputs and outputs for fine-grained\nExplainable DeepFake Analysis. With multiple auxiliary supervision tasks,\nFiFa-MLLM can outperform strong baselines on the AGE task and achieve SOTA\nperformance on existing XDFA datasets. The code and data will be made\nopen-source at https://github.com/lxq1000/Fake-in-Facext."}
{"id": "2510.20578", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.20578", "abs": "https://arxiv.org/abs/2510.20578", "authors": ["Ding Zou", "Feifan Wang", "Mengyu Ge", "Siyuan Fan", "Zongbing Zhang", "Wei Chen", "Lingfeng Wang", "Zhongyou Hu", "Wenrui Yan", "Zhengwei Gao", "Hao Wang", "Weizhao Jin", "Yu Zhang", "Hainan Zhao", "Mingliang Zhang", "Xianxian Xi", "Yaru Zhang", "Wenyuan Li", "Zhengguang Gao", "Yurui Zhu"], "title": "EmbodiedBrain: Expanding Performance Boundaries of Task Planning for Embodied Intelligence", "comment": null, "summary": "The realization of Artificial General Intelligence (AGI) necessitates\nEmbodied AI agents capable of robust spatial perception, effective task\nplanning, and adaptive execution in physical environments. However, current\nlarge language models (LLMs) and multimodal LLMs (MLLMs) for embodied tasks\nsuffer from key limitations, including a significant gap between model design\nand agent requirements, an unavoidable trade-off between real-time latency and\nperformance, and the use of unauthentic, offline evaluation metrics. To address\nthese challenges, we propose EmbodiedBrain, a novel vision-language foundation\nmodel available in both 7B and 32B parameter sizes. Our framework features an\nagent-aligned data structure and employs a powerful training methodology that\nintegrates large-scale Supervised Fine-Tuning (SFT) with Step-Augumented Group\nRelative Policy Optimization (Step-GRPO), which boosts long-horizon task\nsuccess by integrating preceding steps as Guided Precursors. Furthermore, we\nincorporate a comprehensive reward system, including a Generative Reward Model\n(GRM) accelerated at the infrastructure level, to improve training efficiency.\nFor enable thorough validation, we establish a three-part evaluation system\nencompassing General, Planning, and End-to-End Simulation Benchmarks,\nhighlighted by the proposal and open-sourcing of a novel, challenging\nsimulation environment. Experimental results demonstrate that EmbodiedBrain\nachieves superior performance across all metrics, establishing a new\nstate-of-the-art for embodied foundation models. Towards paving the way for the\nnext generation of generalist embodied agents, we open-source all of our data,\nmodel weight, and evaluating methods, which are available at\nhttps://zterobot.github.io/EmbodiedBrain.github.io."}
{"id": "2510.20579", "categories": ["cs.CV", "cs.AI", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.20579", "abs": "https://arxiv.org/abs/2510.20579", "authors": ["Jiahao Meng", "Xiangtai Li", "Haochen Wang", "Yue Tan", "Tao Zhang", "Lingdong Kong", "Yunhai Tong", "Anran Wang", "Zhiyang Teng", "Yujing Wang", "Zhuochen Wang"], "title": "Open-o3 Video: Grounded Video Reasoning with Explicit Spatio-Temporal Evidence", "comment": null, "summary": "Most video reasoning models only generate textual reasoning traces without\nindicating when and where key evidence appears. Recent models such as OpenAI-o3\nhave sparked wide interest in evidence-centered reasoning for images, yet\nextending this ability to videos is more challenging, as it requires joint\ntemporal tracking and spatial localization across dynamic scenes. We introduce\nOpen-o3 Video, a non-agent framework that integrates explicit spatio-temporal\nevidence into video reasoning, and carefully collect training data and design\ntraining strategies to address the aforementioned challenges. The model\nhighlights key timestamps, objects, and bounding boxes alongside its answers,\nallowing reasoning to be grounded in concrete visual observations. To enable\nthis functionality, we first curate and build two high-quality datasets,\nSTGR-CoT-30k for SFT and STGR-RL-36k for RL, with carefully constructed\ntemporal and spatial annotations, since most existing datasets offer either\ntemporal spans for videos or spatial boxes on images, lacking unified\nspatio-temporal supervision and reasoning traces. Then, we adopt a cold-start\nreinforcement learning strategy with multiple specially designed rewards that\njointly encourage answer accuracy, temporal alignment, and spatial precision.\nOn V-STAR benchmark, Open-o3 Video achieves state-of-the-art performance,\nraising mAM by 14.4% and mLGM by 24.2% on the Qwen2.5-VL baseline. Consistent\nimprovements are also observed on a broad range of video understanding\nbenchmarks, including VideoMME, WorldSense, VideoMMMU, and TVGBench. Beyond\naccuracy, the reasoning traces produced by Open-o3 Video also provide valuable\nsignals for test-time scaling, enabling confidence-aware verification and\nimproving answer reliability."}
{"id": "2510.20586", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20586", "abs": "https://arxiv.org/abs/2510.20586", "authors": ["Muhammad Atif Butt", "Alexandra Gomez-Villa", "Tao Wu", "Javier Vazquez-Corral", "Joost Van De Weijer", "Kai Wang"], "title": "GenColorBench: A Color Evaluation Benchmark for Text-to-Image Generation Models", "comment": null, "summary": "Recent years have seen impressive advances in text-to-image generation, with\nimage generative or unified models producing high-quality images from text. Yet\nthese models still struggle with fine-grained color controllability, often\nfailing to accurately match colors specified in text prompts. While existing\nbenchmarks evaluate compositional reasoning and prompt adherence, none\nsystematically assess color precision. Color is fundamental to human visual\nperception and communication, critical for applications from art to design\nworkflows requiring brand consistency. However, current benchmarks either\nneglect color or rely on coarse assessments, missing key capabilities such as\ninterpreting RGB values or aligning with human expectations. To this end, we\npropose GenColorBench, the first comprehensive benchmark for text-to-image\ncolor generation, grounded in color systems like ISCC-NBS and CSS3/X11,\nincluding numerical colors which are absent elsewhere. With 44K color-focused\nprompts covering 400+ colors, it reveals models' true capabilities via\nperceptual and automated assessments. Evaluations of popular text-to-image\nmodels using GenColorBench show performance variations, highlighting which\ncolor conventions models understand best and identifying failure modes. Our\nGenColorBench assessments will guide improvements in precise color generation.\nThe benchmark will be made public upon acceptance."}
{"id": "2510.20596", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20596", "abs": "https://arxiv.org/abs/2510.20596", "authors": ["Ziyu Ye", "Chen Ju", "Chaofan Ma", "Xiaoyun Zhang"], "title": "Unsupervised Domain Adaptation via Similarity-based Prototypes for Cross-Modality Segmentation", "comment": "MICCAI 2021", "summary": "Deep learning models have achieved great success on various vision\nchallenges, but a well-trained model would face drastic performance degradation\nwhen applied to unseen data. Since the model is sensitive to domain shift,\nunsupervised domain adaptation attempts to reduce the domain gap and avoid\ncostly annotation of unseen domains. This paper proposes a novel framework for\ncross-modality segmentation via similarity-based prototypes. In specific, we\nlearn class-wise prototypes within an embedding space, then introduce a\nsimilarity constraint to make these prototypes representative for each semantic\nclass while separable from different classes. Moreover, we use dictionaries to\nstore prototypes extracted from different images, which prevents the\nclass-missing problem and enables the contrastive learning of prototypes, and\nfurther improves performance. Extensive experiments show that our method\nachieves better results than other state-of-the-art methods."}
{"id": "2510.20622", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20622", "abs": "https://arxiv.org/abs/2510.20622", "authors": ["Yuan Sheng", "Yanbin Hao", "Chenxu Li", "Shuo Wang", "Xiangnan He"], "title": "SeViCES: Unifying Semantic-Visual Evidence Consensus for Long Video Understanding", "comment": null, "summary": "Long video understanding remains challenging due to its complex, diverse, and\ntemporally scattered content. Although video large language models (Video-LLMs)\ncan process videos lasting tens of minutes, applying them to truly long\nsequences is computationally prohibitive and often leads to unfocused or\ninconsistent reasoning. A promising solution is to select only the most\ninformative frames, yet existing approaches typically ignore temporal\ndependencies or rely on unimodal evidence, limiting their ability to provide\ncomplete and query-relevant context. We propose a Semantic-Visual Consensus\nEvidence Selection (SeViCES) framework for effective and reliable long video\nunderstanding. SeViCES is training-free and model-agnostic, and introduces two\nkey components. The Semantic-Visual Consensus Frame Selection (SVCFS) module\nselects frames through (1) a temporal-aware semantic branch that leverages LLM\nreasoning over captions, and (2) a cluster-guided visual branch that aligns\nembeddings with semantic scores via mutual information. The Answer Consensus\nRefinement (ACR) module further resolves inconsistencies between semantic- and\nvisual-based predictions by fusing evidence and constraining the answer space.\nExtensive experiments on long video understanding benchmarks show that SeViCES\nconsistently outperforms state-of-the-art methods in both accuracy and\nrobustness, demonstrating the importance of consensus-driven evidence selection\nfor Video-LLMs."}
{"id": "2510.20639", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20639", "abs": "https://arxiv.org/abs/2510.20639", "authors": ["Ibrahim Ethem Hamamci", "Sezgin Er", "Suprosanna Shit", "Hadrien Reynaud", "Dong Yang", "Pengfei Guo", "Marc Edgar", "Daguang Xu", "Bernhard Kainz", "Bjoern Menze"], "title": "Better Tokens for Better 3D: Advancing Vision-Language Modeling in 3D Medical Imaging", "comment": "NeurIPS 2025", "summary": "Recent progress in vision-language modeling for 3D medical imaging has been\nfueled by large-scale computed tomography (CT) corpora with paired free-text\nreports, stronger architectures, and powerful pretrained models. This has\nenabled applications such as automated report generation and text-conditioned\n3D image synthesis. Yet, current approaches struggle with high-resolution,\nlong-sequence volumes: contrastive pretraining often yields vision encoders\nthat are misaligned with clinical language, and slice-wise tokenization blurs\nfine anatomy, reducing diagnostic performance on downstream tasks. We introduce\nBTB3D (Better Tokens for Better 3D), a causal convolutional encoder-decoder\nthat unifies 2D and 3D training and inference while producing compact,\nfrequency-aware volumetric tokens. A three-stage training curriculum enables\n(i) local reconstruction, (ii) overlapping-window tiling, and (iii)\nlong-context decoder refinement, during which the model learns from short slice\nexcerpts yet generalizes to scans exceeding 300 slices without additional\nmemory overhead. BTB3D sets a new state-of-the-art on two key tasks: it\nimproves BLEU scores and increases clinical F1 by 40% over CT2Rep, CT-CHAT, and\nMerlin for report generation; and it reduces FID by 75% and halves FVD compared\nto GenerateCT and MedSyn for text-to-CT synthesis, producing anatomically\nconsistent 512*512*241 volumes. These results confirm that precise\nthree-dimensional tokenization, rather than larger language backbones alone, is\nessential for scalable vision-language modeling in 3D medical imaging. The\ncodebase is available at: https://github.com/ibrahimethemhamamci/BTB3D"}
{"id": "2510.20661", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20661", "abs": "https://arxiv.org/abs/2510.20661", "authors": ["Chen Zhao", "En Ci", "Yunzhe Xu", "Tiehan Fan", "Shanyan Guan", "Yanhao Ge", "Jian Yang", "Ying Tai"], "title": "UltraHR-100K: Enhancing UHR Image Synthesis with A Large-Scale High-Quality Dataset", "comment": "Accepted by NeurIPS 2025", "summary": "Ultra-high-resolution (UHR) text-to-image (T2I) generation has seen notable\nprogress. However, two key challenges remain : 1) the absence of a large-scale\nhigh-quality UHR T2I dataset, and (2) the neglect of tailored training\nstrategies for fine-grained detail synthesis in UHR scenarios. To tackle the\nfirst challenge, we introduce \\textbf{UltraHR-100K}, a high-quality dataset of\n100K UHR images with rich captions, offering diverse content and strong visual\nfidelity. Each image exceeds 3K resolution and is rigorously curated based on\ndetail richness, content complexity, and aesthetic quality. To tackle the\nsecond challenge, we propose a frequency-aware post-training method that\nenhances fine-detail generation in T2I diffusion models. Specifically, we\ndesign (i) \\textit{Detail-Oriented Timestep Sampling (DOTS)} to focus learning\non detail-critical denoising steps, and (ii) \\textit{Soft-Weighting Frequency\nRegularization (SWFR)}, which leverages Discrete Fourier Transform (DFT) to\nsoftly constrain frequency components, encouraging high-frequency detail\npreservation. Extensive experiments on our proposed UltraHR-eval4K benchmarks\ndemonstrate that our approach significantly improves the fine-grained detail\nquality and overall fidelity of UHR image generation. The code is available at\n\\href{https://github.com/NJU-PCALab/UltraHR-100k}{here}."}
{"id": "2510.20696", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20696", "abs": "https://arxiv.org/abs/2510.20696", "authors": ["Jing Bi", "Guangyu Sun", "Ali Vosoughi", "Chen Chen", "Chenliang Xu"], "title": "Diagnosing Visual Reasoning: Challenges, Insights, and a Path Forward", "comment": "5 pages", "summary": "Multimodal large language models (MLLMs) that integrate visual and textual\nreasoning leverage chain-of-thought (CoT) prompting to tackle complex visual\ntasks, yet continue to exhibit visual hallucinations and an over-reliance on\ntextual priors. We present a systematic diagnosis of state-of-the-art\nvision-language models using a three-stage evaluation framework, uncovering key\nfailure modes. To address these, we propose an agent-based architecture that\ncombines LLM reasoning with lightweight visual modules, enabling fine-grained\nanalysis and iterative refinement of reasoning chains. Our results highlight\nfuture visual reasoning models should focus on integrating a broader set of\nspecialized tools for analyzing visual content. Our system achieves significant\ngains (+10.3 on MMMU, +6.0 on MathVista over a 7B baseline), matching or\nsurpassing much larger models. We will release our framework and evaluation\nsuite to facilitate future research."}
{"id": "2510.20707", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20707", "abs": "https://arxiv.org/abs/2510.20707", "authors": ["Xuyang Liu", "Xiyan Gui", "Yuchao Zhang", "Linfeng Zhang"], "title": "Mixing Importance with Diversity: Joint Optimization for KV Cache Compression in Large Vision-Language Models", "comment": "Our code is available at https://github.com/xuyang-liu16/MixKV", "summary": "Recent large vision-language models (LVLMs) demonstrate remarkable\ncapabilities in processing extended multi-modal sequences, yet the resulting\nkey-value (KV) cache expansion creates a critical memory bottleneck that\nfundamentally limits deployment scalability. While existing KV cache\ncompression methods focus on retaining high-importance KV pairs to minimize\nstorage, they often overlook the modality-specific semantic redundancy patterns\nthat emerge distinctively in multi-modal KV caches. In this work, we first\nanalyze how, beyond simple importance, the KV cache in LVLMs exhibits varying\nlevels of redundancy across attention heads. We show that relying solely on\nimportance can only cover a subset of the full KV cache information\ndistribution, leading to potential loss of semantic coverage. To address this,\nwe propose \\texttt{MixKV}, a novel method that mixes importance with diversity\nfor optimized KV cache compression in LVLMs. \\texttt{MixKV} adapts to head-wise\nsemantic redundancy, selectively balancing diversity and importance when\ncompressing KV pairs. Extensive experiments demonstrate that \\texttt{MixKV}\nconsistently enhances existing methods across multiple LVLMs. Under extreme\ncompression (budget=64), \\texttt{MixKV} improves baseline methods by an average\nof \\textbf{5.1\\%} across five multi-modal understanding benchmarks and achieves\nremarkable gains of \\textbf{8.0\\%} and \\textbf{9.0\\%} for SnapKV and AdaKV on\nGUI grounding tasks, all while maintaining comparable inference efficiency.\nFurthermore, \\texttt{MixKV} extends seamlessly to LLMs with comparable\nperformance gains. Our code is available at\n\\href{https://github.com/xuyang-liu16/MixKV}{\\textcolor{citeblue}{https://github.com/xuyang-liu16/MixKV}}."}
{"id": "2510.20803", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20803", "abs": "https://arxiv.org/abs/2510.20803", "authors": ["Xiaolong Wang", "Lixiang Ru", "Ziyuan Huang", "Kaixiang Ji", "Dandan Zheng", "Jingdong Chen", "Jun Zhou"], "title": "ARGenSeg: Image Segmentation with Autoregressive Image Generation Model", "comment": "Accepted to NeurIPS 2025, 18 pages", "summary": "We propose a novel AutoRegressive Generation-based paradigm for image\nSegmentation (ARGenSeg), achieving multimodal understanding and pixel-level\nperception within a unified framework. Prior works integrating image\nsegmentation into multimodal large language models (MLLMs) typically employ\neither boundary points representation or dedicated segmentation heads. These\nmethods rely on discrete representations or semantic prompts fed into\ntask-specific decoders, which limits the ability of the MLLM to capture\nfine-grained visual details. To address these challenges, we introduce a\nsegmentation framework for MLLM based on image generation, which naturally\nproduces dense masks for target objects. We leverage MLLM to output visual\ntokens and detokenize them into images using an universal VQ-VAE, making the\nsegmentation fully dependent on the pixel-level understanding of the MLLM. To\nreduce inference latency, we employ a next-scale-prediction strategy to\ngenerate required visual tokens in parallel. Extensive experiments demonstrate\nthat our method surpasses prior state-of-the-art approaches on multiple\nsegmentation datasets with a remarkable boost in inference speed, while\nmaintaining strong understanding capabilities."}
{"id": "2510.20812", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.20812", "abs": "https://arxiv.org/abs/2510.20812", "authors": ["Yuhan Liu", "Lianhui Qin", "Shengjie Wang"], "title": "Small Drafts, Big Verdict: Information-Intensive Visual Reasoning via Speculation", "comment": null, "summary": "Large Vision-Language Models (VLMs) have achieved remarkable progress in\nmultimodal understanding, yet they struggle when reasoning over\ninformation-intensive images that densely interleave textual annotations with\nfine-grained graphical elements. The main challenges lie in precisely\nlocalizing critical cues in dense layouts and multi-hop reasoning to integrate\ndispersed evidence. We propose Speculative Verdict (SV), a training-free\nframework inspired by speculative decoding that combines multiple lightweight\ndraft experts with a large verdict model. In the draft stage, small VLMs act as\ndraft experts to generate reasoning paths that provide diverse localization\ncandidates; in the verdict stage, a strong VLM synthesizes these paths to\nproduce the final answer, minimizing computational cost while recovering\ncorrect answers. To further improve efficiency and accuracy, SV introduces a\nconsensus expert selection mechanism that forwards only high-agreement\nreasoning paths to the verdict. Empirically, SV achieves consistent gains on\nchallenging information-intensive and high-resolution visual question answering\nbenchmarks, including InfographicVQA, ChartMuseum, ChartQAPro, and HR-Bench 4K.\nBy synthesizing correct insights from multiple partially accurate reasoning\npaths, SV achieves both error correction and cost-efficiency compared to large\nproprietary models or training pipelines. Code is available at\nhttps://github.com/Tinaliu0123/speculative-verdict"}
{"id": "2510.20820", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20820", "abs": "https://arxiv.org/abs/2510.20820", "authors": ["Guocheng Gordon Qian", "Ruihang Zhang", "Tsai-Shien Chen", "Yusuf Dalva", "Anujraaj Argo Goyal", "Willi Menapace", "Ivan Skorokhodov", "Meng Dong", "Arpit Sahni", "Daniil Ostashev", "Ju Hu", "Sergey Tulyakov", "Kuan-Chieh Jackson Wang"], "title": "LayerComposer: Interactive Personalized T2I via Spatially-Aware Layered Canvas", "comment": "9 pages, preprint", "summary": "Despite their impressive visual fidelity, existing personalized generative\nmodels lack interactive control over spatial composition and scale poorly to\nmultiple subjects. To address these limitations, we present LayerComposer, an\ninteractive framework for personalized, multi-subject text-to-image generation.\nOur approach introduces two main contributions: (1) a layered canvas, a novel\nrepresentation in which each subject is placed on a distinct layer, enabling\nocclusion-free composition; and (2) a locking mechanism that preserves selected\nlayers with high fidelity while allowing the remaining layers to adapt flexibly\nto the surrounding context. Similar to professional image-editing software, the\nproposed layered canvas allows users to place, resize, or lock input subjects\nthrough intuitive layer manipulation. Our versatile locking mechanism requires\nno architectural changes, relying instead on inherent positional embeddings\ncombined with a new complementary data sampling strategy. Extensive experiments\ndemonstrate that LayerComposer achieves superior spatial control and identity\npreservation compared to the state-of-the-art methods in multi-subject\npersonalized image generation."}
{"id": "2510.20822", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20822", "abs": "https://arxiv.org/abs/2510.20822", "authors": ["Yihao Meng", "Hao Ouyang", "Yue Yu", "Qiuyu Wang", "Wen Wang", "Ka Leong Cheng", "Hanlin Wang", "Yixuan Li", "Cheng Chen", "Yanhong Zeng", "Yujun Shen", "Huamin Qu"], "title": "HoloCine: Holistic Generation of Cinematic Multi-Shot Long Video Narratives", "comment": "Project page and code: https://holo-cine.github.io/", "summary": "State-of-the-art text-to-video models excel at generating isolated clips but\nfall short of creating the coherent, multi-shot narratives, which are the\nessence of storytelling. We bridge this \"narrative gap\" with HoloCine, a model\nthat generates entire scenes holistically to ensure global consistency from the\nfirst shot to the last. Our architecture achieves precise directorial control\nthrough a Window Cross-Attention mechanism that localizes text prompts to\nspecific shots, while a Sparse Inter-Shot Self-Attention pattern (dense within\nshots but sparse between them) ensures the efficiency required for minute-scale\ngeneration. Beyond setting a new state-of-the-art in narrative coherence,\nHoloCine develops remarkable emergent abilities: a persistent memory for\ncharacters and scenes, and an intuitive grasp of cinematic techniques. Our work\nmarks a pivotal shift from clip synthesis towards automated filmmaking, making\nend-to-end cinematic creation a tangible future. Our code is available at:\nhttps://holo-cine.github.io/."}
