{"id": "2511.02358", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.LG", "cs.MM"], "pdf": "https://arxiv.org/pdf/2511.02358", "abs": "https://arxiv.org/abs/2511.02358", "authors": ["Wongyu Kim", "Hochang Lee", "Sanghak Lee", "Yoonsung Kim", "Jaehyun Park"], "title": "Let Multimodal Embedders Learn When to Augment Query via Adaptive Query Augmentation", "comment": "Accepted to MMGenSR Workshop (CIKM 2025)", "summary": "Query augmentation makes queries more meaningful by appending further\ninformation to the queries to find relevant documents. Current studies have\nproposed Large Language Model (LLM)-based embedders, which learn representation\nfor embedding and generation for query augmentation in a multi-task manner by\nleveraging the generative capabilities of LLM. During inference, these jointly\ntrained embedders have conducted query augmentation followed by embedding,\nshowing effective results. However, augmenting every query leads to substantial\nembedding latency and query augmentation can be detrimental to performance for\nsome queries. Also, previous methods have not been explored in multimodal\nenvironments. To tackle these problems, we propose M-Solomon, a universal\nmultimodal embedder that can adaptively determine when to augment queries. Our\napproach first divides the queries of the training datasets into two groups at\nthe dataset level. One includes queries that require augmentation and the other\nincludes queries that do not. Then, we introduces a synthesis process that\ngenerates appropriate augmentations for queries that require them by leveraging\na powerful Multimodal LLM (MLLM). Next, we present adaptive query augmentation.\nThrough this step, M-Solomon can conduct query augmentation only when necessary\nby learning to generate synthetic augmentations with the prefix /augment for\nqueries that demand them and to generate the simple string /embed for others.\nExperimental results showed that M-Solomon not only surpassed the baseline\nwithout augmentation by a large margin but also outperformed the baseline that\nalways used augmentation, providing much faster embedding latency."}
{"id": "2511.02366", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02366", "abs": "https://arxiv.org/abs/2511.02366", "authors": ["Yudong Li", "Zhongliang Yang", "Kejiang Chen", "Wenxuan Wang", "Tianxin Zhang", "Sifang Wan", "Kecheng Wang", "Haitian Li", "Xu Wang", "Lefan Cheng", "Youdan Yang", "Baocheng Chen", "Ziyu Liu", "Yufei Sun", "Liyan Wu", "Wenya Wen", "Xingchi Gu", "Peiru Yang"], "title": "LiveSecBench: A Dynamic and Culturally-Relevant AI Safety Benchmark for LLMs in Chinese Context", "comment": null, "summary": "In this work, we propose LiveSecBench, a dynamic and continuously updated\nsafety benchmark specifically for Chinese-language LLM application scenarios.\nLiveSecBench evaluates models across six critical dimensions (Legality, Ethics,\nFactuality, Privacy, Adversarial Robustness, and Reasoning Safety) rooted in\nthe Chinese legal and social frameworks. This benchmark maintains relevance\nthrough a dynamic update schedule that incorporates new threat vectors, such as\nthe planned inclusion of Text-to-Image Generation Safety and Agentic Safety in\nthe next update. For now, LiveSecBench (v251030) has evaluated 18 LLMs,\nproviding a landscape of AI safety in the context of Chinese language. The\nleaderboard is publicly accessible at https://livesecbench.intokentech.cn/."}
{"id": "2511.02770", "categories": ["cs.CL", "cs.IR"], "pdf": "https://arxiv.org/pdf/2511.02770", "abs": "https://arxiv.org/abs/2511.02770", "authors": ["Hung-Ting Chen", "Xiang Liu", "Shauli Ravfogel", "Eunsol Choi"], "title": "Beyond Single Embeddings: Capturing Diverse Targets with Multi-Query Retrieval", "comment": null, "summary": "Most text retrievers generate \\emph{one} query vector to retrieve relevant\ndocuments. Yet, the conditional distribution of relevant documents for the\nquery may be multimodal, e.g., representing different interpretations of the\nquery. We first quantify the limitations of existing retrievers. All retrievers\nwe evaluate struggle more as the distance between target document embeddings\ngrows. To address this limitation, we develop a new retriever architecture,\n\\emph{A}utoregressive \\emph{M}ulti-\\emph{E}mbedding \\emph{R}etriever (AMER).\nOur model autoregressively generates multiple query vectors, and all the\npredicted query vectors are used to retrieve documents from the corpus. We show\nthat on the synthetic vectorized data, the proposed method could capture\nmultiple target distributions perfectly, showing 4x better performance than\nsingle embedding model. We also fine-tune our model on real-world multi-answer\nretrieval datasets and evaluate in-domain. AMER presents 4 and 21\\% relative\ngains over single-embedding baselines on two datasets we evaluate on.\nFurthermore, we consistently observe larger gains on the subset of dataset\nwhere the embeddings of the target documents are less similar to each other. We\ndemonstrate the potential of using a multi-query vector retriever and open up a\nnew direction for future work."}
{"id": "2511.02280", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02280", "abs": "https://arxiv.org/abs/2511.02280", "authors": ["Fangxun Shu", "Yongjie Ye", "Yue Liao", "Zijian Kang", "Weijie Yin", "Jiacong Wang", "Xiao Liang", "Shuicheng Yan", "Chao Feng"], "title": "SAIL-RL: Guiding MLLMs in When and How to Think via Dual-Reward RL Tuning", "comment": null, "summary": "We introduce SAIL-RL, a reinforcement learning (RL) post-training framework\nthat enhances the reasoning capabilities of multimodal large language models\n(MLLMs) by teaching them when and how to think. Existing approaches are limited\nby outcome-only supervision, which rewards correct answers without ensuring\nsound reasoning, and by uniform thinking strategies, which often lead to\noverthinking on simple tasks and underthinking on complex ones. SAIL-RL\naddresses these challenges with a dual reward system: the Thinking Reward,\nwhich evaluates reasoning quality through factual grounding, logical coherence,\nand answer consistency, and the Judging Reward, which adaptively determines\nwhether deep reasoning or direct answering is appropriate. Experiments on the\nstate-of-the-art SAIL-VL2 show that SAIL-RL improves reasoning and multimodal\nunderstanding benchmarks at both 4B and 8B scales, achieving competitive\nperformance against commercial closed-source models such as GPT-4o, and\nsubstantially reduces hallucinations, establishing it as a principled framework\nfor building more reliable and adaptive MLLMs. The code will be available at\nhttps://github.com/BytedanceDouyinContent/SAIL-RL."}
{"id": "2511.01914", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.01914", "abs": "https://arxiv.org/abs/2511.01914", "authors": ["Yuan Zhang", "Chenyu Xue", "Wenjie Xu", "Chao Ji", "Jiajia wu", "Jia Pan"], "title": "iFlyBot-VLA Technical Report", "comment": null, "summary": "We introduce iFlyBot-VLA, a large-scale Vision-Language-Action (VLA) model\ntrained under a novel framework. The main contributions are listed as follows:\n(1) a latent action model thoroughly trained on large-scale human and robotic\nmanipulation videos; (2) a dual-level action representation framework that\njointly supervises both the Vision-Language Model (VLM) and the action expert\nduring training; (3) a mixed training strategy that combines robot trajectory\ndata with general QA and spatial QA datasets, effectively enhancing the 3D\nperceptual and reasoning capabilities of the VLM backbone. Specifically, the\nVLM is trained to predict two complementary forms of actions: latent actions,\nderived from our latent action model pretrained on cross-embodiment\nmanipulation data, which capture implicit high-level intentions; and structured\ndiscrete action tokens, obtained through frequency-domain transformations of\ncontinuous control signals, which encode explicit low-level dynamics. This dual\nsupervision aligns the representation spaces of language, vision, and action,\nenabling the VLM to directly contribute to action generation. Experimental\nresults on the LIBERO Franka benchmark demonstrate the superiority of our\nframe-work, while real-world evaluations further show that iFlyBot-VLA achieves\ncompetitive success rates across diverse and challenging manipulation tasks.\nFurthermore, we plan to open-source a portion of our self-constructed dataset\nto support future research in the community"}
{"id": "2511.02071", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02071", "abs": "https://arxiv.org/abs/2511.02071", "authors": ["Xinyi Lin", "Yuyang Zhang", "Yuanhang Gan", "Juntao Chen", "Hao Shen", "Yichun He", "Lijun Li", "Ze Yuan", "Shuang Wang", "Chaohao Wang", "Rui Zhang", "Na Li", "Jia Liu"], "title": "Human-AI Co-Embodied Intelligence for Scientific Experimentation and Manufacturing", "comment": null, "summary": "Scientific experiment and manufacture rely on complex, multi-step procedures\nthat demand continuous human expertise for precise execution and\ndecision-making. Despite advances in machine learning and automation,\nconventional models remain confined to virtual domains, while real-world\nexperiment and manufacture still rely on human supervision and expertise. This\ngap between machine intelligence and physical execution limits reproducibility,\nscalability, and accessibility across scientific and manufacture workflows.\nHere, we introduce human-AI co-embodied intelligence, a new form of physical AI\nthat unites human users, agentic AI, and wearable hardware into an integrated\nsystem for real-world experiment and intelligent manufacture. In this paradigm,\nhumans provide precise execution and control, while agentic AI contributes\nmemory, contextual reasoning, adaptive planning, and real-time feedback. The\nwearable interface continuously captures the experimental and manufacture\nprocesses, facilitates seamless communication between humans and AI for\ncorrective guidance and interpretable collaboration. As a demonstration, we\npresent Agentic-Physical Experimentation (APEX) system, coupling agentic\nreasoning with physical execution through mixed-reality. APEX observes and\ninterprets human actions, aligns them with standard operating procedures,\nprovides 3D visual guidance, and analyzes every step. Implemented in a\ncleanroom for flexible electronics fabrication, APEX system achieves\ncontext-aware reasoning with accuracy exceeding general multimodal large\nlanguage models, corrects errors in real time, and transfers expertise to\nbeginners. These results establish a new class of agentic-physical-human\nintelligence that extends agentic reasoning beyond computation into the\nphysical domain, transforming scientific research and manufacturing into\nautonomous, traceable, interpretable, and scalable processes."}
{"id": "2511.02360", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02360", "abs": "https://arxiv.org/abs/2511.02360", "authors": ["Jizheng Ma", "Xiaofei Zhou", "Yanlong Song", "Han Yan"], "title": "CoCoVa: Chain of Continuous Vision-Language Thought for Latent Space Reasoning", "comment": null, "summary": "In human cognition, there exist numerous thought processes that are tacit and\nbeyond verbal expression, enabling us to understand and interact with the world\nin multiple ways. However, contemporary Vision-Language Models (VLMs) remain\nconstrained to reasoning within the discrete and rigid space of linguistic\ntokens, thereby bottlenecking the rich, high-dimensional nature of visual\nperception. To bridge this gap, we propose CoCoVa (Chain of Continuous\nVision-Language Thought), a novel framework for vision-language model that\nleverages continuous cross-modal reasoning for diverse vision-language tasks.\nThe core of CoCoVa is an iterative reasoning cycle, where a novel Latent\nQ-Former (LQ-Former) acts as a dynamic reasoning engine, iteratively refining a\nchain of latent thought vectors through cross-modal fusion. To focus this\nprocess, a token selection mechanism dynamically identifies salient visual\nregions, mimicking attentional focus. To ensure these latent thoughts remain\ngrounded, we train the model with a multi-task objective that combines\ncontrastive learning and diffusion-based reconstruction, enforcing alignment\nbetween latent representations and both visual and textual modalities.\nEvaluations show CoCoVa improves accuracy and token efficiency over strong\nbaselines. With a 1.5B backbone, it competes with or surpasses larger 7B-9B\nmodels on almost all benchmarks. When scaled to 7B LLM backbones, it remains\ncompetitive with state-of-the-art models. Qualitative analysis validates that\nlearned latent space captures interpretable and structured reasoning patterns,\nhighlighting the potential of CoCoVa to bridge the representational gap between\ndiscrete language processing and the continuous nature of visual understanding."}
{"id": "2511.02014", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02014", "abs": "https://arxiv.org/abs/2511.02014", "authors": ["Tuan Truong", "Guillermo Jimenez Perez", "Pedro Osorio", "Matthias Lenga"], "title": "Towards Selection of Large Multimodal Models as Engines for Burned-in Protected Health Information Detection in Medical Images", "comment": "Submitted to ISBI 2026", "summary": "The detection of Protected Health Information (PHI) in medical imaging is\ncritical for safeguarding patient privacy and ensuring compliance with\nregulatory frameworks. Traditional detection methodologies predominantly\nutilize Optical Character Recognition (OCR) models in conjunction with named\nentity recognition. However, recent advancements in Large Multimodal Model\n(LMM) present new opportunities for enhanced text extraction and semantic\nanalysis. In this study, we systematically benchmark three prominent closed and\nopen-sourced LMMs, namely GPT-4o, Gemini 2.5 Flash, and Qwen 2.5 7B, utilizing\ntwo distinct pipeline configurations: one dedicated to text analysis alone and\nanother integrating both OCR and semantic analysis. Our results indicate that\nLMM exhibits superior OCR efficacy (WER: 0.03-0.05, CER: 0.02-0.03) compared to\nconventional models like EasyOCR. However, this improvement in OCR performance\ndoes not consistently correlate with enhanced overall PHI detection accuracy.\nThe strongest performance gains are observed on test cases with complex imprint\npatterns. In scenarios where text regions are well readable with sufficient\ncontrast, and strong LMMs are employed for text analysis after OCR, different\npipeline configurations yield similar results. Furthermore, we provide\nempirically grounded recommendations for LMM selection tailored to specific\noperational constraints and propose a deployment strategy that leverages\nscalable and modular infrastructure."}
{"id": "2511.02243", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02243", "abs": "https://arxiv.org/abs/2511.02243", "authors": ["Zhuoran Zhang", "Tengyue Wang", "Xilin Gong", "Yang Shi", "Haotian Wang", "Di Wang", "Lijie Hu"], "title": "When Modalities Conflict: How Unimodal Reasoning Uncertainty Governs Preference Dynamics in MLLMs", "comment": "19 pages", "summary": "Multimodal large language models (MLLMs) must resolve conflicts when\ndifferent modalities provide contradictory information, a process we term\nmodality following. Prior work measured this behavior only with coarse\ndataset-level statistics, overlooking the influence of model's confidence in\nunimodal reasoning. In this paper, we introduce a new framework that decomposes\nmodality following into two fundamental factors: relative reasoning uncertainty\n(the case-specific confidence gap between unimodal predictions) and inherent\nmodality preference( a model's stable bias when uncertainties are balanced). To\nvalidate this framework, we construct a controllable dataset that\nsystematically varies the reasoning difficulty of visual and textual inputs.\nUsing entropy as a fine-grained uncertainty metric, we uncover a universal law:\nthe probability of following a modality decreases monotonically as its relative\nuncertainty increases. At the relative difficulty level where the model tends\nto follow both modalities with comparable probability what we call the balance\npoint, a practical indicator of the model's inherent preference. Unlike\ntraditional macro-level ratios, this measure offers a more principled and less\nconfounded way to characterize modality bias, disentangling it from unimodal\ncapabilities and dataset artifacts. Further, by probing layer-wise predictions,\nwe reveal the internal mechanism of oscillation: in ambiguous regions near the\nbalance point, models vacillate between modalities across layers, explaining\nexternally observed indecision. Together, these findings establish relative\nuncertainty and inherent preference as the two governing principles of modality\nfollowing, offering both a quantitative framework and mechanistic insight into\nhow MLLMs resolve conflicting information."}
{"id": "2511.02495", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02495", "abs": "https://arxiv.org/abs/2511.02495", "authors": ["Zixuan Liu", "Siavash H. Khajavi", "Guangkai Jiang"], "title": "DetectiumFire: A Comprehensive Multi-modal Dataset Bridging Vision and Language for Fire Understanding", "comment": "Advances in Neural Information Processing Systems 2025 (NeurIPS\n  2025), Poster, https://neurips.cc/virtual/2025/loc/san-diego/poster/121400", "summary": "Recent advances in multi-modal models have demonstrated strong performance in\ntasks such as image generation and reasoning. However, applying these models to\nthe fire domain remains challenging due to the lack of publicly available\ndatasets with high-quality fire domain annotations. To address this gap, we\nintroduce DetectiumFire, a large-scale, multi-modal dataset comprising of 22.5k\nhigh-resolution fire-related images and 2.5k real-world fire-related videos\ncovering a wide range of fire types, environments, and risk levels. The data\nare annotated with both traditional computer vision labels (e.g., bounding\nboxes) and detailed textual prompts describing the scene, enabling applications\nsuch as synthetic data generation and fire risk reasoning. DetectiumFire offers\nclear advantages over existing benchmarks in scale, diversity, and data\nquality, significantly reducing redundancy and enhancing coverage of real-world\nscenarios. We validate the utility of DetectiumFire across multiple tasks,\nincluding object detection, diffusion-based image generation, and\nvision-language reasoning. Our results highlight the potential of this dataset\nto advance fire-related research and support the development of intelligent\nsafety systems. We release DetectiumFire to promote broader exploration of fire\nunderstanding in the AI community. The dataset is available at\nhttps://kaggle.com/datasets/38b79c344bdfc55d1eed3d22fbaa9c31fad45e27edbbe9e3c529d6e5c4f93890"}
{"id": "2511.02046", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02046", "abs": "https://arxiv.org/abs/2511.02046", "authors": ["Soham Joshi", "Shwet Kamal Mishra", "Viswanath Gopalakrishnan"], "title": "Text-VQA Aug: Pipelined Harnessing of Large Multimodal Models for Automated Synthesis", "comment": "First two authors contributed equally", "summary": "Creation of large-scale databases for Visual Question Answering tasks\npertaining to the text data in a scene (text-VQA) involves skilful human\nannotation, which is tedious and challenging. With the advent of foundation\nmodels that handle vision and language modalities, and with the maturity of OCR\nsystems, it is the need of the hour to establish an end-to-end pipeline that\ncan synthesize Question-Answer (QA) pairs based on scene-text from a given\nimage. We propose a pipeline for automated synthesis for text-VQA dataset that\ncan produce faithful QA pairs, and which scales up with the availability of\nscene text data. Our proposed method harnesses the capabilities of multiple\nmodels and algorithms involving OCR detection and recognition (text spotting),\nregion of interest (ROI) detection, caption generation, and question\ngeneration. These components are streamlined into a cohesive pipeline to\nautomate the synthesis and validation of QA pairs. To the best of our\nknowledge, this is the first pipeline proposed to automatically synthesize and\nvalidate a large-scale text-VQA dataset comprising around 72K QA pairs based on\naround 44K images."}
{"id": "2511.02340", "categories": ["cs.AI", "q-bio.OT"], "pdf": "https://arxiv.org/pdf/2511.02340", "abs": "https://arxiv.org/abs/2511.02340", "authors": ["Yohan Lee", "DongGyun Kang", "SeHoon Park", "Sa-Yoon Park", "Kwangsoo Kim"], "title": "Chronic Kidney Disease Prognosis Prediction Using Transformer", "comment": "5 pages, 2 figures, 2 tables", "summary": "Chronic Kidney Disease (CKD) affects nearly 10\\% of the global population and\noften progresses to end-stage renal failure. Accurate prognosis prediction is\nvital for timely interventions and resource optimization. We present a\ntransformer-based framework for predicting CKD progression using multi-modal\nelectronic health records (EHR) from the Seoul National University Hospital\nOMOP Common Data Model. Our approach (\\textbf{ProQ-BERT}) integrates\ndemographic, clinical, and laboratory data, employing quantization-based\ntokenization for continuous lab values and attention mechanisms for\ninterpretability. The model was pretrained with masked language modeling and\nfine-tuned for binary classification tasks predicting progression from stage 3a\nto stage 5 across varying follow-up and assessment periods. Evaluated on a\ncohort of 91,816 patients, our model consistently outperformed CEHR-BERT,\nachieving ROC-AUC up to 0.995 and PR-AUC up to 0.989 for short-term prediction.\nThese results highlight the effectiveness of transformer architectures and\ntemporal design choices in clinical prognosis modeling, offering a promising\ndirection for personalized CKD care."}
{"id": "2511.02607", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02607", "abs": "https://arxiv.org/abs/2511.02607", "authors": ["Xu Zhang", "Danyang Li", "Xiaohang Dong", "Tianhao Wu", "Hualong Yu", "Jianye Wang", "Qicheng Li", "Xiang Li"], "title": "UniChange: Unifying Change Detection with Multimodal Large Language Model", "comment": null, "summary": "Change detection (CD) is a fundamental task for monitoring and analyzing land\ncover dynamics. While recent high performance models and high quality datasets\nhave significantly advanced the field, a critical limitation persists. Current\nmodels typically acquire limited knowledge from single-type annotated data and\ncannot concurrently leverage diverse binary change detection (BCD) and semantic\nchange detection (SCD) datasets. This constraint leads to poor generalization\nand limited versatility. The recent advancements in Multimodal Large Language\nModels (MLLMs) introduce new possibilities for a unified CD framework. We\nleverage the language priors and unification capabilities of MLLMs to develop\nUniChange, the first MLLM-based unified change detection model. UniChange\nintegrates generative language abilities with specialized CD functionalities.\nOur model successfully unifies both BCD and SCD tasks through the introduction\nof three special tokens: [T1], [T2], and [CHANGE]. Furthermore, UniChange\nutilizes text prompts to guide the identification of change categories,\neliminating the reliance on predefined classification heads. This design allows\nUniChange to effectively acquire knowledge from multi-source datasets, even\nwhen their class definitions conflict. Experiments on four public benchmarks\n(WHU-CD, S2Looking, LEVIR-CD+, and SECOND) demonstrate SOTA performance,\nachieving IoU scores of 90.41, 53.04, 78.87, and 57.62, respectively,\nsurpassing all previous methods. The code is available at\nhttps://github.com/Erxucomeon/UniChange."}
{"id": "2511.02182", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02182", "abs": "https://arxiv.org/abs/2511.02182", "authors": ["Jinhwan Seo", "Yoonki Cho", "Junhyug Noh", "Sung-eui Yoon"], "title": "Pinpointing Trigger Moment for Grounded Video QA: Enhancing Spatio-temporal Grounding in Multimodal Large Language Models", "comment": "1st place winner of Grounded Videoqa track at the ICCV2025 Perception\n  Test", "summary": "In this technical report, we introduce a framework to address Grounded Video\nQuestion Answering (GVQA) task for the ICCV 2025 Perception Test Challenge. The\nGVQA task demands robust multimodal models capable of complex reasoning over\nvideo content, grounding the resulting answers visually, and tracking the\nreferenced objects temporally. To achieve this capability, our proposed\napproach decomposes the GVQA task into a three-stage pipeline: (1) Video\nReasoning \\& QA, (2) Spatio-temporal Grounding and (3) Tracking. Our key\ncontribution is the introduction of a trigger moment, derived from our proposed\nCORTEX prompt, which pinpoints the single most visible frame of a target object\nto serve as a robust anchor for grounding and tracking. To this end, we achieve\nthe HOTA score of 0.4968, which marks a significant improvement over the\nprevious year's winning score of 0.2704 on GVQA task."}
{"id": "2511.02532", "categories": ["cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.02532", "abs": "https://arxiv.org/abs/2511.02532", "authors": ["Jorge Pellejero", "Luis A. Hernández Gómez", "Luis Mendo Tomás", "Zoraida Frias Barroso"], "title": "Agentic AI for Mobile Network RAN Management and Optimization", "comment": null, "summary": "Agentic AI represents a new paradigm for automating complex systems by using\nLarge AI Models (LAMs) to provide human-level cognitive abilities with\nmultimodal perception, planning, memory, and reasoning capabilities. This will\nlead to a new generation of AI systems that autonomously decompose goals,\nretain context over time, learn continuously, operate across tools and\nenvironments, and adapt dynamically. The complexity of 5G and upcoming 6G\nnetworks renders manual optimization ineffective, pointing to Agentic AI as a\nmethod for automating decisions in dynamic RAN environments. However, despite\nits rapid advances, there is no established framework outlining the\nfoundational components and operational principles of Agentic AI systems nor a\nuniversally accepted definition.\n  This paper contributes to ongoing research on Agentic AI in 5G and 6G\nnetworks by outlining its core concepts and then proposing a practical use case\nthat applies Agentic principles to RAN optimization. We first introduce Agentic\nAI, tracing its evolution from classical agents and discussing the progress\nfrom workflows and simple AI agents to Agentic AI. Core design\npatterns-reflection, planning, tool use, and multi-agent collaboration-are then\ndescribed to illustrate how intelligent behaviors are orchestrated. These\ntheorical concepts are grounded in the context of mobile networks, with a focus\non RAN management and optimization. A practical 5G RAN case study shows how\ntime-series analytics and LAM-driven agents collaborate for KPI-based\nautonomous decision-making."}
{"id": "2511.02778", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02778", "abs": "https://arxiv.org/abs/2511.02778", "authors": ["Kevin Qinghong Lin", "Yuhao Zheng", "Hangyu Ran", "Dantong Zhu", "Dongxing Mao", "Linjie Li", "Philip Torr", "Alex Jinpeng Wang"], "title": "VCode: a Multimodal Coding Benchmark with SVG as Symbolic Visual Representation", "comment": "Project page: https://csu-jpg.github.io/VCode Github:\n  https://github.com/CSU-JPG/VCode", "summary": "Code has emerged as a precise and executable medium for reasoning and action\nin the agent era. Yet, progress has largely focused on language-centric tasks\nsuch as program synthesis and debugging, leaving visual-centric coding\nunderexplored. Inspired by how humans reason over sketches, we advocate SVG\ncode as a compact, interpretable, and executable visual representation. We\nintroduce VCode, a benchmark that reframes multimodal understanding as code\ngeneration: given an image, a model must produce SVG that preserves symbolic\nmeaning for downstream reasoning. VCode covers three domains - general\ncommonsense (MM-Vet), professional disciplines (MMMU), and visual-centric\nperception (CV-Bench). To assess symbolic fidelity, we propose CodeVQA, a novel\nevaluation protocol in which a policy model answers questions over rendered\nSVGs; correct answers indicate faithful symbolic preservation. Empirically,\nfrontier VLMs struggle to generate faithful SVGs, revealing a persistent gap\nbetween language-centric and visual-centric coding. To close this gap, we\nintroduce VCoder, an agentic framework that augments VLMs along two axes: (i)\nThinking with Revision, which iteratively analyzes discrepancies and refines\nSVG code; and (ii) Acting with Visual Tools, where detectors and parsers supply\nstructured cues such as objects, shapes, and text beyond the model's intrinsic\ncapacity. Across benchmarks, frontier VLMs with strong reasoning capabilities\nscore well overall yet remain limited in professional knowledge and 3D\nreasoning. VCoder delivers a 12.3-point overall gain over the top-performing\nClaude-4-Opus. Human studies show that both humans and VLMs perform worse on\nrendered SVGs, their consistency reveals the promise of symbolic visual\nrepresentation. The benchmark and code are available at\nhttps://github.com/CSU-JPG/VCode."}
{"id": "2511.02206", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02206", "abs": "https://arxiv.org/abs/2511.02206", "authors": ["Zhengjie Zhang", "Xiaoxie Mao", "Qihao Guo", "Shaoting Zhang", "Qi Huang", "Mu Zhou", "Fang Xie", "Mianxin Liu"], "title": "Language-Enhanced Generative Modeling for PET Synthesis from MRI and Blood Biomarkers", "comment": "31 pages, 8 figures", "summary": "Background: Alzheimer's disease (AD) diagnosis heavily relies on amyloid-beta\npositron emission tomography (Abeta-PET), which is limited by high cost and\nlimited accessibility. This study explores whether Abeta-PET spatial patterns\ncan be predicted from blood-based biomarkers (BBMs) and MRI scans. Methods: We\ncollected Abeta-PET images, T1-weighted MRI scans, and BBMs from 566\nparticipants. A language-enhanced generative model, driven by a large language\nmodel (LLM) and multimodal information fusion, was developed to synthesize PET\nimages. Synthesized images were evaluated for image quality, diagnostic\nconsistency, and clinical applicability within a fully automated diagnostic\npipeline. Findings: The synthetic PET images closely resemble real PET scans in\nboth structural details (SSIM = 0.920 +/- 0.003) and regional patterns\n(Pearson's r = 0.955 +/- 0.007). Diagnostic outcomes using synthetic PET show\nhigh agreement with real PET-based diagnoses (accuracy = 0.80). Using synthetic\nPET, we developed a fully automatic AD diagnostic pipeline integrating PET\nsynthesis and classification. The synthetic PET-based model (AUC = 0.78)\noutperforms T1-based (AUC = 0.68) and BBM-based (AUC = 0.73) models, while\ncombining synthetic PET and BBMs further improved performance (AUC = 0.79).\nAblation analysis supports the advantages of LLM integration and prompt\nengineering. Interpretation: Our language-enhanced generative model synthesizes\nrealistic PET images, enhancing the utility of MRI and BBMs for Abeta spatial\npattern assessment and improving the diagnostic workflow for Alzheimer's\ndisease."}
{"id": "2511.02794", "categories": ["cs.AI", "cs.MA"], "pdf": "https://arxiv.org/pdf/2511.02794", "abs": "https://arxiv.org/abs/2511.02794", "authors": ["Chenyu Zhang", "Minsol Kim", "Shohreh Ghorbani", "Jingyao Wu", "Rosalind Picard", "Patricia Maes", "Paul Pu Liang"], "title": "When One Modality Sabotages the Others: A Diagnostic Lens on Multimodal Reasoning", "comment": "Accepted at the Multimodal Algorithmic Reasoning (MAR) Workshop,\n  NeurIPS 2025", "summary": "Despite rapid growth in multimodal large language models (MLLMs), their\nreasoning traces remain opaque: it is often unclear which modality drives a\nprediction, how conflicts are resolved, or when one stream dominates. In this\npaper, we introduce modality sabotage, a diagnostic failure mode in which a\nhigh-confidence unimodal error overrides other evidence and misleads the fused\nresult. To analyze such dynamics, we propose a lightweight, model-agnostic\nevaluation layer that treats each modality as an agent, producing candidate\nlabels and a brief self-assessment used for auditing. A simple fusion mechanism\naggregates these outputs, exposing contributors (modalities supporting correct\noutcomes) and saboteurs (modalities that mislead). Applying our diagnostic\nlayer in a case study on multimodal emotion recognition benchmarks with\nfoundation models revealed systematic reliability profiles, providing insight\ninto whether failures may arise from dataset artifacts or model limitations.\nMore broadly, our framework offers a diagnostic scaffold for multimodal\nreasoning, supporting principled auditing of fusion dynamics and informing\npossible interventions."}
{"id": "2511.02834", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.02834", "abs": "https://arxiv.org/abs/2511.02834", "authors": ["Huawei Lin", "Yunzhi Shi", "Tong Geng", "Weijie Zhao", "Wei Wang", "Ravender Pal Singh"], "title": "Agent-Omni: Test-Time Multimodal Reasoning via Model Coordination for Understanding Anything", "comment": "16 pages, 7 figures, 14 tables. Under Review", "summary": "Multimodal large language models (MLLMs) have shown strong capabilities but\nremain limited to fixed modality pairs and require costly fine-tuning with\nlarge aligned datasets. Building fully omni-capable models that can integrate\ntext, images, audio, and video remains impractical and lacks robust reasoning\nsupport. In this paper, we propose an Agent-Omni framework that coordinates\nexisting foundation models through a master-agent system, enabling flexible\nmultimodal reasoning without retraining. The master agent interprets user\nintent, delegates subtasks to modality-specific agents, and integrates their\noutputs into coherent responses. Extensive experiments across text, image,\naudio, video, and omni benchmarks show that Agent-Omni consistently achieves\nstate-of-the-art performance, particularly on tasks requiring complex\ncross-modal reasoning. Its agent-based design enables seamless integration of\nspecialized foundation models, ensuring adaptability to diverse inputs while\nmaintaining transparency and interpretability. In addition, the framework is\nmodular and easily extensible, allowing future improvements as stronger models\nbecome available. %We release an open-source implementation to support\ncontinued research on scalable and reliable omni-modal reasoning."}
{"id": "2511.02228", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02228", "abs": "https://arxiv.org/abs/2511.02228", "authors": ["Delin Ma", "Menghui Zhou", "Jun Qi", "Yun Yang", "Po Yang"], "title": "Collaborative Attention and Consistent-Guided Fusion of MRI and PET for Alzheimer's Disease Diagnosis", "comment": null, "summary": "Alzheimer's disease (AD) is the most prevalent form of dementia, and its\nearly diagnosis is essential for slowing disease progression. Recent studies on\nmultimodal neuroimaging fusion using MRI and PET have achieved promising\nresults by integrating multi-scale complementary features. However, most\nexisting approaches primarily emphasize cross-modal complementarity while\noverlooking the diagnostic importance of modality-specific features. In\naddition, the inherent distributional differences between modalities often lead\nto biased and noisy representations, degrading classification performance. To\naddress these challenges, we propose a Collaborative Attention and\nConsistent-Guided Fusion framework for MRI and PET based AD diagnosis. The\nproposed model introduces a learnable parameter representation (LPR) block to\ncompensate for missing modality information, followed by a shared encoder and\nmodality-independent encoders to preserve both shared and specific\nrepresentations. Furthermore, a consistency-guided mechanism is employed to\nexplicitly align the latent distributions across modalities. Experimental\nresults on the ADNI dataset demonstrate that our method achieves superior\ndiagnostic performance compared with existing fusion strategies."}
{"id": "2511.02834", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.02834", "abs": "https://arxiv.org/abs/2511.02834", "authors": ["Huawei Lin", "Yunzhi Shi", "Tong Geng", "Weijie Zhao", "Wei Wang", "Ravender Pal Singh"], "title": "Agent-Omni: Test-Time Multimodal Reasoning via Model Coordination for Understanding Anything", "comment": "16 pages, 7 figures, 14 tables. Under Review", "summary": "Multimodal large language models (MLLMs) have shown strong capabilities but\nremain limited to fixed modality pairs and require costly fine-tuning with\nlarge aligned datasets. Building fully omni-capable models that can integrate\ntext, images, audio, and video remains impractical and lacks robust reasoning\nsupport. In this paper, we propose an Agent-Omni framework that coordinates\nexisting foundation models through a master-agent system, enabling flexible\nmultimodal reasoning without retraining. The master agent interprets user\nintent, delegates subtasks to modality-specific agents, and integrates their\noutputs into coherent responses. Extensive experiments across text, image,\naudio, video, and omni benchmarks show that Agent-Omni consistently achieves\nstate-of-the-art performance, particularly on tasks requiring complex\ncross-modal reasoning. Its agent-based design enables seamless integration of\nspecialized foundation models, ensuring adaptability to diverse inputs while\nmaintaining transparency and interpretability. In addition, the framework is\nmodular and easily extensible, allowing future improvements as stronger models\nbecome available. %We release an open-source implementation to support\ncontinued research on scalable and reliable omni-modal reasoning."}
{"id": "2511.02271", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02271", "abs": "https://arxiv.org/abs/2511.02271", "authors": ["Yucheng Song", "Yifan Ge", "Junhao Li", "Zhining Liao", "Zhifang Liao"], "title": "Medical Report Generation: A Hierarchical Task Structure-Based Cross-Modal Causal Intervention Framework", "comment": null, "summary": "Medical Report Generation (MRG) is a key part of modern medical diagnostics,\nas it automatically generates reports from radiological images to reduce\nradiologists' burden. However, reliable MRG models for lesion description face\nthree main challenges: insufficient domain knowledge understanding, poor\ntext-visual entity embedding alignment, and spurious correlations from\ncross-modal biases. Previous work only addresses single challenges, while this\npaper tackles all three via a novel hierarchical task decomposition approach,\nproposing the HTSC-CIF framework. HTSC-CIF classifies the three challenges into\nlow-, mid-, and high-level tasks: 1) Low-level: align medical entity features\nwith spatial locations to enhance domain knowledge for visual encoders; 2)\nMid-level: use Prefix Language Modeling (text) and Masked Image Modeling\n(images) to boost cross-modal alignment via mutual guidance; 3) High-level: a\ncross-modal causal intervention module (via front-door intervention) to reduce\nconfounders and improve interpretability. Extensive experiments confirm\nHTSC-CIF's effectiveness, significantly outperforming state-of-the-art (SOTA)\nMRG methods. Code will be made public upon paper acceptance."}
{"id": "2511.01914", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.01914", "abs": "https://arxiv.org/abs/2511.01914", "authors": ["Yuan Zhang", "Chenyu Xue", "Wenjie Xu", "Chao Ji", "Jiajia wu", "Jia Pan"], "title": "iFlyBot-VLA Technical Report", "comment": null, "summary": "We introduce iFlyBot-VLA, a large-scale Vision-Language-Action (VLA) model\ntrained under a novel framework. The main contributions are listed as follows:\n(1) a latent action model thoroughly trained on large-scale human and robotic\nmanipulation videos; (2) a dual-level action representation framework that\njointly supervises both the Vision-Language Model (VLM) and the action expert\nduring training; (3) a mixed training strategy that combines robot trajectory\ndata with general QA and spatial QA datasets, effectively enhancing the 3D\nperceptual and reasoning capabilities of the VLM backbone. Specifically, the\nVLM is trained to predict two complementary forms of actions: latent actions,\nderived from our latent action model pretrained on cross-embodiment\nmanipulation data, which capture implicit high-level intentions; and structured\ndiscrete action tokens, obtained through frequency-domain transformations of\ncontinuous control signals, which encode explicit low-level dynamics. This dual\nsupervision aligns the representation spaces of language, vision, and action,\nenabling the VLM to directly contribute to action generation. Experimental\nresults on the LIBERO Franka benchmark demonstrate the superiority of our\nframe-work, while real-world evaluations further show that iFlyBot-VLA achieves\ncompetitive success rates across diverse and challenging manipulation tasks.\nFurthermore, we plan to open-source a portion of our self-constructed dataset\nto support future research in the community"}
{"id": "2511.02280", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02280", "abs": "https://arxiv.org/abs/2511.02280", "authors": ["Fangxun Shu", "Yongjie Ye", "Yue Liao", "Zijian Kang", "Weijie Yin", "Jiacong Wang", "Xiao Liang", "Shuicheng Yan", "Chao Feng"], "title": "SAIL-RL: Guiding MLLMs in When and How to Think via Dual-Reward RL Tuning", "comment": null, "summary": "We introduce SAIL-RL, a reinforcement learning (RL) post-training framework\nthat enhances the reasoning capabilities of multimodal large language models\n(MLLMs) by teaching them when and how to think. Existing approaches are limited\nby outcome-only supervision, which rewards correct answers without ensuring\nsound reasoning, and by uniform thinking strategies, which often lead to\noverthinking on simple tasks and underthinking on complex ones. SAIL-RL\naddresses these challenges with a dual reward system: the Thinking Reward,\nwhich evaluates reasoning quality through factual grounding, logical coherence,\nand answer consistency, and the Judging Reward, which adaptively determines\nwhether deep reasoning or direct answering is appropriate. Experiments on the\nstate-of-the-art SAIL-VL2 show that SAIL-RL improves reasoning and multimodal\nunderstanding benchmarks at both 4B and 8B scales, achieving competitive\nperformance against commercial closed-source models such as GPT-4o, and\nsubstantially reduces hallucinations, establishing it as a principled framework\nfor building more reliable and adaptive MLLMs. The code will be available at\nhttps://github.com/BytedanceDouyinContent/SAIL-RL."}
{"id": "2511.02046", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02046", "abs": "https://arxiv.org/abs/2511.02046", "authors": ["Soham Joshi", "Shwet Kamal Mishra", "Viswanath Gopalakrishnan"], "title": "Text-VQA Aug: Pipelined Harnessing of Large Multimodal Models for Automated Synthesis", "comment": "First two authors contributed equally", "summary": "Creation of large-scale databases for Visual Question Answering tasks\npertaining to the text data in a scene (text-VQA) involves skilful human\nannotation, which is tedious and challenging. With the advent of foundation\nmodels that handle vision and language modalities, and with the maturity of OCR\nsystems, it is the need of the hour to establish an end-to-end pipeline that\ncan synthesize Question-Answer (QA) pairs based on scene-text from a given\nimage. We propose a pipeline for automated synthesis for text-VQA dataset that\ncan produce faithful QA pairs, and which scales up with the availability of\nscene text data. Our proposed method harnesses the capabilities of multiple\nmodels and algorithms involving OCR detection and recognition (text spotting),\nregion of interest (ROI) detection, caption generation, and question\ngeneration. These components are streamlined into a cohesive pipeline to\nautomate the synthesis and validation of QA pairs. To the best of our\nknowledge, this is the first pipeline proposed to automatically synthesize and\nvalidate a large-scale text-VQA dataset comprising around 72K QA pairs based on\naround 44K images."}
{"id": "2511.02360", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02360", "abs": "https://arxiv.org/abs/2511.02360", "authors": ["Jizheng Ma", "Xiaofei Zhou", "Yanlong Song", "Han Yan"], "title": "CoCoVa: Chain of Continuous Vision-Language Thought for Latent Space Reasoning", "comment": null, "summary": "In human cognition, there exist numerous thought processes that are tacit and\nbeyond verbal expression, enabling us to understand and interact with the world\nin multiple ways. However, contemporary Vision-Language Models (VLMs) remain\nconstrained to reasoning within the discrete and rigid space of linguistic\ntokens, thereby bottlenecking the rich, high-dimensional nature of visual\nperception. To bridge this gap, we propose CoCoVa (Chain of Continuous\nVision-Language Thought), a novel framework for vision-language model that\nleverages continuous cross-modal reasoning for diverse vision-language tasks.\nThe core of CoCoVa is an iterative reasoning cycle, where a novel Latent\nQ-Former (LQ-Former) acts as a dynamic reasoning engine, iteratively refining a\nchain of latent thought vectors through cross-modal fusion. To focus this\nprocess, a token selection mechanism dynamically identifies salient visual\nregions, mimicking attentional focus. To ensure these latent thoughts remain\ngrounded, we train the model with a multi-task objective that combines\ncontrastive learning and diffusion-based reconstruction, enforcing alignment\nbetween latent representations and both visual and textual modalities.\nEvaluations show CoCoVa improves accuracy and token efficiency over strong\nbaselines. With a 1.5B backbone, it competes with or surpasses larger 7B-9B\nmodels on almost all benchmarks. When scaled to 7B LLM backbones, it remains\ncompetitive with state-of-the-art models. Qualitative analysis validates that\nlearned latent space captures interpretable and structured reasoning patterns,\nhighlighting the potential of CoCoVa to bridge the representational gap between\ndiscrete language processing and the continuous nature of visual understanding."}
{"id": "2511.02228", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02228", "abs": "https://arxiv.org/abs/2511.02228", "authors": ["Delin Ma", "Menghui Zhou", "Jun Qi", "Yun Yang", "Po Yang"], "title": "Collaborative Attention and Consistent-Guided Fusion of MRI and PET for Alzheimer's Disease Diagnosis", "comment": null, "summary": "Alzheimer's disease (AD) is the most prevalent form of dementia, and its\nearly diagnosis is essential for slowing disease progression. Recent studies on\nmultimodal neuroimaging fusion using MRI and PET have achieved promising\nresults by integrating multi-scale complementary features. However, most\nexisting approaches primarily emphasize cross-modal complementarity while\noverlooking the diagnostic importance of modality-specific features. In\naddition, the inherent distributional differences between modalities often lead\nto biased and noisy representations, degrading classification performance. To\naddress these challenges, we propose a Collaborative Attention and\nConsistent-Guided Fusion framework for MRI and PET based AD diagnosis. The\nproposed model introduces a learnable parameter representation (LPR) block to\ncompensate for missing modality information, followed by a shared encoder and\nmodality-independent encoders to preserve both shared and specific\nrepresentations. Furthermore, a consistency-guided mechanism is employed to\nexplicitly align the latent distributions across modalities. Experimental\nresults on the ADNI dataset demonstrate that our method achieves superior\ndiagnostic performance compared with existing fusion strategies."}
{"id": "2511.02384", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02384", "abs": "https://arxiv.org/abs/2511.02384", "authors": ["Jiahe Song", "Chuang Wang", "Bowen Jiang", "Yinfan Wang", "Hao Zheng", "Xingjian Wei", "Chengjin Liu", "Junyuan Gao", "Yubin Wang", "Lijun Wu", "Jiang Wu", "Qian Yu", "Conghui He"], "title": "RxnCaption: Reformulating Reaction Diagram Parsing as Visual Prompt Guided Captioning", "comment": null, "summary": "Large-scale chemical reaction datasets are crucial for AI research in\nchemistry. However, existing chemical reaction data often exist as images\nwithin papers, making them not machine-readable and unusable for training\nmachine learning models. In response to this challenge, we propose the\nRxnCaption framework for the task of chemical Reaction Diagram Parsing (RxnDP).\nOur framework reformulates the traditional coordinate prediction driven parsing\nprocess into an image captioning problem, which Large Vision-Language Models\n(LVLMs) handle naturally. We introduce a strategy termed \"BBox and Index as\nVisual Prompt\" (BIVP), which uses our state-of-the-art molecular detector,\nMolYOLO, to pre-draw molecular bounding boxes and indices directly onto the\ninput image. This turns the downstream parsing into a natural-language\ndescription problem. Extensive experiments show that the BIVP strategy\nsignificantly improves structural extraction quality while simplifying model\ndesign. We further construct the RxnCaption-11k dataset, an order of magnitude\nlarger than prior real-world literature benchmarks, with a balanced test subset\nacross four layout archetypes. Experiments demonstrate that RxnCaption-VL\nachieves state-of-the-art performance on multiple metrics. We believe our\nmethod, dataset, and models will advance structured information extraction from\nchemical literature and catalyze broader AI applications in chemistry. We will\nrelease data, models, and code on GitHub."}
{"id": "2511.02358", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.LG", "cs.MM"], "pdf": "https://arxiv.org/pdf/2511.02358", "abs": "https://arxiv.org/abs/2511.02358", "authors": ["Wongyu Kim", "Hochang Lee", "Sanghak Lee", "Yoonsung Kim", "Jaehyun Park"], "title": "Let Multimodal Embedders Learn When to Augment Query via Adaptive Query Augmentation", "comment": "Accepted to MMGenSR Workshop (CIKM 2025)", "summary": "Query augmentation makes queries more meaningful by appending further\ninformation to the queries to find relevant documents. Current studies have\nproposed Large Language Model (LLM)-based embedders, which learn representation\nfor embedding and generation for query augmentation in a multi-task manner by\nleveraging the generative capabilities of LLM. During inference, these jointly\ntrained embedders have conducted query augmentation followed by embedding,\nshowing effective results. However, augmenting every query leads to substantial\nembedding latency and query augmentation can be detrimental to performance for\nsome queries. Also, previous methods have not been explored in multimodal\nenvironments. To tackle these problems, we propose M-Solomon, a universal\nmultimodal embedder that can adaptively determine when to augment queries. Our\napproach first divides the queries of the training datasets into two groups at\nthe dataset level. One includes queries that require augmentation and the other\nincludes queries that do not. Then, we introduces a synthesis process that\ngenerates appropriate augmentations for queries that require them by leveraging\na powerful Multimodal LLM (MLLM). Next, we present adaptive query augmentation.\nThrough this step, M-Solomon can conduct query augmentation only when necessary\nby learning to generate synthetic augmentations with the prefix /augment for\nqueries that demand them and to generate the simple string /embed for others.\nExperimental results showed that M-Solomon not only surpassed the baseline\nwithout augmentation by a large margin but also outperformed the baseline that\nalways used augmentation, providing much faster embedding latency."}
{"id": "2511.02415", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02415", "abs": "https://arxiv.org/abs/2511.02415", "authors": ["Duo Xu", "Hao Cheng", "Xin Lin", "Zhen Xie", "Hao Wang"], "title": "ChartM$^3$: A Multi-Stage Code-Driven Pipeline for Constructing Multi-Dimensional and Multi-Step Visual Reasoning Data in Chart Comprehension", "comment": "23 pages, EMNLP25 Accepted", "summary": "Complex chart understanding tasks demand advanced visual recognition and\nreasoning capabilities from multimodal large language models (MLLMs). However,\ncurrent research provides limited coverage of complex chart scenarios and\ncomputation-intensive reasoning tasks prevalent in real-world applications.\nThis study proposes an automated multi-stage code-driven pipeline for\nsystematically generating visual reasoning datasets to address these\nlimitations. The pipeline integrates retrieval-augmented generation (RAG) to\nretrieve professional chart templates and employs chain-of-thought (CoT)\nstrategies to generate reasoning codes that simulate real data distributions,\nthereby driving chart rendering and question-related statistical computations.\nThrough model-based evaluation, the pipeline enhances chart diversity and data\nquality. Using this framework, we construct ChartM$^3$, a multi-dimensional and\nmulti-step dataset containing 38K charts and 142K Q&A pairs for training, along\nwith 2,871 high-quality evaluation samples for enabling practical performance\nassessment. Supervised fine-tuning (SFT) and reinforcement learning (RL)\nexperiments demonstrate that our dataset significantly improves reasoning\ncapabilities and cross-domain generalization performance, enabling smaller\nmodels to achieve performance comparable to larger-scale models in complex\nchart comprehension."}
{"id": "2511.02565", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02565", "abs": "https://arxiv.org/abs/2511.02565", "authors": ["Jingyu Lu", "Haonan Wang", "Qixiang Zhang", "Xiaomeng Li"], "title": "A Cognitive Process-Inspired Architecture for Subject-Agnostic Brain Visual Decoding", "comment": "9 pages main text with 6 figures (excluding references),\n  supplementary material included", "summary": "Subject-agnostic brain decoding, which aims to reconstruct continuous visual\nexperiences from fMRI without subject-specific training, holds great potential\nfor clinical applications. However, this direction remains underexplored due to\nchallenges in cross-subject generalization and the complex nature of brain\nsignals. In this work, we propose Visual Cortex Flow Architecture (VCFlow), a\nnovel hierarchical decoding framework that explicitly models the ventral-dorsal\narchitecture of the human visual system to learn multi-dimensional\nrepresentations. By disentangling and leveraging features from early visual\ncortex, ventral, and dorsal streams, VCFlow captures diverse and complementary\ncognitive information essential for visual reconstruction. Furthermore, we\nintroduce a feature-level contrastive learning strategy to enhance the\nextraction of subject-invariant semantic representations, thereby enhancing\nsubject-agnostic applicability to previously unseen subjects. Unlike\nconventional pipelines that need more than 12 hours of per-subject data and\nheavy computation, VCFlow sacrifices only 7\\% accuracy on average yet generates\neach reconstructed video in 10 seconds without any retraining, offering a fast\nand clinically scalable solution. The source code will be released upon\nacceptance of the paper."}
{"id": "2511.02427", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.02427", "abs": "https://arxiv.org/abs/2511.02427", "authors": ["Nicolas Schuler", "Lea Dewald", "Nick Baldig", "Jürgen Graf"], "title": "From the Laboratory to Real-World Application: Evaluating Zero-Shot Scene Interpretation on Edge Devices for Mobile Robotics", "comment": "15 pages, 6 figures, 1 table; accepted for AI-2025 Forty-fifth SGAI\n  International Conference on Artificial Intelligence CAMBRIDGE, ENGLAND 16-18\n  DECEMBER 2025", "summary": "Video Understanding, Scene Interpretation and Commonsense Reasoning are\nhighly challenging tasks enabling the interpretation of visual information,\nallowing agents to perceive, interact with and make rational decisions in its\nenvironment. Large Language Models (LLMs) and Visual Language Models (VLMs)\nhave shown remarkable advancements in these areas in recent years, enabling\ndomain-specific applications as well as zero-shot open vocabulary tasks,\ncombining multiple domains. However, the required computational complexity\nposes challenges for their application on edge devices and in the context of\nMobile Robotics, especially considering the trade-off between accuracy and\ninference time. In this paper, we investigate the capabilities of\nstate-of-the-art VLMs for the task of Scene Interpretation and Action\nRecognition, with special regard to small VLMs capable of being deployed to\nedge devices in the context of Mobile Robotics. The proposed pipeline is\nevaluated on a diverse dataset consisting of various real-world cityscape,\non-campus and indoor scenarios. The experimental evaluation discusses the\npotential of these small models on edge devices, with particular emphasis on\nchallenges, weaknesses, inherent model biases and the application of the gained\ninformation. Supplementary material is provided via the following repository:\nhttps://datahub.rz.rptu.de/hstr-csrl-public/publications/scene-interpretation-on-edge-devices/"}
{"id": "2511.02580", "categories": ["cs.CV", "cs.AI", "cs.GR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.02580", "abs": "https://arxiv.org/abs/2511.02580", "authors": ["Daichi Nagai", "Ryugo Morita", "Shunsuke Kitada", "Hitoshi Iyatomi"], "title": "TAUE: Training-free Noise Transplant and Cultivation Diffusion Model", "comment": "13 pages, 8 figures, 3 tables. The first two authors contributed\n  equally. Project Page: https://iyatomilab.github.io/TAUE", "summary": "Despite the remarkable success of text-to-image diffusion models, their\noutput of a single, flattened image remains a critical bottleneck for\nprofessional applications requiring layer-wise control. Existing solutions\neither rely on fine-tuning with large, inaccessible datasets or are\ntraining-free yet limited to generating isolated foreground elements, failing\nto produce a complete and coherent scene. To address this, we introduce the\nTraining-free Noise Transplantation and Cultivation Diffusion Model (TAUE), a\nnovel framework for zero-shot, layer-wise image generation. Our core technique,\nNoise Transplantation and Cultivation (NTC), extracts intermediate latent\nrepresentations from both foreground and composite generation processes,\ntransplanting them into the initial noise for subsequent layers. This ensures\nsemantic and structural coherence across foreground, background, and composite\nlayers, enabling consistent, multi-layered outputs without requiring\nfine-tuning or auxiliary datasets. Extensive experiments show that our\ntraining-free method achieves performance comparable to fine-tuned methods,\nenhancing layer-wise consistency while maintaining high image quality and\nfidelity. TAUE not only eliminates costly training and dataset requirements but\nalso unlocks novel downstream applications, such as complex compositional\nediting, paving the way for more accessible and controllable generative\nworkflows."}
{"id": "2511.02495", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02495", "abs": "https://arxiv.org/abs/2511.02495", "authors": ["Zixuan Liu", "Siavash H. Khajavi", "Guangkai Jiang"], "title": "DetectiumFire: A Comprehensive Multi-modal Dataset Bridging Vision and Language for Fire Understanding", "comment": "Advances in Neural Information Processing Systems 2025 (NeurIPS\n  2025), Poster, https://neurips.cc/virtual/2025/loc/san-diego/poster/121400", "summary": "Recent advances in multi-modal models have demonstrated strong performance in\ntasks such as image generation and reasoning. However, applying these models to\nthe fire domain remains challenging due to the lack of publicly available\ndatasets with high-quality fire domain annotations. To address this gap, we\nintroduce DetectiumFire, a large-scale, multi-modal dataset comprising of 22.5k\nhigh-resolution fire-related images and 2.5k real-world fire-related videos\ncovering a wide range of fire types, environments, and risk levels. The data\nare annotated with both traditional computer vision labels (e.g., bounding\nboxes) and detailed textual prompts describing the scene, enabling applications\nsuch as synthetic data generation and fire risk reasoning. DetectiumFire offers\nclear advantages over existing benchmarks in scale, diversity, and data\nquality, significantly reducing redundancy and enhancing coverage of real-world\nscenarios. We validate the utility of DetectiumFire across multiple tasks,\nincluding object detection, diffusion-based image generation, and\nvision-language reasoning. Our results highlight the potential of this dataset\nto advance fire-related research and support the development of intelligent\nsafety systems. We release DetectiumFire to promote broader exploration of fire\nunderstanding in the AI community. The dataset is available at\nhttps://kaggle.com/datasets/38b79c344bdfc55d1eed3d22fbaa9c31fad45e27edbbe9e3c529d6e5c4f93890"}
{"id": "2511.02720", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02720", "abs": "https://arxiv.org/abs/2511.02720", "authors": ["Vojtěch Kůr", "Adam Bajger", "Adam Kukučka", "Marek Hradil", "Vít Musil", "Tomáš Brázdil"], "title": "LLEXICORP: End-user Explainability of Convolutional Neural Networks", "comment": null, "summary": "Convolutional neural networks (CNNs) underpin many modern computer vision\nsystems. With applications ranging from common to critical areas, a need to\nexplain and understand the model and its decisions (XAI) emerged. Prior works\nsuggest that in the top layers of CNNs, the individual channels can be\nattributed to classifying human-understandable concepts. Concept relevance\npropagation (CRP) methods can backtrack predictions to these channels and find\nimages that most activate these channels. However, current CRP workflows are\nlargely manual: experts must inspect activation images to name the discovered\nconcepts and must synthesize verbose explanations from relevance maps, limiting\nthe accessibility of the explanations and their scalability.\n  To address these issues, we introduce Large Language model EXplaIns COncept\nRelevance Propagation (LLEXICORP), a modular pipeline that couples CRP with a\nmultimodal large language model. Our approach automatically assigns descriptive\nnames to concept prototypes and generates natural-language explanations that\ntranslate quantitative relevance distributions into intuitive narratives. To\nensure faithfulness, we craft prompts that teach the language model the\nsemantics of CRP through examples and enforce a separation between naming and\nexplanation tasks. The resulting text can be tailored to different audiences,\noffering low-level technical descriptions for experts and high-level summaries\nfor non-technical stakeholders.\n  We qualitatively evaluate our method on various images from ImageNet on a\nVGG16 model. Our findings suggest that integrating concept-based attribution\nmethods with large language models can significantly lower the barrier to\ninterpreting deep neural networks, paving the way for more transparent AI\nsystems."}
{"id": "2511.02503", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02503", "abs": "https://arxiv.org/abs/2511.02503", "authors": ["Robinson Umeike", "Neil Getty", "Yin Xiangyu", "Yi Jiang"], "title": "Adapting General-Purpose Foundation Models for X-ray Ptychography in Low-Data Regimes", "comment": null, "summary": "The automation of workflows in advanced microscopy is a key goal where\nfoundation models like Language Models (LLMs) and Vision-Language Models (VLMs)\nshow great potential. However, adapting these general-purpose models for\nspecialized scientific tasks is critical, and the optimal domain adaptation\nstrategy is often unclear. To address this, we introduce PtychoBench, a new\nmulti-modal, multi-task benchmark for ptychographic analysis. Using this\nbenchmark, we systematically compare two specialization strategies: Supervised\nFine-Tuning (SFT) and In-Context Learning (ICL). We evaluate these strategies\non a visual artifact detection task with VLMs and a textual parameter\nrecommendation task with LLMs in a data-scarce regime. Our findings reveal that\nthe optimal specialization pathway is task-dependent. For the visual task, SFT\nand ICL are highly complementary, with a fine-tuned model guided by\ncontext-aware examples achieving the highest mean performance (Micro-F1 of\n0.728). Conversely, for the textual task, ICL on a large base model is the\nsuperior strategy, reaching a peak Micro-F1 of 0.847 and outperforming a\npowerful \"super-expert\" SFT model (0-shot Micro-F1 of 0.839). We also confirm\nthe superiority of context-aware prompting and identify a consistent contextual\ninterference phenomenon in fine-tuned models. These results, benchmarked\nagainst strong baselines including GPT-4o and a DINOv3-based classifier, offer\nkey observations for AI in science: the optimal specialization path in our\nbenchmark is dependent on the task modality, offering a clear framework for\ndeveloping more effective science-based agentic systems."}
{"id": "2511.02507", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.02507", "abs": "https://arxiv.org/abs/2511.02507", "authors": ["Nicolas Schuler", "Lea Dewald", "Jürgen Graf"], "title": "Keeping it Local, Tiny and Real: Automated Report Generation on Edge Computing Devices for Mechatronic-Based Cognitive Systems", "comment": "6 pages, 4 figures, 1 table; accepted for MECATRONICS-REM 2025\n  International Conference, PARIS, FRANCE December 3-5 2025", "summary": "Recent advancements in Deep Learning enable hardware-based cognitive systems,\nthat is, mechatronic systems in general and robotics in particular with\nintegrated Artificial Intelligence, to interact with dynamic and unstructured\nenvironments. While the results are impressive, the application of such systems\nto critical tasks like autonomous driving as well as service and care robotics\nnecessitate the evaluation of large amount of heterogeneous data. Automated\nreport generation for Mobile Robotics can play a crucial role in facilitating\nthe evaluation and acceptance of such systems in various domains. In this\npaper, we propose a pipeline for generating automated reports in natural\nlanguage utilizing various multi-modal sensors that solely relies on local\nmodels capable of being deployed on edge computing devices, thus preserving the\nprivacy of all actors involved and eliminating the need for external services.\nIn particular, we evaluate our implementation on a diverse dataset spanning\nmultiple domains including indoor, outdoor and urban environments, providing\nquantitative as well as qualitative evaluation results. Various generated\nexample reports and other supplementary materials are available via a public\nrepository."}
{"id": "2511.02564", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02564", "abs": "https://arxiv.org/abs/2511.02564", "authors": ["Md Rashidunnabi", "Kailash A. Hambarde", "Vasco Lopes", "Joao C. Neves", "Hugo Proenca"], "title": "Seeing Across Time and Views: Multi-Temporal Cross-View Learning for Robust Video Person Re-Identification", "comment": null, "summary": "Video-based person re-identification (ReID) in cross-view domains (for\nexample, aerial-ground surveillance) remains an open problem because of extreme\nviewpoint shifts, scale disparities, and temporal inconsistencies. To address\nthese challenges, we propose MTF-CVReID, a parameter-efficient framework that\nintroduces seven complementary modules over a ViT-B/16 backbone. Specifically,\nwe include: (1) Cross-Stream Feature Normalization (CSFN) to correct camera and\nview biases; (2) Multi-Resolution Feature Harmonization (MRFH) for scale\nstabilization across altitudes; (3) Identity-Aware Memory Module (IAMM) to\nreinforce persistent identity traits; (4) Temporal Dynamics Modeling (TDM) for\nmotion-aware short-term temporal encoding; (5) Inter-View Feature Alignment\n(IVFA) for perspective-invariant representation alignment; (6) Hierarchical\nTemporal Pattern Learning (HTPL) to capture multi-scale temporal regularities;\nand (7) Multi-View Identity Consistency Learning (MVICL) that enforces\ncross-view identity coherence using a contrastive learning paradigm. Despite\nadding only about 2 million parameters and 0.7 GFLOPs over the baseline,\nMTF-CVReID maintains real-time efficiency (189 FPS) and achieves\nstate-of-the-art performance on the AG-VPReID benchmark across all altitude\nlevels, with strong cross-dataset generalization to G2A-VReID and MARS\ndatasets. These results show that carefully designed adapter-based modules can\nsubstantially enhance cross-view robustness and temporal consistency without\ncompromising computational efficiency. The source code is available at\nhttps://github.com/MdRashidunnabi/MTF-CVReID"}
{"id": "2511.02565", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02565", "abs": "https://arxiv.org/abs/2511.02565", "authors": ["Jingyu Lu", "Haonan Wang", "Qixiang Zhang", "Xiaomeng Li"], "title": "A Cognitive Process-Inspired Architecture for Subject-Agnostic Brain Visual Decoding", "comment": "9 pages main text with 6 figures (excluding references),\n  supplementary material included", "summary": "Subject-agnostic brain decoding, which aims to reconstruct continuous visual\nexperiences from fMRI without subject-specific training, holds great potential\nfor clinical applications. However, this direction remains underexplored due to\nchallenges in cross-subject generalization and the complex nature of brain\nsignals. In this work, we propose Visual Cortex Flow Architecture (VCFlow), a\nnovel hierarchical decoding framework that explicitly models the ventral-dorsal\narchitecture of the human visual system to learn multi-dimensional\nrepresentations. By disentangling and leveraging features from early visual\ncortex, ventral, and dorsal streams, VCFlow captures diverse and complementary\ncognitive information essential for visual reconstruction. Furthermore, we\nintroduce a feature-level contrastive learning strategy to enhance the\nextraction of subject-invariant semantic representations, thereby enhancing\nsubject-agnostic applicability to previously unseen subjects. Unlike\nconventional pipelines that need more than 12 hours of per-subject data and\nheavy computation, VCFlow sacrifices only 7\\% accuracy on average yet generates\neach reconstructed video in 10 seconds without any retraining, offering a fast\nand clinically scalable solution. The source code will be released upon\nacceptance of the paper."}
{"id": "2511.02580", "categories": ["cs.CV", "cs.AI", "cs.GR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.02580", "abs": "https://arxiv.org/abs/2511.02580", "authors": ["Daichi Nagai", "Ryugo Morita", "Shunsuke Kitada", "Hitoshi Iyatomi"], "title": "TAUE: Training-free Noise Transplant and Cultivation Diffusion Model", "comment": "13 pages, 8 figures, 3 tables. The first two authors contributed\n  equally. Project Page: https://iyatomilab.github.io/TAUE", "summary": "Despite the remarkable success of text-to-image diffusion models, their\noutput of a single, flattened image remains a critical bottleneck for\nprofessional applications requiring layer-wise control. Existing solutions\neither rely on fine-tuning with large, inaccessible datasets or are\ntraining-free yet limited to generating isolated foreground elements, failing\nto produce a complete and coherent scene. To address this, we introduce the\nTraining-free Noise Transplantation and Cultivation Diffusion Model (TAUE), a\nnovel framework for zero-shot, layer-wise image generation. Our core technique,\nNoise Transplantation and Cultivation (NTC), extracts intermediate latent\nrepresentations from both foreground and composite generation processes,\ntransplanting them into the initial noise for subsequent layers. This ensures\nsemantic and structural coherence across foreground, background, and composite\nlayers, enabling consistent, multi-layered outputs without requiring\nfine-tuning or auxiliary datasets. Extensive experiments show that our\ntraining-free method achieves performance comparable to fine-tuned methods,\nenhancing layer-wise consistency while maintaining high image quality and\nfidelity. TAUE not only eliminates costly training and dataset requirements but\nalso unlocks novel downstream applications, such as complex compositional\nediting, paving the way for more accessible and controllable generative\nworkflows."}
{"id": "2511.02591", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02591", "abs": "https://arxiv.org/abs/2511.02591", "authors": ["Jan Frederik Meier", "Timo Lüddecke"], "title": "Zero-Shot Multi-Animal Tracking in the Wild", "comment": null, "summary": "Multi-animal tracking is crucial for understanding animal ecology and\nbehavior. However, it remains a challenging task due to variations in habitat,\nmotion patterns, and species appearance. Traditional approaches typically\nrequire extensive model fine-tuning and heuristic design for each application\nscenario. In this work, we explore the potential of recent vision foundation\nmodels for zero-shot multi-animal tracking. By combining a Grounding Dino\nobject detector with the Segment Anything Model 2 (SAM 2) tracker and carefully\ndesigned heuristics, we develop a tracking framework that can be applied to new\ndatasets without any retraining or hyperparameter adaptation. Evaluations on\nChimpAct, Bird Flock Tracking, AnimalTrack, and a subset of GMOT-40 demonstrate\nstrong and consistent performance across diverse species and environments. The\ncode is available at https://github.com/ecker-lab/SAM2-Animal-Tracking."}
{"id": "2511.02607", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02607", "abs": "https://arxiv.org/abs/2511.02607", "authors": ["Xu Zhang", "Danyang Li", "Xiaohang Dong", "Tianhao Wu", "Hualong Yu", "Jianye Wang", "Qicheng Li", "Xiang Li"], "title": "UniChange: Unifying Change Detection with Multimodal Large Language Model", "comment": null, "summary": "Change detection (CD) is a fundamental task for monitoring and analyzing land\ncover dynamics. While recent high performance models and high quality datasets\nhave significantly advanced the field, a critical limitation persists. Current\nmodels typically acquire limited knowledge from single-type annotated data and\ncannot concurrently leverage diverse binary change detection (BCD) and semantic\nchange detection (SCD) datasets. This constraint leads to poor generalization\nand limited versatility. The recent advancements in Multimodal Large Language\nModels (MLLMs) introduce new possibilities for a unified CD framework. We\nleverage the language priors and unification capabilities of MLLMs to develop\nUniChange, the first MLLM-based unified change detection model. UniChange\nintegrates generative language abilities with specialized CD functionalities.\nOur model successfully unifies both BCD and SCD tasks through the introduction\nof three special tokens: [T1], [T2], and [CHANGE]. Furthermore, UniChange\nutilizes text prompts to guide the identification of change categories,\neliminating the reliance on predefined classification heads. This design allows\nUniChange to effectively acquire knowledge from multi-source datasets, even\nwhen their class definitions conflict. Experiments on four public benchmarks\n(WHU-CD, S2Looking, LEVIR-CD+, and SECOND) demonstrate SOTA performance,\nachieving IoU scores of 90.41, 53.04, 78.87, and 57.62, respectively,\nsurpassing all previous methods. The code is available at\nhttps://github.com/Erxucomeon/UniChange."}
{"id": "2511.02650", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02650", "abs": "https://arxiv.org/abs/2511.02650", "authors": ["Tianfan Peng", "Yuntao Du", "Pengzhou Ji", "Shijie Dong", "Kailin Jiang", "Mingchuan Ma", "Yijun Tian", "Jinhe Bi", "Qian Li", "Wei Du", "Feng Xiao", "Lizhen Cui"], "title": "Can Visual Input Be Compressed? A Visual Token Compression Benchmark for Large Multimodal Models", "comment": null, "summary": "Large multimodal models (LMMs) often suffer from severe inference\ninefficiency due to the large number of visual tokens introduced by image\nencoders. While recent token compression methods, such as pruning and merging,\nhave shown promise in reducing redundancy, their evaluation remains fragmented\nand inconsistent. In this work, we present UniPruneBench, a unified and\nextensible benchmark for visual token pruning in multimodal LLMs. UniPruneBench\nprovides standardized protocols across six ability dimensions and ten datasets,\ncovering ten representative compression algorithms and three families of LMMs\n(LLaVA-v1.5, Intern-VL3, and Qwen2.5-VL). Beyond task accuracy, it incorporates\nsystem-level metrics such as runtime and prefilling latency to provide a\nholistic view. Our experiments uncover several key findings: (1) random pruning\nis a surprisingly strong baseline, (2) no single method consistently\noutperforms others across scenarios, (3) pruning sensitivity varies\nsignificantly across tasks, with OCR being most vulnerable, and (4) pruning\nratio is the dominant factor governing performance degradation. We believe\nUniPruneBench will serve as a reliable foundation for future research on\nefficient multimodal modeling."}
{"id": "2511.02685", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02685", "abs": "https://arxiv.org/abs/2511.02685", "authors": ["Chao Yuan", "Zanwu Liu", "Guiwei Zhang", "Haoxuan Xu", "Yujian Zhao", "Guanglin Niu", "Bo Li"], "title": "Modality-Transition Representation Learning for Visible-Infrared Person Re-Identification", "comment": null, "summary": "Visible-infrared person re-identification (VI-ReID) technique could associate\nthe pedestrian images across visible and infrared modalities in the practical\nscenarios of background illumination changes. However, a substantial gap\ninherently exists between these two modalities. Besides, existing methods\nprimarily rely on intermediate representations to align cross-modal features of\nthe same person. The intermediate feature representations are usually create by\ngenerating intermediate images (kind of data enhancement), or fusing\nintermediate features (more parameters, lack of interpretability), and they do\nnot make good use of the intermediate features. Thus, we propose a novel\nVI-ReID framework via Modality-Transition Representation Learning (MTRL) with a\nmiddle generated image as a transmitter from visible to infrared modals, which\nare fully aligned with the original visible images and similar to the infrared\nmodality. After that, using a modality-transition contrastive loss and a\nmodality-query regularization loss for training, which could align the\ncross-modal features more effectively. Notably, our proposed framework does not\nneed any additional parameters, which achieves the same inference speed to the\nbackbone while improving its performance on VI-ReID task. Extensive\nexperimental results illustrate that our model significantly and consistently\noutperforms existing SOTAs on three typical VI-ReID datasets."}
{"id": "2511.02720", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.02720", "abs": "https://arxiv.org/abs/2511.02720", "authors": ["Vojtěch Kůr", "Adam Bajger", "Adam Kukučka", "Marek Hradil", "Vít Musil", "Tomáš Brázdil"], "title": "LLEXICORP: End-user Explainability of Convolutional Neural Networks", "comment": null, "summary": "Convolutional neural networks (CNNs) underpin many modern computer vision\nsystems. With applications ranging from common to critical areas, a need to\nexplain and understand the model and its decisions (XAI) emerged. Prior works\nsuggest that in the top layers of CNNs, the individual channels can be\nattributed to classifying human-understandable concepts. Concept relevance\npropagation (CRP) methods can backtrack predictions to these channels and find\nimages that most activate these channels. However, current CRP workflows are\nlargely manual: experts must inspect activation images to name the discovered\nconcepts and must synthesize verbose explanations from relevance maps, limiting\nthe accessibility of the explanations and their scalability.\n  To address these issues, we introduce Large Language model EXplaIns COncept\nRelevance Propagation (LLEXICORP), a modular pipeline that couples CRP with a\nmultimodal large language model. Our approach automatically assigns descriptive\nnames to concept prototypes and generates natural-language explanations that\ntranslate quantitative relevance distributions into intuitive narratives. To\nensure faithfulness, we craft prompts that teach the language model the\nsemantics of CRP through examples and enforce a separation between naming and\nexplanation tasks. The resulting text can be tailored to different audiences,\noffering low-level technical descriptions for experts and high-level summaries\nfor non-technical stakeholders.\n  We qualitatively evaluate our method on various images from ImageNet on a\nVGG16 model. Our findings suggest that integrating concept-based attribution\nmethods with large language models can significantly lower the barrier to\ninterpreting deep neural networks, paving the way for more transparent AI\nsystems."}
{"id": "2511.02767", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02767", "abs": "https://arxiv.org/abs/2511.02767", "authors": ["Tyler Zhu", "Tengda Han", "Leonidas Guibas", "Viorica Pătrăucean", "Maks Ovsjanikov"], "title": "Dynamic Reflections: Probing Video Representations with Text Alignment", "comment": "21 pages, 12 figures", "summary": "The alignment of representations from different modalities has recently been\nshown to provide insights on the structural similarities and downstream\ncapabilities of different encoders across diverse data types. While significant\nprogress has been made in aligning images with text, the temporal nature of\nvideo data remains largely unexplored in this context. In this work, we conduct\nthe first comprehensive study of video-text representation alignment, probing\nthe capabilities of modern video and language encoders. Our findings reveal\nseveral key insights. First, we demonstrate that cross-modal alignment highly\ndepends on the richness of both visual (static images vs. multi-frame videos)\nand text (single caption vs. a collection) data provided at test time,\nespecially when using state-of-the-art video encoders. We propose parametric\ntest-time scaling laws that capture this behavior and show remarkable\npredictive power against empirical observations. Secondly, we investigate the\ncorrelation between semantic alignment and performance on both semantic and\nnon-semantic downstream tasks, providing initial evidence that strong alignment\nagainst text encoders may be linked to general-purpose video representation and\nunderstanding. Finally, we correlate temporal reasoning with cross-modal\nalignment providing a challenging test-bed for vision and language models.\nOverall, our work introduces video-text alignment as an informative zero-shot\nway to probe the representation power of different encoders for spatio-temporal\ndata. Project page can be found at https://video-prh.github.io/"}
{"id": "2511.02778", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.02778", "abs": "https://arxiv.org/abs/2511.02778", "authors": ["Kevin Qinghong Lin", "Yuhao Zheng", "Hangyu Ran", "Dantong Zhu", "Dongxing Mao", "Linjie Li", "Philip Torr", "Alex Jinpeng Wang"], "title": "VCode: a Multimodal Coding Benchmark with SVG as Symbolic Visual Representation", "comment": "Project page: https://csu-jpg.github.io/VCode Github:\n  https://github.com/CSU-JPG/VCode", "summary": "Code has emerged as a precise and executable medium for reasoning and action\nin the agent era. Yet, progress has largely focused on language-centric tasks\nsuch as program synthesis and debugging, leaving visual-centric coding\nunderexplored. Inspired by how humans reason over sketches, we advocate SVG\ncode as a compact, interpretable, and executable visual representation. We\nintroduce VCode, a benchmark that reframes multimodal understanding as code\ngeneration: given an image, a model must produce SVG that preserves symbolic\nmeaning for downstream reasoning. VCode covers three domains - general\ncommonsense (MM-Vet), professional disciplines (MMMU), and visual-centric\nperception (CV-Bench). To assess symbolic fidelity, we propose CodeVQA, a novel\nevaluation protocol in which a policy model answers questions over rendered\nSVGs; correct answers indicate faithful symbolic preservation. Empirically,\nfrontier VLMs struggle to generate faithful SVGs, revealing a persistent gap\nbetween language-centric and visual-centric coding. To close this gap, we\nintroduce VCoder, an agentic framework that augments VLMs along two axes: (i)\nThinking with Revision, which iteratively analyzes discrepancies and refines\nSVG code; and (ii) Acting with Visual Tools, where detectors and parsers supply\nstructured cues such as objects, shapes, and text beyond the model's intrinsic\ncapacity. Across benchmarks, frontier VLMs with strong reasoning capabilities\nscore well overall yet remain limited in professional knowledge and 3D\nreasoning. VCoder delivers a 12.3-point overall gain over the top-performing\nClaude-4-Opus. Human studies show that both humans and VLMs perform worse on\nrendered SVGs, their consistency reveals the promise of symbolic visual\nrepresentation. The benchmark and code are available at\nhttps://github.com/CSU-JPG/VCode."}
{"id": "2511.02779", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02779", "abs": "https://arxiv.org/abs/2511.02779", "authors": ["Yiyang Zhou", "Haoqin Tu", "Zijun Wang", "Zeyu Wang", "Niklas Muennighoff", "Fan Nie", "Yejin Choi", "James Zou", "Chaorui Deng", "Shen Yan", "Haoqi Fan", "Cihang Xie", "Huaxiu Yao", "Qinghao Ye"], "title": "When Visualizing is the First Step to Reasoning: MIRA, a Benchmark for Visual Chain-of-Thought", "comment": "28 pages, 15 figures", "summary": "We propose MIRA, a new benchmark designed to evaluate models in scenarios\nwhere generating intermediate visual images is essential for successful\nreasoning. Unlike traditional CoT methods that rely solely on text, tasks in\nMIRA require models to generate and utilize intermediate images - such as\nsketches, structural diagrams, or path drawings - to guide their reasoning\nprocess. This setup closely mirrors how humans solve complex problems through\n\"drawing to think\". To solve this, MIRA focuses on tasks that are intrinsically\nchallenging and involve complex structures, spatial relationships, or reasoning\nsteps that are difficult to express through language alone. To ensure that our\nevaluation data is of high-quality, we include 546 multimodal problems,\nannotated with intermediate visual images and final answers. We also propose a\nunified evaluation protocol for MIRA that spans three levels of evaluation\ninput: direct input with image and question only, text-only CoT input with\nimage and thinking prompts, and Visual-CoT input with both annotated image\nclues and textual thinking prompts. To probe the upper bound of model capacity\non our benchmark, we also report pass@k and majority voting accuracies under\ndifferent k settings. Experimental results show that existing multimodal large\nlanguage models, including strongest private models as well as strong\nopen-weight models, perform poorly when relying solely on textual prompts.\nHowever, when intermediate visual cues are provided, model performance improves\nconsistently, yielding an average relative gain of 33.7% across all models and\ntasks. We also probe the upper bound by expanding the search space and\ndesigning textual prompts aligned with Visual-CoT, but both yield only limited\nimprovements compared to our Visual-CoT setting. These results underscore the\ncritical role of imagined visual information in enabling successful reasoning\non MIRA."}
