{"id": "2511.10615", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.10615", "abs": "https://arxiv.org/abs/2511.10615", "authors": ["Shruti Singh Baghel", "Yash Pratap Singh Rathore", "Sushovan Jena", "Anurag Pradhan", "Amit Shukla", "Arnav Bhavsar", "Pawan Goyal"], "title": "Towards Blind and Low-Vision Accessibility of Lightweight VLMs and Custom LLM-Evals", "comment": "8 pages", "summary": "Large Vision-Language Models (VLMs) excel at understanding and generating video descriptions but their high memory, computation, and deployment demands hinder practical use particularly for blind and low-vision (BLV) users who depend on detailed, context-aware descriptions. To study the effect of model size on accessibility-focused description quality, we evaluate SmolVLM2 variants with 500M and 2.2B parameters across two diverse datasets: AVCaps (outdoor), and Charades (indoor). In this work, we introduce two novel evaluation frameworks specifically designed for BLV accessibility assessment: the Multi-Context BLV Framework evaluating spatial orientation, social interaction, action events, and ambience contexts; and the Navigational Assistance Framework focusing on mobility-critical information. Additionally, we conduct a systematic evaluation of four different prompt design strategies and deploy both models on a smartphone, evaluating FP32 and INT8 precision variants to assess real-world performance constraints on resource-limited mobile devices."}
{"id": "2511.10615", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.10615", "abs": "https://arxiv.org/abs/2511.10615", "authors": ["Shruti Singh Baghel", "Yash Pratap Singh Rathore", "Sushovan Jena", "Anurag Pradhan", "Amit Shukla", "Arnav Bhavsar", "Pawan Goyal"], "title": "Towards Blind and Low-Vision Accessibility of Lightweight VLMs and Custom LLM-Evals", "comment": "8 pages", "summary": "Large Vision-Language Models (VLMs) excel at understanding and generating video descriptions but their high memory, computation, and deployment demands hinder practical use particularly for blind and low-vision (BLV) users who depend on detailed, context-aware descriptions. To study the effect of model size on accessibility-focused description quality, we evaluate SmolVLM2 variants with 500M and 2.2B parameters across two diverse datasets: AVCaps (outdoor), and Charades (indoor). In this work, we introduce two novel evaluation frameworks specifically designed for BLV accessibility assessment: the Multi-Context BLV Framework evaluating spatial orientation, social interaction, action events, and ambience contexts; and the Navigational Assistance Framework focusing on mobility-critical information. Additionally, we conduct a systematic evaluation of four different prompt design strategies and deploy both models on a smartphone, evaluating FP32 and INT8 precision variants to assess real-world performance constraints on resource-limited mobile devices."}
{"id": "2511.10648", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.10648", "abs": "https://arxiv.org/abs/2511.10648", "authors": ["Jiahao Wang", "Weiye Xu", "Aijun Yang", "Wengang Zhou", "Lewei Lu", "Houqiang Li", "Xiaohua Wang", "Jinguo Zhu"], "title": "Enhancing the Outcome Reward-based RL Training of MLLMs with Self-Consistency Sampling", "comment": "Accepted to NeurIPS 2025 (The Thirty-Ninth Annual Conference on Neural Information Processing Systems)", "summary": "Outcome-reward reinforcement learning (RL) is a common and increasingly significant way to refine the step-by-step reasoning of multimodal large language models (MLLMs). In the multiple-choice setting - a dominant format for multimodal reasoning benchmarks - the paradigm faces a significant yet often overlooked obstacle: unfaithful trajectories that guess the correct option after a faulty chain of thought receive the same reward as genuine reasoning, which is a flaw that cannot be ignored. We propose Self-Consistency Sampling (SCS) to correct this issue. For each question, SCS (i) introduces small visual perturbations and (ii) performs repeated truncation and resampling of an initial trajectory; agreement among the resulting trajectories yields a differentiable consistency score that down-weights unreliable traces during policy updates. Based on Qwen2.5-VL-7B-Instruct, plugging SCS into RLOO, GRPO, and REINFORCE++ series improves accuracy by up to 7.7 percentage points on six multimodal benchmarks with negligible extra computation. SCS also yields notable gains on both Qwen2.5-VL-3B-Instruct and InternVL3-8B, offering a simple, general remedy for outcome-reward RL in MLLMs."}
