{"id": "2510.14992", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.14992", "abs": "https://arxiv.org/abs/2510.14992", "authors": ["Leela Krishna", "Mengyang Zhao", "Saicharithreddy Pasula", "Harshit Rajgarhia", "Abhishek Mukherji"], "title": "GAZE:Governance-Aware pre-annotation for Zero-shot World Model Environments", "comment": null, "summary": "Training robust world models requires large-scale, precisely labeled\nmultimodal datasets, a process historically bottlenecked by slow and expensive\nmanual annotation. We present a production-tested GAZE pipeline that automates\nthe conversion of raw, long-form video into rich, task-ready supervision for\nworld-model training. Our system (i) normalizes proprietary 360-degree formats\ninto standard views and shards them for parallel processing; (ii) applies a\nsuite of AI models (scene understanding, object tracking, audio transcription,\nPII/NSFW/minor detection) for dense, multimodal pre-annotation; and (iii)\nconsolidates signals into a structured output specification for rapid human\nvalidation.\n  The GAZE workflow demonstrably yields efficiency gains (~19 minutes saved per\nreview hour) and reduces human review volume by >80% through conservative\nauto-skipping of low-salience segments. By increasing label density and\nconsistency while integrating privacy safeguards and chain-of-custody metadata,\nour method generates high-fidelity, privacy-aware datasets directly consumable\nfor learning cross-modal dynamics and action-conditioned prediction. We detail\nour orchestration, model choices, and data dictionary to provide a scalable\nblueprint for generating high-quality world model training data without\nsacrificing throughput or governance."}
{"id": "2510.15015", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15015", "abs": "https://arxiv.org/abs/2510.15015", "authors": ["Mor Ventura", "Michael Toker", "Or Patashnik", "Yonatan Belinkov", "Roi Reichart"], "title": "DeLeaker: Dynamic Inference-Time Reweighting For Semantic Leakage Mitigation in Text-to-Image Models", "comment": null, "summary": "Text-to-Image (T2I) models have advanced rapidly, yet they remain vulnerable\nto semantic leakage, the unintended transfer of semantically related features\nbetween distinct entities. Existing mitigation strategies are often\noptimization-based or dependent on external inputs. We introduce DeLeaker, a\nlightweight, optimization-free inference-time approach that mitigates leakage\nby directly intervening on the model's attention maps. Throughout the diffusion\nprocess, DeLeaker dynamically reweights attention maps to suppress excessive\ncross-entity interactions while strengthening the identity of each entity. To\nsupport systematic evaluation, we introduce SLIM (Semantic Leakage in IMages),\nthe first dataset dedicated to semantic leakage, comprising 1,130\nhuman-verified samples spanning diverse scenarios, together with a novel\nautomatic evaluation framework. Experiments demonstrate that DeLeaker\nconsistently outperforms all baselines, even when they are provided with\nexternal information, achieving effective leakage mitigation without\ncompromising fidelity or quality. These results underscore the value of\nattention control and pave the way for more semantically precise T2I models."}
{"id": "2510.15018", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.15018", "abs": "https://arxiv.org/abs/2510.15018", "authors": ["Mingxuan Liu", "Honglin He", "Elisa Ricci", "Wayne Wu", "Bolei Zhou"], "title": "UrbanVerse: Scaling Urban Simulation by Watching City-Tour Videos", "comment": "Technical report. Project page: https://urbanverseproject.github.io/", "summary": "Urban embodied AI agents, ranging from delivery robots to quadrupeds, are\nincreasingly populating our cities, navigating chaotic streets to provide\nlast-mile connectivity. Training such agents requires diverse, high-fidelity\nurban environments to scale, yet existing human-crafted or procedurally\ngenerated simulation scenes either lack scalability or fail to capture\nreal-world complexity. We introduce UrbanVerse, a data-driven real-to-sim\nsystem that converts crowd-sourced city-tour videos into physics-aware,\ninteractive simulation scenes. UrbanVerse consists of: (i) UrbanVerse-100K, a\nrepository of 100k+ annotated urban 3D assets with semantic and physical\nattributes, and (ii) UrbanVerse-Gen, an automatic pipeline that extracts scene\nlayouts from video and instantiates metric-scale 3D simulations using retrieved\nassets. Running in IsaacSim, UrbanVerse offers 160 high-quality constructed\nscenes from 24 countries, along with a curated benchmark of 10 artist-designed\ntest scenes. Experiments show that UrbanVerse scenes preserve real-world\nsemantics and layouts, achieving human-evaluated realism comparable to manually\ncrafted scenes. In urban navigation, policies trained in UrbanVerse exhibit\nscaling power laws and strong generalization, improving success by +6.3% in\nsimulation and +30.1% in zero-shot sim-to-real transfer comparing to prior\nmethods, accomplishing a 300 m real-world mission with only two interventions."}
{"id": "2510.15026", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15026", "abs": "https://arxiv.org/abs/2510.15026", "authors": ["Mattia Segu", "Marta Tintore Gazulla", "Yongqin Xian", "Luc Van Gool", "Federico Tombari"], "title": "MOBIUS: Big-to-Mobile Universal Instance Segmentation via Multi-modal Bottleneck Fusion and Calibrated Decoder Pruning", "comment": "ICCV 2025", "summary": "Scaling up model size and training data has advanced foundation models for\ninstance-level perception, achieving state-of-the-art in-domain and zero-shot\nperformance across object detection and segmentation. However, their high\ncomputational cost limits adoption on resource-constrained platforms. We first\nexamine the limitations of existing architectures in enabling efficient edge\ndeployment without compromising performance. We then introduce MOBIUS, a family\nof foundation models for universal instance segmentation, designed for\nPareto-optimal downscaling to support deployment across devices ranging from\nhigh-end accelerators to mobile hardware. To reduce training and inference\ndemands, we propose: (i) a bottleneck pixel decoder for efficient multi-scale\nand multi-modal fusion, (ii) a language-guided uncertainty calibration loss for\nadaptive decoder pruning, and (iii) a streamlined, unified training strategy.\nUnlike efficient baselines that trade accuracy for reduced complexity, MOBIUS\nreduces pixel and transformer decoder FLOPs by up to 55% and 75%, respectively,\nwhile maintaining state-of-the-art performance in just a third of the training\niterations. MOBIUS establishes a new benchmark for efficient segmentation on\nboth high-performance computing platforms and mobile devices."}
{"id": "2510.15253", "categories": ["cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15253", "abs": "https://arxiv.org/abs/2510.15253", "authors": ["Sensen Gao", "Shanshan Zhao", "Xu Jiang", "Lunhao Duan", "Yong Xien Chng", "Qing-Guo Chen", "Weihua Luo", "Kaifu Zhang", "Jia-Wang Bian", "Mingming Gong"], "title": "Scaling Beyond Context: A Survey of Multimodal Retrieval-Augmented Generation for Document Understanding", "comment": null, "summary": "Document understanding is critical for applications from financial analysis\nto scientific discovery. Current approaches, whether OCR-based pipelines\nfeeding Large Language Models (LLMs) or native Multimodal LLMs (MLLMs), face\nkey limitations: the former loses structural detail, while the latter struggles\nwith context modeling. Retrieval-Augmented Generation (RAG) helps ground models\nin external data, but documents' multimodal nature, i.e., combining text,\ntables, charts, and layout, demands a more advanced paradigm: Multimodal RAG.\nThis approach enables holistic retrieval and reasoning across all modalities,\nunlocking comprehensive document intelligence. Recognizing its importance, this\npaper presents a systematic survey of Multimodal RAG for document\nunderstanding. We propose a taxonomy based on domain, retrieval modality, and\ngranularity, and review advances involving graph structures and agentic\nframeworks. We also summarize key datasets, benchmarks, and applications, and\nhighlight open challenges in efficiency, fine-grained representation, and\nrobustness, providing a roadmap for future progress in document AI."}
{"id": "2510.15261", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15261", "abs": "https://arxiv.org/abs/2510.15261", "authors": ["Jitesh Jain", "Shubham Maheshwari", "Ning Yu", "Wen-mei Hwu", "Humphrey Shi"], "title": "AUGUSTUS: An LLM-Driven Multimodal Agent System with Contextualized User Memory", "comment": "LAW 2025 Workshop at NeurIPS 2025. Work done from late 2023 to early\n  2024", "summary": "Riding on the success of LLMs with retrieval-augmented generation (RAG),\nthere has been a growing interest in augmenting agent systems with external\nmemory databases. However, the existing systems focus on storing text\ninformation in their memory, ignoring the importance of multimodal signals.\nMotivated by the multimodal nature of human memory, we present AUGUSTUS, a\nmultimodal agent system aligned with the ideas of human memory in cognitive\nscience. Technically, our system consists of 4 stages connected in a loop: (i)\nencode: understanding the inputs; (ii) store in memory: saving important\ninformation; (iii) retrieve: searching for relevant context from memory; and\n(iv) act: perform the task. Unlike existing systems that use vector databases,\nwe propose conceptualizing information into semantic tags and associating the\ntags with their context to store them in a graph-structured multimodal\ncontextual memory for efficient concept-driven retrieval. Our system\noutperforms the traditional multimodal RAG approach while being 3.5 times\nfaster for ImageNet classification and outperforming MemGPT on the MSC\nbenchmark."}
{"id": "2510.15040", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15040", "abs": "https://arxiv.org/abs/2510.15040", "authors": ["Xinyi Gu", "Jiayuan Mao", "Zhang-Wei Hong", "Zhuoran Yu", "Pengyuan Li", "Dhiraj Joshi", "Rogerio Feris", "Zexue He"], "title": "Composition-Grounded Instruction Synthesis for Visual Reasoning", "comment": null, "summary": "Pretrained multi-modal large language models (MLLMs) demonstrate strong\nperformance on diverse multimodal tasks, but remain limited in reasoning\ncapabilities for domains where annotations are difficult to collect. In this\nwork, we focus on artificial image domains such as charts, rendered documents,\nand webpages, which are abundant in practice yet lack large-scale human\nannotated reasoning datasets. We introduce COGS (COmposition-Grounded\ninstruction Synthesis), a data-efficient framework for equipping MLLMs with\nadvanced reasoning abilities from a small set of seed questions. The key idea\nis to decompose each seed question into primitive perception and reasoning\nfactors, which can then be systematically recomposed with new images to\ngenerate large collections of synthetic question-answer pairs. Each generated\nquestion is paired with subquestions and intermediate answers, enabling\nreinforcement learning with factor-level process rewards. Experiments on chart\nreasoning show that COGS substantially improves performance on unseen\nquestions, with the largest gains on reasoning-heavy and compositional\nquestions. Moreover, training with a factor-level mixture of different seed\ndata yields better transfer across multiple datasets, suggesting that COGS\ninduces generalizable capabilities rather than dataset-specific overfitting. We\nfurther demonstrate that the framework extends beyond charts to other domains\nsuch as webpages."}
{"id": "2510.15349", "categories": ["cs.CL", "F.2.2; I.2.7"], "pdf": "https://arxiv.org/pdf/2510.15349", "abs": "https://arxiv.org/abs/2510.15349", "authors": ["Baode Wang", "Biao Wu", "Weizhen Li", "Meng Fang", "Zuming Huang", "Jun Huang", "Haozhe Wang", "Yanjie Liang", "Ling Chen", "Wei Chu", "Yuan Qi"], "title": "Infinity Parser: Layout Aware Reinforcement Learning for Scanned Document Parsing", "comment": "22 pages, 14 figures,", "summary": "Document parsing from scanned images into structured formats remains a\nsignificant challenge due to its complexly intertwined elements such as text\nparagraphs, figures, formulas, and tables. Existing supervised fine-tuning\nmethods often struggle to generalize across diverse document types, leading to\npoor performance, particularly on out-of-distribution data. This issue is\nfurther exacerbated by the limited availability of high-quality training data\nfor layout-aware parsing tasks. To address these challenges, we introduce\nLayoutRL, a reinforcement learning framework that optimizes layout\nunderstanding through composite rewards integrating normalized edit distance,\nparagraph count accuracy, and reading order preservation. To support this\ntraining, we construct the Infinity-Doc-400K dataset, which we use to train\nInfinity-Parser, a vision-language model demonstrating robust generalization\nacross various domains. Extensive evaluations on benchmarks including\nOmniDocBench, olmOCR-Bench, PubTabNet, and FinTabNet show that Infinity-Parser\nconsistently achieves state-of-the-art performance across a broad range of\ndocument types, languages, and structural complexities, substantially\noutperforming both specialized document parsing systems and general-purpose\nvision-language models. We will release our code, dataset, and model to\nfacilitate reproducible research in document parsing."}
{"id": "2510.15306", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15306", "abs": "https://arxiv.org/abs/2510.15306", "authors": ["Kuang-Da Wang", "Zhao Wang", "Yotaro Shimose", "Wei-Yao Wang", "Shingo Takamatsu"], "title": "WebGen-V Bench: Structured Representation for Enhancing Visual Design in LLM-based Web Generation and Evaluation", "comment": null, "summary": "Witnessed by the recent advancements on leveraging LLM for coding and\nmultimodal understanding, we present WebGen-V, a new benchmark and framework\nfor instruction-to-HTML generation that enhances both data quality and\nevaluation granularity. WebGen-V contributes three key innovations: (1) an\nunbounded and extensible agentic crawling framework that continuously collects\nreal-world webpages and can leveraged to augment existing benchmarks; (2) a\nstructured, section-wise data representation that integrates metadata,\nlocalized UI screenshots, and JSON-formatted text and image assets, explicit\nalignment between content, layout, and visual components for detailed\nmultimodal supervision; and (3) a section-level multimodal evaluation protocol\naligning text, layout, and visuals for high-granularity assessment. Experiments\nwith state-of-the-art LLMs and ablation studies validate the effectiveness of\nour structured data and section-wise evaluation, as well as the contribution of\neach component. To the best of our knowledge, WebGen-V is the first work to\nenable high-granularity agentic crawling and evaluation for instruction-to-HTML\ngeneration, providing a unified pipeline from real-world data acquisition and\nwebpage generation to structured multimodal assessment."}
{"id": "2510.15042", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15042", "abs": "https://arxiv.org/abs/2510.15042", "authors": ["Tassilo Wald", "Ibrahim Ethem Hamamci", "Yuan Gao", "Sam Bond-Taylor", "Harshita Sharma", "Maximilian Ilse", "Cynthia Lo", "Olesya Melnichenko", "Noel C. F. Codella", "Maria Teodora Wetscherek", "Klaus H. Maier-Hein", "Panagiotis Korfiatis", "Valentina Salvatelli", "Javier Alvarez-Valle", "Fernando Pérez-García"], "title": "Comprehensive language-image pre-training for 3D medical image understanding", "comment": null, "summary": "Vision-language pre-training, i.e., aligning images with paired text, is a\npowerful paradigm to create encoders that can be directly used for tasks such\nas classification and retrieval, and for downstream tasks such as segmentation\nand report generation. In the 3D medical image domain, these capabilities allow\nvision-language encoders (VLEs) to support radiologists by retrieving patients\nwith similar abnormalities or predicting likelihoods of abnormality. While the\nmethodology holds promise, data availability limits the capabilities of current\n3D VLEs.\n  In this paper, we alleviate the lack of data by injecting additional\ninductive biases: introducing a report generation objective and pairing\nvision-language pre-training with vision-only pre-training. This allows us to\nleverage both image-only and paired image-text 3D datasets, increasing the\ntotal amount of data to which our model is exposed. Through these additional\ninductive biases, paired with best practices of the 3D medical imaging domain,\nwe develop the Comprehensive Language-image Pre-training (COLIPRI) encoder\nfamily. Our COLIPRI encoders achieve state-of-the-art performance in report\ngeneration, classification probing, and zero-shot classification, and remain\ncompetitive for semantic segmentation."}
{"id": "2510.15418", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15418", "abs": "https://arxiv.org/abs/2510.15418", "authors": ["Lee Qi Zun", "Mohamad Zulhilmi Bin Abdul Halim", "Goh Man Fye"], "title": "Fine-Tuning MedGemma for Clinical Captioning to Enhance Multimodal RAG over Malaysia CPGs", "comment": null, "summary": "Retrieval-Augmented Generation systems are essential for providing fact-based\nguidance from Malaysian Clinical Practice Guidelines. However, their\neffectiveness with image-based queries is limited, as general Vision-Language\nModel captions often lack clinical specificity and factual grounding. This\nstudy proposes and validates a framework to specialize the MedGemma model for\ngenerating high-fidelity captions that serve as superior queries. To overcome\ndata scarcity, we employ a knowledge distillation pipeline to create a\nsynthetic dataset across dermatology, fundus, and chest radiography domains,\nand fine-tune MedGemma using the parameter-efficient QLoRA method. Performance\nwas rigorously assessed through a dual framework measuring both classification\naccuracy and, via a novel application of the RAGAS framework, caption\nfaithfulness, relevancy, and correctness. The fine-tuned model demonstrated\nsubstantial improvements in classification performance, while RAGAS evaluation\nconfirmed significant gains in caption faithfulness and correctness, validating\nthe models ability to produce reliable, factually grounded descriptions. This\nwork establishes a robust pipeline for specializing medical VLMs and validates\nthe resulting model as a high-quality query generator, laying the groundwork\nfor enhancing multimodal RAG systems in evidence-based clinical decision\nsupport."}
{"id": "2510.15317", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15317", "abs": "https://arxiv.org/abs/2510.15317", "authors": ["Tingqiao Xu", "Ziru Zeng", "Jiayu Chen"], "title": "VERITAS: Leveraging Vision Priors and Expert Fusion to Improve Multimodal Data", "comment": "Accepted to EMNLP 2025 (Main Conference)", "summary": "The quality of supervised fine-tuning (SFT) data is crucial for the\nperformance of large multimodal models (LMMs), yet current data enhancement\nmethods often suffer from factual errors and hallucinations due to inadequate\nvisual perception. To address this challenge, we propose VERITAS, a pipeline\nthat systematically integrates vision priors and multiple state-of-the-art LMMs\nwith statistical methods to enhance SFT data quality. VERITAS leverages visual\nrecognition models (RAM++) and OCR systems (PP-OCRv4) to extract structured\nvision priors, which are combined with images, questions, and answers. Three\nLMMs (GPT-4o, Gemini-2.5-Pro, Doubao-1.5-pro) evaluate the original answers,\nproviding critique rationales and scores that are statistically fused into a\nhigh-confidence consensus score serving as ground truth. Using this consensus,\nwe train a lightweight critic model via Group Relative Policy Optimization\n(GRPO), enhancing reasoning capabilities efficiently. Each LMM then refines the\noriginal answers based on the critiques, generating new candidate answers; we\nselect the highest-scoring one as the final refined answer. Experiments across\nsix multimodal benchmarks demonstrate that models fine-tuned with data\nprocessed by VERITAS consistently outperform those using raw data, particularly\nin text-rich and fine-grained reasoning tasks. Our critic model exhibits\nenhanced capability comparable to state-of-the-art LMMs while being\nsignificantly more efficient. We release our pipeline, datasets, and model\ncheckpoints to advance research in multimodal data optimization."}
{"id": "2510.15050", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15050", "abs": "https://arxiv.org/abs/2510.15050", "authors": ["Chao Huang", "Zeliang Zhang", "Jiang Liu", "Ximeng Sun", "Jialian Wu", "Xiaodong Yu", "Ze Wang", "Chenliang Xu", "Emad Barsoum", "Zicheng Liu"], "title": "Directional Reasoning Injection for Fine-Tuning MLLMs", "comment": "Project Page: https://wikichao.github.io/DRIFT/", "summary": "Multimodal large language models (MLLMs) are rapidly advancing, yet their\nreasoning ability often lags behind that of strong text-only counterparts.\nExisting methods to bridge this gap rely on supervised fine-tuning over\nlarge-scale multimodal reasoning data or reinforcement learning, both of which\nare resource-intensive. A promising alternative is model merging, which\ninterpolates parameters between reasoning-enhanced LLMs and multimodal\nvariants. However, our analysis shows that naive merging is not always a \"free\nlunch\": its effectiveness varies drastically across model families, with some\n(e.g., LLaVA, Idefics) benefiting while others (e.g., Qwen) suffer performance\ndegradation. To address this, we propose Directional Reasoning Injection for\nFine-Tuning (DRIFT) MLLMs, a lightweight method that transfers reasoning\nknowledge in the gradient space, without destabilizing multimodal alignment.\nDRIFT precomputes a reasoning prior as the parameter-space difference between\nreasoning and multimodal variants, then uses it to bias gradients during\nmultimodal fine-tuning. This approach preserves the simplicity of standard\nsupervised fine-tuning pipelines while enabling efficient reasoning transfer.\nExtensive experiments on multimodal reasoning benchmarks, including MathVista\nand MathVerse, demonstrate that DRIFT consistently improves reasoning\nperformance over naive merging and supervised fine-tuning, while matching or\nsurpassing training-heavy methods at a fraction of the cost."}
{"id": "2510.15421", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15421", "abs": "https://arxiv.org/abs/2510.15421", "authors": ["Hongcheng Liu", "Pingjie Wang", "Yuhao Wang", "Siqu Ou", "Yanfeng Wang", "Yu Wang"], "title": "When Seeing Is not Enough: Revealing the Limits of Active Reasoning in MLLMs", "comment": "20 pages, 13 figures", "summary": "Multimodal large language models (MLLMs) have shown strong capabilities\nacross a broad range of benchmarks. However, most existing evaluations focus on\npassive inference, where models perform step-by-step reasoning under complete\ninformation. This setup is misaligned with real-world use, where seeing is not\nenough. This raises a fundamental question: Can MLLMs actively acquire missing\nevidence under incomplete information? To bridge this gap, we require the MLLMs\nto actively acquire missing evidence and iteratively refine decisions under\nincomplete information, by selecting a target image from a candidate pool\nwithout task-specific priors. To support systematic study, we propose\nGuessBench, a benchmark with both perception-oriented and knowledge-oriented\nimages for evaluating active reasoning in MLLMs. We evaluate 20 superior MLLMs\nand find that performance on active reasoning lags far behind it on passive\nsettings, indicating substantial room for improvement. Further analysis\nidentifies fine-grained perception and timely decision-making as key\nchallenges. Ablation studies show that perceptual enhancements benefit smaller\nmodels, whereas thinking-oriented methods provide consistent gains across model\nsizes. These results suggest promising directions for future research on\nmultimodal active reasoning."}
{"id": "2510.15374", "categories": ["cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15374", "abs": "https://arxiv.org/abs/2510.15374", "authors": ["Zezhong Tan", "Hang Gao", "Xinhong Ma", "Feng Zhang", "Ziqiang Dong"], "title": "Towards Flash Thinking via Decoupled Advantage Policy Optimization", "comment": null, "summary": "Recent Large Reasoning Models (LRMs) have achieved remarkable performance in\nsolving complex problems via supervised fine-tuning (SFT) and reinforcement\nlearning (RL). Although existing RL algorithms significantly enhance model\naccuracy, they still suffer from excessively lengthy responses and overthinking\nissues, resulting in increased inference latency and computational consumption,\nespecially for simple tasks that require minimal reasoning. To address this, we\npropose a novel RL framework, DEPO, to reduce inefficient reasoning for models.\nOur method mainly consists of three core components: (1) an innovative\nadvantage decoupled algorithm to guide model reduction of inefficient tokens;\n(2) a difficulty-aware length penalty to lower the overall length of model\nresponses; (3) an advantage clipping method to prevent bias in policy\noptimization. In our experiments, applied to DeepSeek-Distill-Qwen-7B and\nDeepSeek-Distill-Qwen-1.5B as base models, DEPO achieves a significant\nreduction in sequence length by 39% and reduces excessive reasoning paths in\ninefficient tokens, while outperforming the base model in overall accuracy."}
{"id": "2510.15104", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15104", "abs": "https://arxiv.org/abs/2510.15104", "authors": ["Guofeng Zhang", "Angtian Wang", "Jacob Zhiyuan Fang", "Liming Jiang", "Haotian Yang", "Bo Liu", "Yiding Yang", "Guang Chen", "Longyin Wen", "Alan Yuille", "Chongyang Ma"], "title": "TGT: Text-Grounded Trajectories for Locally Controlled Video Generation", "comment": null, "summary": "Text-to-video generation has advanced rapidly in visual fidelity, whereas\nstandard methods still have limited ability to control the subject composition\nof generated scenes. Prior work shows that adding localized text control\nsignals, such as bounding boxes or segmentation masks, can help. However, these\nmethods struggle in complex scenarios and degrade in multi-object settings,\noffering limited precision and lacking a clear correspondence between\nindividual trajectories and visual entities as the number of controllable\nobjects increases. We introduce Text-Grounded Trajectories (TGT), a framework\nthat conditions video generation on trajectories paired with localized text\ndescriptions. We propose Location-Aware Cross-Attention (LACA) to integrate\nthese signals and adopt a dual-CFG scheme to separately modulate local and\nglobal text guidance. In addition, we develop a data processing pipeline that\nproduces trajectories with localized descriptions of tracked entities, and we\nannotate two million high quality video clips to train TGT. Together, these\ncomponents enable TGT to use point trajectories as intuitive motion handles,\npairing each trajectory with text to control both appearance and motion.\nExtensive experiments show that TGT achieves higher visual quality, more\naccurate text alignment, and improved motion controllability compared with\nprior approaches. Website: https://textgroundedtraj.github.io."}
{"id": "2510.15543", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.15543", "abs": "https://arxiv.org/abs/2510.15543", "authors": ["Qiyu Wu", "Shuyang Cui", "Satoshi Hayakawa", "Wei-Yao Wang", "Hiromi Wakaki", "Yuki Mitsufuji"], "title": "MCA: Modality Composition Awareness for Robust Composed Multimodal Retrieval", "comment": null, "summary": "Multimodal retrieval, which seeks to retrieve relevant content across\nmodalities such as text or image, supports applications from AI search to\ncontents production. Despite the success of separate-encoder approaches like\nCLIP align modality-specific embeddings with contrastive learning, recent\nmultimodal large language models (MLLMs) enable a unified encoder that directly\nprocesses composed inputs. While flexible and advanced, we identify that\nunified encoders trained with conventional contrastive learning are prone to\nlearn modality shortcut, leading to poor robustness under distribution shifts.\nWe propose a modality composition awareness framework to mitigate this issue.\nConcretely, a preference loss enforces multimodal embeddings to outperform\ntheir unimodal counterparts, while a composition regularization objective\naligns multimodal embeddings with prototypes composed from its unimodal parts.\nThese objectives explicitly model structural relationships between the composed\nrepresentation and its unimodal counterparts. Experiments on various benchmarks\nshow gains in out-of-distribution retrieval, highlighting modality composition\nawareness as a effective principle for robust composed multimodal retrieval\nwhen utilizing MLLMs as the unified encoder."}
{"id": "2510.15547", "categories": ["cs.AI", "cs.ET", "cs.LG", "cs.SY", "eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2510.15547", "abs": "https://arxiv.org/abs/2510.15547", "authors": ["Usman Ali", "Ali Zia", "Waqas Ali", "Umer Ramzan", "Abdul Rehman", "Muhammad Tayyab Chaudhry", "Wei Xiang"], "title": "Hypergraph Contrastive Sensor Fusion for Multimodal Fault Diagnosis in Induction Motors", "comment": "Submitted to IEEE Sensors Journal", "summary": "Reliable induction motor (IM) fault diagnosis is vital for industrial safety\nand operational continuity, mitigating costly unplanned downtime. Conventional\napproaches often struggle to capture complex multimodal signal relationships,\nare constrained to unimodal data or single fault types, and exhibit performance\ndegradation under noisy or cross-domain conditions. This paper proposes the\nMultimodal Hypergraph Contrastive Attention Network (MM-HCAN), a unified\nframework for robust fault diagnosis. To the best of our knowledge, MM-HCAN is\nthe first to integrate contrastive learning within a hypergraph topology\nspecifically designed for multimodal sensor fusion, enabling the joint\nmodelling of intra- and inter-modal dependencies and enhancing generalisation\nbeyond Euclidean embedding spaces. The model facilitates simultaneous diagnosis\nof bearing, stator, and rotor faults, addressing the engineering need for\nconsolidated di- agnostic capabilities. Evaluated on three real-world\nbenchmarks, MM-HCAN achieves up to 99.82% accuracy with strong cross-domain\ngeneralisation and resilience to noise, demonstrating its suitability for\nreal-world deployment. An ablation study validates the contribution of each\ncomponent. MM-HCAN provides a scalable and robust solution for comprehensive\nmulti-fault diagnosis, supporting predictive maintenance and extended asset\nlongevity in industrial environments."}
{"id": "2510.15148", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15148", "abs": "https://arxiv.org/abs/2510.15148", "authors": ["Xingrui Wang", "Jiang Liu", "Chao Huang", "Xiaodong Yu", "Ze Wang", "Ximeng Sun", "Jialian Wu", "Alan Yuille", "Emad Barsoum", "Zicheng Liu"], "title": "XModBench: Benchmarking Cross-Modal Capabilities and Consistency in Omni-Language Models", "comment": null, "summary": "Omni-modal large language models (OLLMs) aim to unify audio, vision, and text\nunderstanding within a single framework. While existing benchmarks primarily\nevaluate general cross-modal question-answering ability, it remains unclear\nwhether OLLMs achieve modality-invariant reasoning or exhibit modality-specific\nbiases. We introduce XModBench, a large-scale tri-modal benchmark explicitly\ndesigned to measure cross-modal consistency. XModBench comprises 60,828\nmultiple-choice questions spanning five task families and systematically covers\nall six modality compositions in question-answer pairs, enabling fine-grained\ndiagnosis of an OLLM's modality-invariant reasoning, modality disparity, and\ndirectional imbalance. Experiments show that even the strongest model, Gemini\n2.5 Pro, (i) struggles with spatial and temporal reasoning, achieving less than\n60% accuracy, (ii) reveals persistent modality disparities, with performance\ndropping substantially when the same semantic content is conveyed through audio\nrather than text, and (iii) shows systematic directional imbalance, exhibiting\nlower consistency when vision serves as context compared to text. These\nfindings indicate that current OLLMs remain far from truly modality-invariant\nreasoning and position XModBench as a fundamental diagnostic tool for\nevaluating and improving cross-modal competence. All data and evaluation tools\nwill be available at https://xingruiwang.github.io/projects/XModBench/."}
{"id": "2510.15685", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15685", "abs": "https://arxiv.org/abs/2510.15685", "authors": ["Joshua Wolfe Brook", "Ilia Markov"], "title": "Leveraging LLMs for Context-Aware Implicit Textual and Multimodal Hate Speech Detection", "comment": "8 pages, 9 figures, submitted to LREC 2026", "summary": "This research introduces a novel approach to textual and multimodal Hate\nSpeech Detection (HSD), using Large Language Models (LLMs) as dynamic knowledge\nbases to generate background context and incorporate it into the input of HSD\nclassifiers. Two context generation strategies are examined: one focused on\nnamed entities and the other on full-text prompting. Four methods of\nincorporating context into the classifier input are compared: text\nconcatenation, embedding concatenation, a hierarchical transformer-based\nfusion, and LLM-driven text enhancement. Experiments are conducted on the\ntextual Latent Hatred dataset of implicit hate speech and applied in a\nmultimodal setting on the MAMI dataset of misogynous memes. Results suggest\nthat both the contextual information and the method by which it is incorporated\nare key, with gains of up to 3 and 6 F1 points on textual and multimodal setups\nrespectively, from a zero-context baseline to the highest-performing system,\nbased on embedding concatenation."}
{"id": "2510.15748", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15748", "abs": "https://arxiv.org/abs/2510.15748", "authors": ["Minlin Zeng", "Zhipeng Zhou", "Yang Qiu", "Zhiqi Shen"], "title": "Towards Relaxed Multimodal Inputs for Gait-based Parkinson's Disease Assessment", "comment": null, "summary": "Parkinson's disease assessment has garnered growing interest in recent years,\nparticularly with the advent of sensor data and machine learning techniques.\nAmong these, multimodal approaches have demonstrated strong performance by\neffectively integrating complementary information from various data sources.\nHowever, two major limitations hinder their practical application: (1) the need\nto synchronize all modalities during training, and (2) the dependence on all\nmodalities during inference. To address these issues, we propose the first\nParkinson's assessment system that formulates multimodal learning as a\nmulti-objective optimization (MOO) problem. This not only allows for more\nflexible modality requirements during both training and inference, but also\nhandles modality collapse issue during multimodal information fusion. In\naddition, to mitigate the imbalance within individual modalities, we introduce\na margin-based class rebalancing strategy to enhance category learning. We\nconduct extensive experiments on three public datasets under both synchronous\nand asynchronous settings. The results show that our framework-Towards Relaxed\nInPuts (TRIP)-achieves state-of-the-art performance, outperforming the best\nbaselines by 16.48, 6.89, and 11.55 percentage points in the asynchronous\nsetting, and by 4.86 and 2.30 percentage points in the synchronous setting,\nhighlighting its effectiveness and adaptability."}
{"id": "2510.15162", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15162", "abs": "https://arxiv.org/abs/2510.15162", "authors": ["Weizhi Wang", "Rongmei Lin", "Shiyang Li", "Colin Lockard", "Ritesh Sarkhel", "Sanket Lokegaonkar", "Jingbo Shang", "Xifeng Yan", "Nasser Zalmout", "Xian Li"], "title": "Train a Unified Multimodal Data Quality Classifier with Synthetic Data", "comment": "EMNLP 2025 Findings", "summary": "The Multimodal Large Language Models (MLLMs) are continually pre-trained on a\nmixture of image-text caption data and interleaved document data, while the\nhigh-quality data filtering towards image-text interleaved document data is\nunder-explored. We propose to train an efficient MLLM as a Unified Mulitmodal\nData Quality Classifier to Filter both high-quality image-text caption and\ninterleaved data (UniFilter). To address the challenge of collecting diverse\nlabeled multimodal data, we introduce a semi-synthetic approach that leverages\nreadily available raw images and generates corresponding text across four\nquality levels. This method enables efficient creation of sample-score pairs\nfor both caption and interleaved document data to train UniFilter. We apply\nUniFilter to curate high-quality caption data from DataComp caption dataset and\ninterleaved data from the OBELICS image-text interleaved dataset. MLLMs\npre-trained on the filtered data demonstrate significantly enhanced\ncapabilities compared to those trained on baseline-filtered data, achieving\nstronger zero-shot reasoning and in-context learning capabilities. After visual\nsupervised fine-tuning, these UniFilter-induced MLLMs achieve stronger\nperformance on various benchmarks, highlighting the downstream benefits of\nhigh-quality multimodal pre-training. We release the synthetic training data\nused for training UniFilter, the UniFilter model checkpoints, and the\nhigh-quality interleaved document subset OBELICS-HQ, curated by UniFilter, to\nthe community for reproduction and further development."}
{"id": "2510.15851", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15851", "abs": "https://arxiv.org/abs/2510.15851", "authors": ["Kadri Hacioglu", "Manjunath K E", "Andreas Stolcke"], "title": "SpeechLLMs for Large-scale Contextualized Zero-shot Slot Filling", "comment": "13 pages, EMNLP 2025", "summary": "Slot filling is a crucial subtask in spoken language understanding (SLU),\ntraditionally implemented as a cascade of speech recognition followed by one or\nmore natural language understanding (NLU) components. The recent advent of\nspeech-based large language models (speechLLMs), which integrate speech and\ntextual foundation models, has opened new avenues for achieving speech\nunderstanding tasks in a more unified, generative, and instruction-following\nmanner while promising data and compute efficiency with zero-shot abilities,\ngeneralizing to unseen slot labels. We address the slot-filling task by\ncreating an empirical upper bound for the task, identifying performance,\nrobustness, and generalization gaps, and proposing improvements to the training\ndata, architecture, and training strategies to narrow the gap with the upper\nbound result. We show that each of these measures improve performance\nsubstantially, while highlighting practical challenges and providing empirical\nguidance and insights for harnessing these emerging models."}
{"id": "2502.08636", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2502.08636", "abs": "https://arxiv.org/abs/2502.08636", "authors": ["Xingrui Wang", "Wufei Ma", "Tiezheng Zhang", "Celso M de Melo", "Jieneng Chen", "Alan Yuille"], "title": "Spatial457: A Diagnostic Benchmark for 6D Spatial Reasoning of Large Multimodal Models", "comment": "Published in CVPR 2025 as Highlight. Data and code are released at\n  https://github.com/XingruiWang/Spatial457", "summary": "Although large multimodal models (LMMs) have demonstrated remarkable\ncapabilities in visual scene interpretation and reasoning, their capacity for\ncomplex and precise 3-dimensional spatial reasoning remains uncertain. Existing\nbenchmarks focus predominantly on 2D spatial understanding and lack a framework\nto comprehensively evaluate 6D spatial reasoning across varying complexities.\nTo address this limitation, we present Spatial457, a scalable and unbiased\nsynthetic dataset designed with 4 key capability for spatial reasoning:\nmulti-object recognition, 2D location, 3D location, and 3D orientation. We\ndevelop a cascading evaluation structure, constructing 7 question types across\n5 difficulty levels that range from basic single object recognition to our new\nproposed complex 6D spatial reasoning tasks. We evaluated various large\nmultimodal models (LMMs) on PulseCheck457, observing a general decline in\nperformance as task complexity increases, particularly in 3D reasoning and 6D\nspatial tasks. To quantify these challenges, we introduce the Relative\nPerformance Dropping Rate (RPDR), highlighting key weaknesses in 3D reasoning\ncapabilities. Leveraging the unbiased attribute design of our dataset, we also\nuncover prediction biases across different attributes, with similar patterns\nobserved in real-world image settings. The code and data are released in\nhttps://github.com/XingruiWang/Spatial457."}
{"id": "2510.15164", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15164", "abs": "https://arxiv.org/abs/2510.15164", "authors": ["Usman Afzaal", "Ziyu Su", "Usama Sajjad", "Hao Lu", "Mostafa Rezapour", "Metin Nafi Gurcan", "Muhammad Khalid Khan Niazi"], "title": "Hyperparameter Optimization and Reproducibility in Deep Learning Model Training", "comment": null, "summary": "Reproducibility remains a critical challenge in foundation model training for\nhistopathology, often hindered by software randomness, hardware\nnon-determinism, and inconsistent hyperparameter reporting. To investigate\nthese issues, we trained a CLIP model on the QUILT-1M dataset and\nsystematically evaluated the impact of different hyperparameter settings and\naugmentation strategies across three downstream histopathology datasets\n(PatchCamelyon, LC25000-Lung, and LC25000-Colon). Despite variability across\nruns, we identified clear trends: RandomResizedCrop values of 0.7-0.8\noutperformed more aggressive (0.6) or conservative (0.9) settings, distributed\ntraining without local loss improved stability, and learning rates below 5.0e-5\nconsistently degraded performance across all datasets. The LC25000 (Colon)\ndataset consistently provided the most reproducible benchmark. These findings\nhighlight that reproducibility in computational pathology depends not only on\ntransparent documentation but also on carefully chosen experimental\nconfigurations, and we provide practical rules to guide future efforts in\ndeveloping reproducible foundation models for digital pathology."}
{"id": "2502.17092", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2502.17092", "abs": "https://arxiv.org/abs/2502.17092", "authors": ["Syed Abdul Gaffar Shakhadri", "Kruthika KR", "Kartik Basavaraj Angadi"], "title": "Shakti-VLMs: Scalable Vision-Language Models for Enterprise AI", "comment": null, "summary": "We introduce Shakti VLM, a family of vision-language models in the capacity\nof 1B and 4B parameters designed to address data efficiency challenges in\nmultimodal learning. While recent VLMs achieve strong performance through\nextensive training data, Shakti models leverage architectural innovations to\nattain competitive results with fewer tokens. Key advancements include\nQK-Normalization for attention stability, hybrid normalization techniques, and\nenhanced positional encoding. A three-stage training strategy further optimizes\nlearning efficiency. Evaluations show that Shakti-Shakti-VLM-1B and\nShakti-VLM-4B excel in document understanding, Visual Reasoning, OCR\nextraction, and general multimodal reasoning. Our results highlight that high\nperformance can be achieved through model design and training strategy rather\nthan sheer data volume, making Shakti an efficient solution for\nenterprise-scale multimodal tasks."}
{"id": "2510.15208", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15208", "abs": "https://arxiv.org/abs/2510.15208", "authors": ["Daniela Vega", "Hannah V. Ceballos", "Javier S. Vera", "Santiago Rodriguez", "Alejandra Perez", "Angela Castillo", "Maria Escobar", "Dario Londoño", "Luis A. Sarmiento", "Camila I. Castro", "Nadiezhda Rodriguez", "Juan C. Briceño", "Pablo Arbeláez"], "title": "CARDIUM: Congenital Anomaly Recognition with Diagnostic Images and Unified Medical records", "comment": "Accepted to CVAMD Workshop, ICCV 2025", "summary": "Prenatal diagnosis of Congenital Heart Diseases (CHDs) holds great potential\nfor Artificial Intelligence (AI)-driven solutions. However, collecting\nhigh-quality diagnostic data remains difficult due to the rarity of these\nconditions, resulting in imbalanced and low-quality datasets that hinder model\nperformance. Moreover, no public efforts have been made to integrate multiple\nsources of information, such as imaging and clinical data, further limiting the\nability of AI models to support and enhance clinical decision-making. To\novercome these challenges, we introduce the Congenital Anomaly Recognition with\nDiagnostic Images and Unified Medical records (CARDIUM) dataset, the first\npublicly available multimodal dataset consolidating fetal ultrasound and\nechocardiographic images along with maternal clinical records for prenatal CHD\ndetection. Furthermore, we propose a robust multimodal transformer architecture\nthat incorporates a cross-attention mechanism to fuse feature representations\nfrom image and tabular data, improving CHD detection by 11% and 50% over image\nand tabular single-modality approaches, respectively, and achieving an F1 score\nof 79.8 $\\pm$ 4.8% in the CARDIUM dataset. We will publicly release our dataset\nand code to encourage further research on this unexplored field. Our dataset\nand code are available at https://github.com/BCVUniandes/Cardium, and at the\nproject website https://bcv-uniandes.github.io/CardiumPage/"}
{"id": "2510.15015", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15015", "abs": "https://arxiv.org/abs/2510.15015", "authors": ["Mor Ventura", "Michael Toker", "Or Patashnik", "Yonatan Belinkov", "Roi Reichart"], "title": "DeLeaker: Dynamic Inference-Time Reweighting For Semantic Leakage Mitigation in Text-to-Image Models", "comment": null, "summary": "Text-to-Image (T2I) models have advanced rapidly, yet they remain vulnerable\nto semantic leakage, the unintended transfer of semantically related features\nbetween distinct entities. Existing mitigation strategies are often\noptimization-based or dependent on external inputs. We introduce DeLeaker, a\nlightweight, optimization-free inference-time approach that mitigates leakage\nby directly intervening on the model's attention maps. Throughout the diffusion\nprocess, DeLeaker dynamically reweights attention maps to suppress excessive\ncross-entity interactions while strengthening the identity of each entity. To\nsupport systematic evaluation, we introduce SLIM (Semantic Leakage in IMages),\nthe first dataset dedicated to semantic leakage, comprising 1,130\nhuman-verified samples spanning diverse scenarios, together with a novel\nautomatic evaluation framework. Experiments demonstrate that DeLeaker\nconsistently outperforms all baselines, even when they are provided with\nexternal information, achieving effective leakage mitigation without\ncompromising fidelity or quality. These results underscore the value of\nattention control and pave the way for more semantically precise T2I models."}
{"id": "2510.14992", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.14992", "abs": "https://arxiv.org/abs/2510.14992", "authors": ["Leela Krishna", "Mengyang Zhao", "Saicharithreddy Pasula", "Harshit Rajgarhia", "Abhishek Mukherji"], "title": "GAZE:Governance-Aware pre-annotation for Zero-shot World Model Environments", "comment": null, "summary": "Training robust world models requires large-scale, precisely labeled\nmultimodal datasets, a process historically bottlenecked by slow and expensive\nmanual annotation. We present a production-tested GAZE pipeline that automates\nthe conversion of raw, long-form video into rich, task-ready supervision for\nworld-model training. Our system (i) normalizes proprietary 360-degree formats\ninto standard views and shards them for parallel processing; (ii) applies a\nsuite of AI models (scene understanding, object tracking, audio transcription,\nPII/NSFW/minor detection) for dense, multimodal pre-annotation; and (iii)\nconsolidates signals into a structured output specification for rapid human\nvalidation.\n  The GAZE workflow demonstrably yields efficiency gains (~19 minutes saved per\nreview hour) and reduces human review volume by >80% through conservative\nauto-skipping of low-salience segments. By increasing label density and\nconsistency while integrating privacy safeguards and chain-of-custody metadata,\nour method generates high-fidelity, privacy-aware datasets directly consumable\nfor learning cross-modal dynamics and action-conditioned prediction. We detail\nour orchestration, model choices, and data dictionary to provide a scalable\nblueprint for generating high-quality world model training data without\nsacrificing throughput or governance."}
{"id": "2510.15240", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15240", "abs": "https://arxiv.org/abs/2510.15240", "authors": ["Aysan Aghazadeh", "Adriana Kovashka"], "title": "The Face of Persuasion: Analyzing Bias and Generating Culture-Aware Ads", "comment": null, "summary": "Text-to-image models are appealing for customizing visual advertisements and\ntargeting specific populations. We investigate this potential by examining the\ndemographic bias within ads for different ad topics, and the disparate level of\npersuasiveness (judged by models) of ads that are identical except for\ngender/race of the people portrayed. We also experiment with a technique to\ntarget ads for specific countries. The code is available at\nhttps://github.com/aysanaghazadeh/FaceOfPersuasion"}
{"id": "2510.15040", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15040", "abs": "https://arxiv.org/abs/2510.15040", "authors": ["Xinyi Gu", "Jiayuan Mao", "Zhang-Wei Hong", "Zhuoran Yu", "Pengyuan Li", "Dhiraj Joshi", "Rogerio Feris", "Zexue He"], "title": "Composition-Grounded Instruction Synthesis for Visual Reasoning", "comment": null, "summary": "Pretrained multi-modal large language models (MLLMs) demonstrate strong\nperformance on diverse multimodal tasks, but remain limited in reasoning\ncapabilities for domains where annotations are difficult to collect. In this\nwork, we focus on artificial image domains such as charts, rendered documents,\nand webpages, which are abundant in practice yet lack large-scale human\nannotated reasoning datasets. We introduce COGS (COmposition-Grounded\ninstruction Synthesis), a data-efficient framework for equipping MLLMs with\nadvanced reasoning abilities from a small set of seed questions. The key idea\nis to decompose each seed question into primitive perception and reasoning\nfactors, which can then be systematically recomposed with new images to\ngenerate large collections of synthetic question-answer pairs. Each generated\nquestion is paired with subquestions and intermediate answers, enabling\nreinforcement learning with factor-level process rewards. Experiments on chart\nreasoning show that COGS substantially improves performance on unseen\nquestions, with the largest gains on reasoning-heavy and compositional\nquestions. Moreover, training with a factor-level mixture of different seed\ndata yields better transfer across multiple datasets, suggesting that COGS\ninduces generalizable capabilities rather than dataset-specific overfitting. We\nfurther demonstrate that the framework extends beyond charts to other domains\nsuch as webpages."}
{"id": "2510.15015", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15015", "abs": "https://arxiv.org/abs/2510.15015", "authors": ["Mor Ventura", "Michael Toker", "Or Patashnik", "Yonatan Belinkov", "Roi Reichart"], "title": "DeLeaker: Dynamic Inference-Time Reweighting For Semantic Leakage Mitigation in Text-to-Image Models", "comment": null, "summary": "Text-to-Image (T2I) models have advanced rapidly, yet they remain vulnerable\nto semantic leakage, the unintended transfer of semantically related features\nbetween distinct entities. Existing mitigation strategies are often\noptimization-based or dependent on external inputs. We introduce DeLeaker, a\nlightweight, optimization-free inference-time approach that mitigates leakage\nby directly intervening on the model's attention maps. Throughout the diffusion\nprocess, DeLeaker dynamically reweights attention maps to suppress excessive\ncross-entity interactions while strengthening the identity of each entity. To\nsupport systematic evaluation, we introduce SLIM (Semantic Leakage in IMages),\nthe first dataset dedicated to semantic leakage, comprising 1,130\nhuman-verified samples spanning diverse scenarios, together with a novel\nautomatic evaluation framework. Experiments demonstrate that DeLeaker\nconsistently outperforms all baselines, even when they are provided with\nexternal information, achieving effective leakage mitigation without\ncompromising fidelity or quality. These results underscore the value of\nattention control and pave the way for more semantically precise T2I models."}
{"id": "2510.15264", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15264", "abs": "https://arxiv.org/abs/2510.15264", "authors": ["Weijie Wang", "Jiagang Zhu", "Zeyu Zhang", "Xiaofeng Wang", "Zheng Zhu", "Guosheng Zhao", "Chaojun Ni", "Haoxiao Wang", "Guan Huang", "Xinze Chen", "Yukun Zhou", "Wenkang Qin", "Duochao Shi", "Haoyun Li", "Guanghong Jia", "Jiwen Lu"], "title": "DriveGen3D: Boosting Feed-Forward Driving Scene Generation with Efficient Video Diffusion", "comment": "Accepted by NeurIPS Workshop on Next Practices in Video Generation\n  and Evaluation (Short Paper Track)", "summary": "We present DriveGen3D, a novel framework for generating high-quality and\nhighly controllable dynamic 3D driving scenes that addresses critical\nlimitations in existing methodologies. Current approaches to driving scene\nsynthesis either suffer from prohibitive computational demands for extended\ntemporal generation, focus exclusively on prolonged video synthesis without 3D\nrepresentation, or restrict themselves to static single-scene reconstruction.\nOur work bridges this methodological gap by integrating accelerated long-term\nvideo generation with large-scale dynamic scene reconstruction through\nmultimodal conditional control. DriveGen3D introduces a unified pipeline\nconsisting of two specialized components: FastDrive-DiT, an efficient video\ndiffusion transformer for high-resolution, temporally coherent video synthesis\nunder text and Bird's-Eye-View (BEV) layout guidance; and FastRecon3D, a\nfeed-forward reconstruction module that rapidly builds 3D Gaussian\nrepresentations across time, ensuring spatial-temporal consistency. Together,\nthese components enable real-time generation of extended driving videos (up to\n$424\\times800$ at 12 FPS) and corresponding dynamic 3D scenes, achieving SSIM\nof 0.811 and PSNR of 22.84 on novel view synthesis, all while maintaining\nparameter efficiency."}
{"id": "2510.15162", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15162", "abs": "https://arxiv.org/abs/2510.15162", "authors": ["Weizhi Wang", "Rongmei Lin", "Shiyang Li", "Colin Lockard", "Ritesh Sarkhel", "Sanket Lokegaonkar", "Jingbo Shang", "Xifeng Yan", "Nasser Zalmout", "Xian Li"], "title": "Train a Unified Multimodal Data Quality Classifier with Synthetic Data", "comment": "EMNLP 2025 Findings", "summary": "The Multimodal Large Language Models (MLLMs) are continually pre-trained on a\nmixture of image-text caption data and interleaved document data, while the\nhigh-quality data filtering towards image-text interleaved document data is\nunder-explored. We propose to train an efficient MLLM as a Unified Mulitmodal\nData Quality Classifier to Filter both high-quality image-text caption and\ninterleaved data (UniFilter). To address the challenge of collecting diverse\nlabeled multimodal data, we introduce a semi-synthetic approach that leverages\nreadily available raw images and generates corresponding text across four\nquality levels. This method enables efficient creation of sample-score pairs\nfor both caption and interleaved document data to train UniFilter. We apply\nUniFilter to curate high-quality caption data from DataComp caption dataset and\ninterleaved data from the OBELICS image-text interleaved dataset. MLLMs\npre-trained on the filtered data demonstrate significantly enhanced\ncapabilities compared to those trained on baseline-filtered data, achieving\nstronger zero-shot reasoning and in-context learning capabilities. After visual\nsupervised fine-tuning, these UniFilter-induced MLLMs achieve stronger\nperformance on various benchmarks, highlighting the downstream benefits of\nhigh-quality multimodal pre-training. We release the synthetic training data\nused for training UniFilter, the UniFilter model checkpoints, and the\nhigh-quality interleaved document subset OBELICS-HQ, curated by UniFilter, to\nthe community for reproduction and further development."}
{"id": "2510.15018", "categories": ["cs.CV", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.15018", "abs": "https://arxiv.org/abs/2510.15018", "authors": ["Mingxuan Liu", "Honglin He", "Elisa Ricci", "Wayne Wu", "Bolei Zhou"], "title": "UrbanVerse: Scaling Urban Simulation by Watching City-Tour Videos", "comment": "Technical report. Project page: https://urbanverseproject.github.io/", "summary": "Urban embodied AI agents, ranging from delivery robots to quadrupeds, are\nincreasingly populating our cities, navigating chaotic streets to provide\nlast-mile connectivity. Training such agents requires diverse, high-fidelity\nurban environments to scale, yet existing human-crafted or procedurally\ngenerated simulation scenes either lack scalability or fail to capture\nreal-world complexity. We introduce UrbanVerse, a data-driven real-to-sim\nsystem that converts crowd-sourced city-tour videos into physics-aware,\ninteractive simulation scenes. UrbanVerse consists of: (i) UrbanVerse-100K, a\nrepository of 100k+ annotated urban 3D assets with semantic and physical\nattributes, and (ii) UrbanVerse-Gen, an automatic pipeline that extracts scene\nlayouts from video and instantiates metric-scale 3D simulations using retrieved\nassets. Running in IsaacSim, UrbanVerse offers 160 high-quality constructed\nscenes from 24 countries, along with a curated benchmark of 10 artist-designed\ntest scenes. Experiments show that UrbanVerse scenes preserve real-world\nsemantics and layouts, achieving human-evaluated realism comparable to manually\ncrafted scenes. In urban navigation, policies trained in UrbanVerse exhibit\nscaling power laws and strong generalization, improving success by +6.3% in\nsimulation and +30.1% in zero-shot sim-to-real transfer comparing to prior\nmethods, accomplishing a 300 m real-world mission with only two interventions."}
{"id": "2510.15430", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15430", "abs": "https://arxiv.org/abs/2510.15430", "authors": ["Shuang Liang", "Zhihao Xu", "Jialing Tao", "Hui Xue", "Xiting Wang"], "title": "Learning to Detect Unknown Jailbreak Attacks in Large Vision-Language Models", "comment": null, "summary": "Despite extensive alignment efforts, Large Vision-Language Models (LVLMs)\nremain vulnerable to jailbreak attacks, posing serious safety risks. To address\nthis, existing detection methods either learn attack-specific parameters, which\nhinders generalization to unseen attacks, or rely on heuristically sound\nprinciples, which limit accuracy and efficiency. To overcome these limitations,\nwe propose Learning to Detect (LoD), a general framework that accurately\ndetects unknown jailbreak attacks by shifting the focus from attack-specific\nlearning to task-specific learning. This framework includes a Multi-modal\nSafety Concept Activation Vector module for safety-oriented representation\nlearning and a Safety Pattern Auto-Encoder module for unsupervised attack\nclassification. Extensive experiments show that our method achieves\nconsistently higher detection AUROC on diverse unknown attacks while improving\nefficiency. The code is available at\nhttps://anonymous.4open.science/r/Learning-to-Detect-51CB."}
{"id": "2510.15870", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15870", "abs": "https://arxiv.org/abs/2510.15870", "authors": ["Hanrong Ye", "Chao-Han Huck Yang", "Arushi Goel", "Wei Huang", "Ligeng Zhu", "Yuanhang Su", "Sean Lin", "An-Chieh Cheng", "Zhen Wan", "Jinchuan Tian", "Yuming Lou", "Dong Yang", "Zhijian Liu", "Yukang Chen", "Ambrish Dantrey", "Ehsan Jahangiri", "Sreyan Ghosh", "Daguang Xu", "Ehsan Hosseini-Asl", "Danial Mohseni Taheri", "Vidya Murali", "Sifei Liu", "Jason Lu", "Oluwatobi Olabiyi", "Frank Wang", "Rafael Valle", "Bryan Catanzaro", "Andrew Tao", "Song Han", "Jan Kautz", "Hongxu Yin", "Pavlo Molchanov"], "title": "OmniVinci: Enhancing Architecture and Data for Omni-Modal Understanding LLM", "comment": "Technical Report. Code: https://github.com/NVlabs/OmniVinci", "summary": "Advancing machine intelligence requires developing the ability to perceive\nacross multiple modalities, much as humans sense the world. We introduce\nOmniVinci, an initiative to build a strong, open-source, omni-modal LLM. We\ncarefully study the design choices across model architecture and data curation.\nFor model architecture, we present three key innovations: (i) OmniAlignNet for\nstrengthening alignment between vision and audio embeddings in a shared\nomni-modal latent space; (ii) Temporal Embedding Grouping for capturing\nrelative temporal alignment between vision and audio signals; and (iii)\nConstrained Rotary Time Embedding for encoding absolute temporal information in\nomni-modal embeddings. We introduce a curation and synthesis pipeline that\ngenerates 24M single-modal and omni-modal conversations. We find that\nmodalities reinforce one another in both perception and reasoning. Our model,\nOmniVinci, outperforms Qwen2.5-Omni with +19.05 on DailyOmni (cross-modal\nunderstanding), +1.7 on MMAR (audio), and +3.9 on Video-MME (vision), while\nusing just 0.2T training tokens - a 6 times reduction compared to\nQwen2.5-Omni's 1.2T. We finally demonstrate omni-modal advantages in downstream\napplications spanning robotics, medical AI, and smart factory."}
{"id": "2510.15148", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15148", "abs": "https://arxiv.org/abs/2510.15148", "authors": ["Xingrui Wang", "Jiang Liu", "Chao Huang", "Xiaodong Yu", "Ze Wang", "Ximeng Sun", "Jialian Wu", "Alan Yuille", "Emad Barsoum", "Zicheng Liu"], "title": "XModBench: Benchmarking Cross-Modal Capabilities and Consistency in Omni-Language Models", "comment": null, "summary": "Omni-modal large language models (OLLMs) aim to unify audio, vision, and text\nunderstanding within a single framework. While existing benchmarks primarily\nevaluate general cross-modal question-answering ability, it remains unclear\nwhether OLLMs achieve modality-invariant reasoning or exhibit modality-specific\nbiases. We introduce XModBench, a large-scale tri-modal benchmark explicitly\ndesigned to measure cross-modal consistency. XModBench comprises 60,828\nmultiple-choice questions spanning five task families and systematically covers\nall six modality compositions in question-answer pairs, enabling fine-grained\ndiagnosis of an OLLM's modality-invariant reasoning, modality disparity, and\ndirectional imbalance. Experiments show that even the strongest model, Gemini\n2.5 Pro, (i) struggles with spatial and temporal reasoning, achieving less than\n60% accuracy, (ii) reveals persistent modality disparities, with performance\ndropping substantially when the same semantic content is conveyed through audio\nrather than text, and (iii) shows systematic directional imbalance, exhibiting\nlower consistency when vision serves as context compared to text. These\nfindings indicate that current OLLMs remain far from truly modality-invariant\nreasoning and position XModBench as a fundamental diagnostic tool for\nevaluating and improving cross-modal competence. All data and evaluation tools\nwill be available at https://xingruiwang.github.io/projects/XModBench/."}
{"id": "2510.15434", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15434", "abs": "https://arxiv.org/abs/2510.15434", "authors": ["Huan Chen", "Ting Han", "Siyu Chen", "Zhihao Guo", "Yiping Chen", "Meiliu Wu"], "title": "Semantic4Safety: Causal Insights from Zero-shot Street View Imagery Segmentation for Urban Road Safety", "comment": "11 pages, 10 figures, The 8th ACM SIGSPATIAL International Workshop\n  on AI for Geographic Knowledge Discovery (GeoAI '25), November 3--6, 2025,\n  Minneapolis, MN, USA", "summary": "Street-view imagery (SVI) offers a fine-grained lens on traffic risk, yet two\nfundamental challenges persist: (1) how to construct street-level indicators\nthat capture accident-related features, and (2) how to quantify their causal\nimpacts across different accident types. To address these challenges, we\npropose Semantic4Safety, a framework that applies zero-shot semantic\nsegmentation to SVIs to derive 11 interpretable streetscape indicators, and\nintegrates road type as contextual information to analyze approximately 30,000\naccident records in Austin. Specifically, we train an eXtreme Gradient Boosting\n(XGBoost) multi-class classifier and use Shapley Additive Explanations (SHAP)\nto interpret both global and local feature contributions, and then apply\nGeneralized Propensity Score (GPS) weighting and Average Treatment Effect (ATE)\nestimation to control confounding and quantify causal effects. Results uncover\nheterogeneous, accident-type-specific causal patterns: features capturing scene\ncomplexity, exposure, and roadway geometry dominate predictive power; larger\ndrivable area and emergency space reduce risk, whereas excessive visual\nopenness can increase it. By bridging predictive modeling with causal\ninference, Semantic4Safety supports targeted interventions and high-risk\ncorridor diagnosis, offering a scalable, data-informed tool for urban road\nsafety planning."}
{"id": "2510.15418", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15418", "abs": "https://arxiv.org/abs/2510.15418", "authors": ["Lee Qi Zun", "Mohamad Zulhilmi Bin Abdul Halim", "Goh Man Fye"], "title": "Fine-Tuning MedGemma for Clinical Captioning to Enhance Multimodal RAG over Malaysia CPGs", "comment": null, "summary": "Retrieval-Augmented Generation systems are essential for providing fact-based\nguidance from Malaysian Clinical Practice Guidelines. However, their\neffectiveness with image-based queries is limited, as general Vision-Language\nModel captions often lack clinical specificity and factual grounding. This\nstudy proposes and validates a framework to specialize the MedGemma model for\ngenerating high-fidelity captions that serve as superior queries. To overcome\ndata scarcity, we employ a knowledge distillation pipeline to create a\nsynthetic dataset across dermatology, fundus, and chest radiography domains,\nand fine-tune MedGemma using the parameter-efficient QLoRA method. Performance\nwas rigorously assessed through a dual framework measuring both classification\naccuracy and, via a novel application of the RAGAS framework, caption\nfaithfulness, relevancy, and correctness. The fine-tuned model demonstrated\nsubstantial improvements in classification performance, while RAGAS evaluation\nconfirmed significant gains in caption faithfulness and correctness, validating\nthe models ability to produce reliable, factually grounded descriptions. This\nwork establishes a robust pipeline for specializing medical VLMs and validates\nthe resulting model as a high-quality query generator, laying the groundwork\nfor enhancing multimodal RAG systems in evidence-based clinical decision\nsupport."}
{"id": "2510.15470", "categories": ["cs.CV", "cs.IR"], "pdf": "https://arxiv.org/pdf/2510.15470", "abs": "https://arxiv.org/abs/2510.15470", "authors": ["Jinghao Huang", "Yaxiong Chen", "Ganchao Liu"], "title": "MSAM: Multi-Semantic Adaptive Mining for Cross-Modal Drone Video-Text Retrieval", "comment": null, "summary": "With the advancement of drone technology, the volume of video data increases\nrapidly, creating an urgent need for efficient semantic retrieval. We are the\nfirst to systematically propose and study the drone video-text retrieval (DVTR)\ntask. Drone videos feature overhead perspectives, strong structural\nhomogeneity, and diverse semantic expressions of target combinations, which\nchallenge existing cross-modal methods designed for ground-level views in\neffectively modeling their characteristics. Therefore, dedicated retrieval\nmechanisms tailored for drone scenarios are necessary. To address this issue,\nwe propose a novel approach called Multi-Semantic Adaptive Mining (MSAM). MSAM\nintroduces a multi-semantic adaptive learning mechanism, which incorporates\ndynamic changes between frames and extracts rich semantic information from\nspecific scene regions, thereby enhancing the deep understanding and reasoning\nof drone video content. This method relies on fine-grained interactions between\nwords and drone video frames, integrating an adaptive semantic construction\nmodule, a distribution-driven semantic learning term and a diversity semantic\nterm to deepen the interaction between text and drone video modalities and\nimprove the robustness of feature representation. To reduce the interference of\ncomplex backgrounds in drone videos, we introduce a cross-modal interactive\nfeature fusion pooling mechanism that focuses on feature extraction and\nmatching in target regions, minimizing noise effects. Extensive experiments on\ntwo self-constructed drone video-text datasets show that MSAM outperforms other\nexisting methods in the drone video-text retrieval task. The source code and\ndataset will be made publicly available."}
{"id": "2510.15430", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15430", "abs": "https://arxiv.org/abs/2510.15430", "authors": ["Shuang Liang", "Zhihao Xu", "Jialing Tao", "Hui Xue", "Xiting Wang"], "title": "Learning to Detect Unknown Jailbreak Attacks in Large Vision-Language Models", "comment": null, "summary": "Despite extensive alignment efforts, Large Vision-Language Models (LVLMs)\nremain vulnerable to jailbreak attacks, posing serious safety risks. To address\nthis, existing detection methods either learn attack-specific parameters, which\nhinders generalization to unseen attacks, or rely on heuristically sound\nprinciples, which limit accuracy and efficiency. To overcome these limitations,\nwe propose Learning to Detect (LoD), a general framework that accurately\ndetects unknown jailbreak attacks by shifting the focus from attack-specific\nlearning to task-specific learning. This framework includes a Multi-modal\nSafety Concept Activation Vector module for safety-oriented representation\nlearning and a Safety Pattern Auto-Encoder module for unsupervised attack\nclassification. Extensive experiments show that our method achieves\nconsistently higher detection AUROC on diverse unknown attacks while improving\nefficiency. The code is available at\nhttps://anonymous.4open.science/r/Learning-to-Detect-51CB."}
{"id": "2510.15510", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.15510", "abs": "https://arxiv.org/abs/2510.15510", "authors": ["Heeseong Shin", "Byeongho Heo", "Dongyoon Han", "Seungryong Kim", "Taekyung Kim"], "title": "Exploring Conditions for Diffusion models in Robotic Control", "comment": "Project page: https://orca-rc.github.io/", "summary": "While pre-trained visual representations have significantly advanced\nimitation learning, they are often task-agnostic as they remain frozen during\npolicy learning. In this work, we explore leveraging pre-trained text-to-image\ndiffusion models to obtain task-adaptive visual representations for robotic\ncontrol, without fine-tuning the model itself. However, we find that naively\napplying textual conditions - a successful strategy in other vision domains -\nyields minimal or even negative gains in control tasks. We attribute this to\nthe domain gap between the diffusion model's training data and robotic control\nenvironments, leading us to argue for conditions that consider the specific,\ndynamic visual information required for control. To this end, we propose ORCA,\nwhich introduces learnable task prompts that adapt to the control environment\nand visual prompts that capture fine-grained, frame-specific details. Through\nfacilitating task-adaptive representations with our newly devised conditions,\nour approach achieves state-of-the-art performance on various robotic control\nbenchmarks, significantly surpassing prior methods."}
{"id": "2510.15543", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.MM"], "pdf": "https://arxiv.org/pdf/2510.15543", "abs": "https://arxiv.org/abs/2510.15543", "authors": ["Qiyu Wu", "Shuyang Cui", "Satoshi Hayakawa", "Wei-Yao Wang", "Hiromi Wakaki", "Yuki Mitsufuji"], "title": "MCA: Modality Composition Awareness for Robust Composed Multimodal Retrieval", "comment": null, "summary": "Multimodal retrieval, which seeks to retrieve relevant content across\nmodalities such as text or image, supports applications from AI search to\ncontents production. Despite the success of separate-encoder approaches like\nCLIP align modality-specific embeddings with contrastive learning, recent\nmultimodal large language models (MLLMs) enable a unified encoder that directly\nprocesses composed inputs. While flexible and advanced, we identify that\nunified encoders trained with conventional contrastive learning are prone to\nlearn modality shortcut, leading to poor robustness under distribution shifts.\nWe propose a modality composition awareness framework to mitigate this issue.\nConcretely, a preference loss enforces multimodal embeddings to outperform\ntheir unimodal counterparts, while a composition regularization objective\naligns multimodal embeddings with prototypes composed from its unimodal parts.\nThese objectives explicitly model structural relationships between the composed\nrepresentation and its unimodal counterparts. Experiments on various benchmarks\nshow gains in out-of-distribution retrieval, highlighting modality composition\nawareness as a effective principle for robust composed multimodal retrieval\nwhen utilizing MLLMs as the unified encoder."}
{"id": "2510.15557", "categories": ["cs.CV", "cs.AI", "eess.IV"], "pdf": "https://arxiv.org/pdf/2510.15557", "abs": "https://arxiv.org/abs/2510.15557", "authors": ["Tingyu Lin", "Marco Peer", "Florian Kleber", "Robert Sablatnig"], "title": "ClapperText: A Benchmark for Text Recognition in Low-Resource Archival Documents", "comment": "18 pages, accepted at ICDAR2025 DALL", "summary": "This paper presents ClapperText, a benchmark dataset for handwritten and\nprinted text recognition in visually degraded and low-resource settings. The\ndataset is derived from 127 World War II-era archival video segments containing\nclapperboards that record structured production metadata such as date,\nlocation, and camera-operator identity. ClapperText includes 9,813 annotated\nframes and 94,573 word-level text instances, 67% of which are handwritten and\n1,566 are partially occluded. Each instance includes transcription, semantic\ncategory, text type, and occlusion status, with annotations available as\nrotated bounding boxes represented as 4-point polygons to support spatially\nprecise OCR applications. Recognizing clapperboard text poses significant\nchallenges, including motion blur, handwriting variation, exposure\nfluctuations, and cluttered backgrounds, mirroring broader challenges in\nhistorical document analysis where structured content appears in degraded,\nnon-standard forms. We provide both full-frame annotations and cropped word\nimages to support downstream tasks. Using a consistent per-video evaluation\nprotocol, we benchmark six representative recognition and seven detection\nmodels under zero-shot and fine-tuned conditions. Despite the small training\nset (18 videos), fine-tuning leads to substantial performance gains,\nhighlighting ClapperText's suitability for few-shot learning scenarios. The\ndataset offers a realistic and culturally grounded resource for advancing\nrobust OCR and document understanding in low-resource archival contexts. The\ndataset and evaluation code are available at\nhttps://github.com/linty5/ClapperText."}
{"id": "2510.15557", "categories": ["cs.CV", "cs.AI", "eess.IV"], "pdf": "https://arxiv.org/pdf/2510.15557", "abs": "https://arxiv.org/abs/2510.15557", "authors": ["Tingyu Lin", "Marco Peer", "Florian Kleber", "Robert Sablatnig"], "title": "ClapperText: A Benchmark for Text Recognition in Low-Resource Archival Documents", "comment": "18 pages, accepted at ICDAR2025 DALL", "summary": "This paper presents ClapperText, a benchmark dataset for handwritten and\nprinted text recognition in visually degraded and low-resource settings. The\ndataset is derived from 127 World War II-era archival video segments containing\nclapperboards that record structured production metadata such as date,\nlocation, and camera-operator identity. ClapperText includes 9,813 annotated\nframes and 94,573 word-level text instances, 67% of which are handwritten and\n1,566 are partially occluded. Each instance includes transcription, semantic\ncategory, text type, and occlusion status, with annotations available as\nrotated bounding boxes represented as 4-point polygons to support spatially\nprecise OCR applications. Recognizing clapperboard text poses significant\nchallenges, including motion blur, handwriting variation, exposure\nfluctuations, and cluttered backgrounds, mirroring broader challenges in\nhistorical document analysis where structured content appears in degraded,\nnon-standard forms. We provide both full-frame annotations and cropped word\nimages to support downstream tasks. Using a consistent per-video evaluation\nprotocol, we benchmark six representative recognition and seven detection\nmodels under zero-shot and fine-tuned conditions. Despite the small training\nset (18 videos), fine-tuning leads to substantial performance gains,\nhighlighting ClapperText's suitability for few-shot learning scenarios. The\ndataset offers a realistic and culturally grounded resource for advancing\nrobust OCR and document understanding in low-resource archival contexts. The\ndataset and evaluation code are available at\nhttps://github.com/linty5/ClapperText."}
{"id": "2510.15579", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15579", "abs": "https://arxiv.org/abs/2510.15579", "authors": ["Mohammad Soltaninezhad", "Yashar Rouzbahani", "Jhonatan Contreras", "Rohan Chippalkatti", "Daniel Kwaku Abankwa", "Christian Eggeling", "Thomas Bocklitz"], "title": "Lightweight CycleGAN Models for Cross-Modality Image Transformation and Experimental Quality Assessment in Fluorescence Microscopy", "comment": "17 pages, 8 Figures", "summary": "Lightweight deep learning models offer substantial reductions in\ncomputational cost and environmental impact, making them crucial for scientific\napplications. We present a lightweight CycleGAN for modality transfer in\nfluorescence microscopy (confocal to super-resolution STED/deconvolved STED),\naddressing the common challenge of unpaired datasets. By replacing the\ntraditional channel-doubling strategy in the U-Net-based generator with a fixed\nchannel approach, we drastically reduce trainable parameters from 41.8 million\nto approximately nine thousand, achieving superior performance with faster\ntraining and lower memory usage. We also introduce the GAN as a diagnostic tool\nfor experimental and labeling quality. When trained on high-quality images, the\nGAN learns the characteristics of optimal imaging; deviations between its\ngenerated outputs and new experimental images can reveal issues such as\nphotobleaching, artifacts, or inaccurate labeling. This establishes the model\nas a practical tool for validating experimental accuracy and image fidelity in\nmicroscopy workflows."}
{"id": "2510.15579", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15579", "abs": "https://arxiv.org/abs/2510.15579", "authors": ["Mohammad Soltaninezhad", "Yashar Rouzbahani", "Jhonatan Contreras", "Rohan Chippalkatti", "Daniel Kwaku Abankwa", "Christian Eggeling", "Thomas Bocklitz"], "title": "Lightweight CycleGAN Models for Cross-Modality Image Transformation and Experimental Quality Assessment in Fluorescence Microscopy", "comment": "17 pages, 8 Figures", "summary": "Lightweight deep learning models offer substantial reductions in\ncomputational cost and environmental impact, making them crucial for scientific\napplications. We present a lightweight CycleGAN for modality transfer in\nfluorescence microscopy (confocal to super-resolution STED/deconvolved STED),\naddressing the common challenge of unpaired datasets. By replacing the\ntraditional channel-doubling strategy in the U-Net-based generator with a fixed\nchannel approach, we drastically reduce trainable parameters from 41.8 million\nto approximately nine thousand, achieving superior performance with faster\ntraining and lower memory usage. We also introduce the GAN as a diagnostic tool\nfor experimental and labeling quality. When trained on high-quality images, the\nGAN learns the characteristics of optimal imaging; deviations between its\ngenerated outputs and new experimental images can reveal issues such as\nphotobleaching, artifacts, or inaccurate labeling. This establishes the model\nas a practical tool for validating experimental accuracy and image fidelity in\nmicroscopy workflows."}
{"id": "2510.15595", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15595", "abs": "https://arxiv.org/abs/2510.15595", "authors": ["Zhen Sun", "Lei Tan", "Yunhang Shen", "Chengmao Cai", "Xing Sun", "Pingyang Dai", "Liujuan Cao", "Rongrong Ji"], "title": "FlexiReID: Adaptive Mixture of Expert for Multi-Modal Person Re-Identification", "comment": null, "summary": "Multimodal person re-identification (Re-ID) aims to match pedestrian images\nacross different modalities. However, most existing methods focus on limited\ncross-modal settings and fail to support arbitrary query-retrieval\ncombinations, hindering practical deployment. We propose FlexiReID, a flexible\nframework that supports seven retrieval modes across four modalities: rgb,\ninfrared, sketches, and text. FlexiReID introduces an adaptive\nmixture-of-experts (MoE) mechanism to dynamically integrate diverse modality\nfeatures and a cross-modal query fusion module to enhance multimodal feature\nextraction. To facilitate comprehensive evaluation, we construct CIRS-PEDES, a\nunified dataset extending four popular Re-ID datasets to include all four\nmodalities. Extensive experiments demonstrate that FlexiReID achieves\nstate-of-the-art performance and offers strong generalization in complex\nscenarios."}
{"id": "2510.15673", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15673", "abs": "https://arxiv.org/abs/2510.15673", "authors": ["Antonyo Musabini", "Rachid Benmokhtar", "Jagdish Bhanushali", "Victor Galizzi", "Bertrand Luvison", "Xavier Perrotton"], "title": "Valeo Near-Field: a novel dataset for pedestrian intent detection", "comment": null, "summary": "This paper presents a novel dataset aimed at detecting pedestrians'\nintentions as they approach an ego-vehicle. The dataset comprises synchronized\nmulti-modal data, including fisheye camera feeds, lidar laser scans, ultrasonic\nsensor readings, and motion capture-based 3D body poses, collected across\ndiverse real-world scenarios. Key contributions include detailed annotations of\n3D body joint positions synchronized with fisheye camera images, as well as\naccurate 3D pedestrian positions extracted from lidar data, facilitating robust\nbenchmarking for perception algorithms. We release a portion of the dataset\nalong with a comprehensive benchmark suite, featuring evaluation metrics for\naccuracy, efficiency, and scalability on embedded systems. By addressing\nreal-world challenges such as sensor occlusions, dynamic environments, and\nhardware constraints, this dataset offers a unique resource for developing and\nevaluating state-of-the-art algorithms in pedestrian detection, 3D pose\nestimation and 4D trajectory and intention prediction. Additionally, we provide\nbaseline performance metrics using custom neural network architectures and\nsuggest future research directions to encourage the adoption and enhancement of\nthe dataset. This work aims to serve as a foundation for researchers seeking to\nadvance the capabilities of intelligent vehicles in near-field scenarios."}
{"id": "2510.15602", "categories": ["cs.CV", "I.4.7; I.2.10; I.3.8"], "pdf": "https://arxiv.org/pdf/2510.15602", "abs": "https://arxiv.org/abs/2510.15602", "authors": ["Andrei-Timotei Ardelean", "Patrick Rückbeil", "Tim Weyrich"], "title": "Quantized FCA: Efficient Zero-Shot Texture Anomaly Detection", "comment": "13 pages, 10 figures. Published in the 30th Intl. Conference on\n  Vision, Modeling, and Visualization (VMV), 2025", "summary": "Zero-shot anomaly localization is a rising field in computer vision research,\nwith important progress in recent years. This work focuses on the problem of\ndetecting and localizing anomalies in textures, where anomalies can be defined\nas the regions that deviate from the overall statistics, violating the\nstationarity assumption. The main limitation of existing methods is their high\nrunning time, making them impractical for deployment in real-world scenarios,\nsuch as assembly line monitoring. We propose a real-time method, named QFCA,\nwhich implements a quantized version of the feature correspondence analysis\n(FCA) algorithm. By carefully adapting the patch statistics comparison to work\non histograms of quantized values, we obtain a 10x speedup with little to no\nloss in accuracy. Moreover, we introduce a feature preprocessing step based on\nprincipal component analysis, which enhances the contrast between normal and\nanomalous features, improving the detection precision on complex textures. Our\nmethod is thoroughly evaluated against prior art, comparing favorably with\nexisting methods. Project page:\nhttps://reality.tf.fau.de/pub/ardelean2025quantized.html"}
{"id": "2510.15684", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15684", "abs": "https://arxiv.org/abs/2510.15684", "authors": ["Gerard Comas-Quiles", "Carles Garcia-Cabrera", "Julia Dietlmeier", "Noel E. O'Connor", "Ferran Marques"], "title": "Towards Label-Free Brain Tumor Segmentation: Unsupervised Learning with Multimodal MRI", "comment": "10 pages, 5 figures, BraTS GoAT 2025 challenge", "summary": "Unsupervised anomaly detection (UAD) presents a complementary alternative to\nsupervised learning for brain tumor segmentation in magnetic resonance imaging\n(MRI), particularly when annotated datasets are limited, costly, or\ninconsistent. In this work, we propose a novel Multimodal Vision Transformer\nAutoencoder (MViT-AE) trained exclusively on healthy brain MRIs to detect and\nlocalize tumors via reconstruction-based error maps. This unsupervised paradigm\nenables segmentation without reliance on manual labels, addressing a key\nscalability bottleneck in neuroimaging workflows. Our method is evaluated in\nthe BraTS-GoAT 2025 Lighthouse dataset, which includes various types of tumors\nsuch as gliomas, meningiomas, and pediatric brain tumors. To enhance\nperformance, we introduce a multimodal early-late fusion strategy that\nleverages complementary information across multiple MRI sequences, and a\npost-processing pipeline that integrates the Segment Anything Model (SAM) to\nrefine predicted tumor contours. Despite the known challenges of UAD,\nparticularly in detecting small or non-enhancing lesions, our method achieves\nclinically meaningful tumor localization, with lesion-wise Dice Similarity\nCoefficient of 0.437 (Whole Tumor), 0.316 (Tumor Core), and 0.350 (Enhancing\nTumor) on the test set, and an anomaly Detection Rate of 89.4% on the\nvalidation set. These findings highlight the potential of transformer-based\nunsupervised models to serve as scalable, label-efficient tools for\nneuro-oncological imaging."}
{"id": "2510.15673", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15673", "abs": "https://arxiv.org/abs/2510.15673", "authors": ["Antonyo Musabini", "Rachid Benmokhtar", "Jagdish Bhanushali", "Victor Galizzi", "Bertrand Luvison", "Xavier Perrotton"], "title": "Valeo Near-Field: a novel dataset for pedestrian intent detection", "comment": null, "summary": "This paper presents a novel dataset aimed at detecting pedestrians'\nintentions as they approach an ego-vehicle. The dataset comprises synchronized\nmulti-modal data, including fisheye camera feeds, lidar laser scans, ultrasonic\nsensor readings, and motion capture-based 3D body poses, collected across\ndiverse real-world scenarios. Key contributions include detailed annotations of\n3D body joint positions synchronized with fisheye camera images, as well as\naccurate 3D pedestrian positions extracted from lidar data, facilitating robust\nbenchmarking for perception algorithms. We release a portion of the dataset\nalong with a comprehensive benchmark suite, featuring evaluation metrics for\naccuracy, efficiency, and scalability on embedded systems. By addressing\nreal-world challenges such as sensor occlusions, dynamic environments, and\nhardware constraints, this dataset offers a unique resource for developing and\nevaluating state-of-the-art algorithms in pedestrian detection, 3D pose\nestimation and 4D trajectory and intention prediction. Additionally, we provide\nbaseline performance metrics using custom neural network architectures and\nsuggest future research directions to encourage the adoption and enhancement of\nthe dataset. This work aims to serve as a foundation for researchers seeking to\nadvance the capabilities of intelligent vehicles in near-field scenarios."}
{"id": "2510.15725", "categories": ["cs.CV", "cs.AI", "eess.IV"], "pdf": "https://arxiv.org/pdf/2510.15725", "abs": "https://arxiv.org/abs/2510.15725", "authors": ["Tingyu Lin", "Armin Dadras", "Florian Kleber", "Robert Sablatnig"], "title": "DGME-T: Directional Grid Motion Encoding for Transformer-Based Historical Camera Movement Classification", "comment": "9 pages, accepted at ACMMM2025 SUMAC", "summary": "Camera movement classification (CMC) models trained on contemporary,\nhigh-quality footage often degrade when applied to archival film, where noise,\nmissing frames, and low contrast obscure motion cues. We bridge this gap by\nassembling a unified benchmark that consolidates two modern corpora into four\ncanonical classes and restructures the HISTORIAN collection into five balanced\ncategories. Building on this benchmark, we introduce DGME-T, a lightweight\nextension to the Video Swin Transformer that injects directional grid motion\nencoding, derived from optical flow, via a learnable and normalised late-fusion\nlayer. DGME-T raises the backbone's top-1 accuracy from 81.78% to 86.14% and\nits macro F1 from 82.08% to 87.81% on modern clips, while still improving the\ndemanding World-War-II footage from 83.43% to 84.62% accuracy and from 81.72%\nto 82.63% macro F1. A cross-domain study further shows that an intermediate\nfine-tuning stage on modern data increases historical performance by more than\nfive percentage points. These results demonstrate that structured motion priors\nand transformer representations are complementary and that even a small,\ncarefully calibrated motion head can substantially enhance robustness in\ndegraded film analysis. Related resources are available at\nhttps://github.com/linty5/DGME-T."}
{"id": "2510.15684", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15684", "abs": "https://arxiv.org/abs/2510.15684", "authors": ["Gerard Comas-Quiles", "Carles Garcia-Cabrera", "Julia Dietlmeier", "Noel E. O'Connor", "Ferran Marques"], "title": "Towards Label-Free Brain Tumor Segmentation: Unsupervised Learning with Multimodal MRI", "comment": "10 pages, 5 figures, BraTS GoAT 2025 challenge", "summary": "Unsupervised anomaly detection (UAD) presents a complementary alternative to\nsupervised learning for brain tumor segmentation in magnetic resonance imaging\n(MRI), particularly when annotated datasets are limited, costly, or\ninconsistent. In this work, we propose a novel Multimodal Vision Transformer\nAutoencoder (MViT-AE) trained exclusively on healthy brain MRIs to detect and\nlocalize tumors via reconstruction-based error maps. This unsupervised paradigm\nenables segmentation without reliance on manual labels, addressing a key\nscalability bottleneck in neuroimaging workflows. Our method is evaluated in\nthe BraTS-GoAT 2025 Lighthouse dataset, which includes various types of tumors\nsuch as gliomas, meningiomas, and pediatric brain tumors. To enhance\nperformance, we introduce a multimodal early-late fusion strategy that\nleverages complementary information across multiple MRI sequences, and a\npost-processing pipeline that integrates the Segment Anything Model (SAM) to\nrefine predicted tumor contours. Despite the known challenges of UAD,\nparticularly in detecting small or non-enhancing lesions, our method achieves\nclinically meaningful tumor localization, with lesion-wise Dice Similarity\nCoefficient of 0.437 (Whole Tumor), 0.316 (Tumor Core), and 0.350 (Enhancing\nTumor) on the test set, and an anomaly Detection Rate of 89.4% on the\nvalidation set. These findings highlight the potential of transformer-based\nunsupervised models to serve as scalable, label-efficient tools for\nneuro-oncological imaging."}
{"id": "2510.15752", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15752", "abs": "https://arxiv.org/abs/2510.15752", "authors": ["Yitong Sun", "Yao Huang", "Ruochen Zhang", "Huanran Chen", "Shouwei Ruan", "Ranjie Duan", "Xingxing Wei"], "title": "NDM: A Noise-driven Detection and Mitigation Framework against Implicit Sexual Intentions in Text-to-Image Generation", "comment": "10 pages, 8 figures, accepted by ACMMM 2025", "summary": "Despite the impressive generative capabilities of text-to-image (T2I)\ndiffusion models, they remain vulnerable to generating inappropriate content,\nespecially when confronted with implicit sexual prompts. Unlike explicit\nharmful prompts, these subtle cues, often disguised as seemingly benign terms,\ncan unexpectedly trigger sexual content due to underlying model biases, raising\nsignificant ethical concerns. However, existing detection methods are primarily\ndesigned to identify explicit sexual content and therefore struggle to detect\nthese implicit cues. Fine-tuning approaches, while effective to some extent,\nrisk degrading the model's generative quality, creating an undesirable\ntrade-off. To address this, we propose NDM, the first noise-driven detection\nand mitigation framework, which could detect and mitigate implicit malicious\nintention in T2I generation while preserving the model's original generative\ncapabilities. Specifically, we introduce two key innovations: first, we\nleverage the separability of early-stage predicted noise to develop a\nnoise-based detection method that could identify malicious content with high\naccuracy and efficiency; second, we propose a noise-enhanced adaptive negative\nguidance mechanism that could optimize the initial noise by suppressing the\nprominent region's attention, thereby enhancing the effectiveness of adaptive\nnegative guidance for sexual mitigation. Experimentally, we validate NDM on\nboth natural and adversarial datasets, demonstrating its superior performance\nover existing SOTA methods, including SLD, UCE, and RECE, etc. Code and\nresources are available at https://github.com/lorraine021/NDM."}
{"id": "2510.15710", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15710", "abs": "https://arxiv.org/abs/2510.15710", "authors": ["Junzhi Ning", "Wei Li", "Cheng Tang", "Jiashi Lin", "Chenglong Ma", "Chaoyang Zhang", "Jiyao Liu", "Ying Chen", "Shujian Gao", "Lihao Liu", "Yuandong Pu", "Huihui Xu", "Chenhui Gou", "Ziyan Huang", "Yi Xin", "Qi Qin", "Zhongying Deng", "Diping Song", "Bin Fu", "Guang Yang", "Yuanfeng Ji", "Tianbin Li", "Yanzhou Su", "Jin Ye", "Shixiang Tang", "Ming Hu", "Junjun He"], "title": "Unimedvl: Unifying Medical Multimodal Understanding And Generation Through Observation-Knowledge-Analysis", "comment": null, "summary": "Medical diagnostic applications require models that can process multimodal\nmedical inputs (images, patient histories, lab results) and generate diverse\noutputs including both textual reports and visual content (annotations,\nsegmentation masks, and images). Despite this need, existing medical AI systems\ndisrupt this unified process: medical image understanding models interpret\nimages but cannot generate visual outputs, while medical image generation\nmodels synthesize images but cannot provide textual explanations. This leads to\ngaps in data representation, feature integration, and task-level multimodal\ncapabilities. To this end, we propose a multi-level framework that draws\ninspiration from diagnostic workflows through the\nObservation-Knowledge-Analysis (OKA) paradigm. Specifically, at the observation\nlevel, we construct UniMed-5M, a dataset comprising over 5.6M samples that\nreformat diverse unimodal data into multimodal pairs for foundational\nobservation. At the knowledge level, we propose Progressive Curriculum Learning\nthat systematically introduces medical multimodal knowledge. At the analysis\nlevel, we introduce UniMedVL, the first medical unified multimodal model for\nthe simultaneous analysis of image understanding and generation tasks within a\nsingle architecture. UniMedVL achieves superior performance on five medical\nimage understanding benchmarks, while matching specialized models in generation\nquality across eight medical imaging modalities. Crucially, our unified\narchitecture enables bidirectional knowledge sharing: generation tasks enhance\nvisual understanding features, demonstrating that integrating traditionally\nseparate capabilities within a single medical framework unlocks improvements\nacross diverse medical vision-language tasks. Code is available at\nhttps://github.com/uni-medical/UniMedVL."}
{"id": "2510.15870", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15870", "abs": "https://arxiv.org/abs/2510.15870", "authors": ["Hanrong Ye", "Chao-Han Huck Yang", "Arushi Goel", "Wei Huang", "Ligeng Zhu", "Yuanhang Su", "Sean Lin", "An-Chieh Cheng", "Zhen Wan", "Jinchuan Tian", "Yuming Lou", "Dong Yang", "Zhijian Liu", "Yukang Chen", "Ambrish Dantrey", "Ehsan Jahangiri", "Sreyan Ghosh", "Daguang Xu", "Ehsan Hosseini-Asl", "Danial Mohseni Taheri", "Vidya Murali", "Sifei Liu", "Jason Lu", "Oluwatobi Olabiyi", "Frank Wang", "Rafael Valle", "Bryan Catanzaro", "Andrew Tao", "Song Han", "Jan Kautz", "Hongxu Yin", "Pavlo Molchanov"], "title": "OmniVinci: Enhancing Architecture and Data for Omni-Modal Understanding LLM", "comment": "Technical Report. Code: https://github.com/NVlabs/OmniVinci", "summary": "Advancing machine intelligence requires developing the ability to perceive\nacross multiple modalities, much as humans sense the world. We introduce\nOmniVinci, an initiative to build a strong, open-source, omni-modal LLM. We\ncarefully study the design choices across model architecture and data curation.\nFor model architecture, we present three key innovations: (i) OmniAlignNet for\nstrengthening alignment between vision and audio embeddings in a shared\nomni-modal latent space; (ii) Temporal Embedding Grouping for capturing\nrelative temporal alignment between vision and audio signals; and (iii)\nConstrained Rotary Time Embedding for encoding absolute temporal information in\nomni-modal embeddings. We introduce a curation and synthesis pipeline that\ngenerates 24M single-modal and omni-modal conversations. We find that\nmodalities reinforce one another in both perception and reasoning. Our model,\nOmniVinci, outperforms Qwen2.5-Omni with +19.05 on DailyOmni (cross-modal\nunderstanding), +1.7 on MMAR (audio), and +3.9 on Video-MME (vision), while\nusing just 0.2T training tokens - a 6 times reduction compared to\nQwen2.5-Omni's 1.2T. We finally demonstrate omni-modal advantages in downstream\napplications spanning robotics, medical AI, and smart factory."}
{"id": "2510.15725", "categories": ["cs.CV", "cs.AI", "eess.IV"], "pdf": "https://arxiv.org/pdf/2510.15725", "abs": "https://arxiv.org/abs/2510.15725", "authors": ["Tingyu Lin", "Armin Dadras", "Florian Kleber", "Robert Sablatnig"], "title": "DGME-T: Directional Grid Motion Encoding for Transformer-Based Historical Camera Movement Classification", "comment": "9 pages, accepted at ACMMM2025 SUMAC", "summary": "Camera movement classification (CMC) models trained on contemporary,\nhigh-quality footage often degrade when applied to archival film, where noise,\nmissing frames, and low contrast obscure motion cues. We bridge this gap by\nassembling a unified benchmark that consolidates two modern corpora into four\ncanonical classes and restructures the HISTORIAN collection into five balanced\ncategories. Building on this benchmark, we introduce DGME-T, a lightweight\nextension to the Video Swin Transformer that injects directional grid motion\nencoding, derived from optical flow, via a learnable and normalised late-fusion\nlayer. DGME-T raises the backbone's top-1 accuracy from 81.78% to 86.14% and\nits macro F1 from 82.08% to 87.81% on modern clips, while still improving the\ndemanding World-War-II footage from 83.43% to 84.62% accuracy and from 81.72%\nto 82.63% macro F1. A cross-domain study further shows that an intermediate\nfine-tuning stage on modern data increases historical performance by more than\nfive percentage points. These results demonstrate that structured motion priors\nand transformer representations are complementary and that even a small,\ncarefully calibrated motion head can substantially enhance robustness in\ndegraded film analysis. Related resources are available at\nhttps://github.com/linty5/DGME-T."}
{"id": "2510.15752", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15752", "abs": "https://arxiv.org/abs/2510.15752", "authors": ["Yitong Sun", "Yao Huang", "Ruochen Zhang", "Huanran Chen", "Shouwei Ruan", "Ranjie Duan", "Xingxing Wei"], "title": "NDM: A Noise-driven Detection and Mitigation Framework against Implicit Sexual Intentions in Text-to-Image Generation", "comment": "10 pages, 8 figures, accepted by ACMMM 2025", "summary": "Despite the impressive generative capabilities of text-to-image (T2I)\ndiffusion models, they remain vulnerable to generating inappropriate content,\nespecially when confronted with implicit sexual prompts. Unlike explicit\nharmful prompts, these subtle cues, often disguised as seemingly benign terms,\ncan unexpectedly trigger sexual content due to underlying model biases, raising\nsignificant ethical concerns. However, existing detection methods are primarily\ndesigned to identify explicit sexual content and therefore struggle to detect\nthese implicit cues. Fine-tuning approaches, while effective to some extent,\nrisk degrading the model's generative quality, creating an undesirable\ntrade-off. To address this, we propose NDM, the first noise-driven detection\nand mitigation framework, which could detect and mitigate implicit malicious\nintention in T2I generation while preserving the model's original generative\ncapabilities. Specifically, we introduce two key innovations: first, we\nleverage the separability of early-stage predicted noise to develop a\nnoise-based detection method that could identify malicious content with high\naccuracy and efficiency; second, we propose a noise-enhanced adaptive negative\nguidance mechanism that could optimize the initial noise by suppressing the\nprominent region's attention, thereby enhancing the effectiveness of adaptive\nnegative guidance for sexual mitigation. Experimentally, we validate NDM on\nboth natural and adversarial datasets, demonstrating its superior performance\nover existing SOTA methods, including SLD, UCE, and RECE, etc. Code and\nresources are available at https://github.com/lorraine021/NDM."}
{"id": "2510.15761", "categories": ["cs.CV", "cs.LG", "68T07, 68U10", "I.2.10; I.4.8; I.4.9"], "pdf": "https://arxiv.org/pdf/2510.15761", "abs": "https://arxiv.org/abs/2510.15761", "authors": ["Denis Rychkovskiy"], "title": "QSilk: Micrograin Stabilization and Adaptive Quantile Clipping for Detail-Friendly Latent Diffusion", "comment": "Preprint. Qualitative side-by-side comparisons (fixed seeds); 3\n  figures with subfigures; 1 algorithm. CADE 2.5 / SDXL integration; sample\n  images included. Code and presets planned for release upon publication", "summary": "We present QSilk, a lightweight, always-on stabilization layer for latent\ndiffusion that improves high-frequency fidelity while suppressing rare\nactivation spikes. QSilk combines (i) a per-sample micro clamp that gently\nlimits extreme values without washing out texture, and (ii) Adaptive Quantile\nClip (AQClip), which adapts the allowed value corridor per region. AQClip can\noperate in a proxy mode using local structure statistics or in an attention\nentropy guided mode (model confidence). Integrated into the CADE 2.5 rendering\npipeline, QSilk yields cleaner, sharper results at low step counts and\nultra-high resolutions with negligible overhead. It requires no training or\nfine-tuning and exposes minimal user controls. We report consistent qualitative\nimprovements across SD/SDXL backbones and show synergy with CFG/Rescale,\nenabling slightly higher guidance without artifacts."}
{"id": "2510.15841", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15841", "abs": "https://arxiv.org/abs/2510.15841", "authors": ["Jiayi Lin", "Jiabo Huang", "Shaogang Gong"], "title": "Neuro-Symbolic Spatial Reasoning in Segmentation", "comment": null, "summary": "Open-Vocabulary Semantic Segmentation (OVSS) assigns pixel-level labels from\nan open set of categories, requiring generalization to unseen and unlabelled\nobjects. Using vision-language models (VLMs) to correlate local image patches\nwith potential unseen object categories suffers from a lack of understanding of\nspatial relations of objects in a scene. To solve this problem, we introduce\nneuro-symbolic (NeSy) spatial reasoning in OVSS. In contrast to contemporary\nVLM correlation-based approaches, we propose Relational Segmentor (RelateSeg)\nto impose explicit spatial relational constraints by first order logic (FOL)\nformulated in a neural network architecture. This is the first attempt to\nexplore NeSy spatial reasoning in OVSS. Specifically, RelateSeg automatically\nextracts spatial relations, e.g., <cat, to-right-of, person>, and encodes them\nas first-order logic formulas using our proposed pseudo categories. Each pixel\nlearns to predict both a semantic category (e.g., \"cat\") and a spatial pseudo\ncategory (e.g., \"right of person\") simultaneously, enforcing relational\nconstraints (e.g., a \"cat\" pixel must lie to the right of a \"person\"). Finally,\nthese logic constraints are formulated in a deep network architecture by fuzzy\nlogic relaxation, enabling end-to-end learning of spatial-relationally\nconsistent segmentation. RelateSeg achieves state-of-the-art performance in\nterms of average mIoU across four benchmark datasets and particularly shows\nclear advantages on images containing multiple categories, with the cost of\nonly introducing a single auxiliary loss function and no additional parameters,\nvalidating the effectiveness of NeSy spatial reasoning in OVSS."}
{"id": "2510.15857", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15857", "abs": "https://arxiv.org/abs/2510.15857", "authors": ["Jiuhai Chen", "Le Xue", "Zhiyang Xu", "Xichen Pan", "Shusheng Yang", "Can Qin", "An Yan", "Honglu Zhou", "Zeyuan Chen", "Lifu Huang", "Tianyi Zhou", "Junnan Li", "Silvio Savarese", "Caiming Xiong", "Ran Xu"], "title": "BLIP3o-NEXT: Next Frontier of Native Image Generation", "comment": null, "summary": "We present BLIP3o-NEXT, a fully open-source foundation model in the BLIP3\nseries that advances the next frontier of native image generation. BLIP3o-NEXT\nunifies text-to-image generation and image editing within a single\narchitecture, demonstrating strong image generation and image editing\ncapabilities. In developing the state-of-the-art native image generation model,\nwe identify four key insights: (1) Most architectural choices yield comparable\nperformance; an architecture can be deemed effective provided it scales\nefficiently and supports fast inference; (2) The successful application of\nreinforcement learning can further push the frontier of native image\ngeneration; (3) Image editing still remains a challenging task, yet instruction\nfollowing and the consistency between generated and reference images can be\nsignificantly enhanced through post-training and data engine; (4) Data quality\nand scale continue to be decisive factors that determine the upper bound of\nmodel performance. Building upon these insights, BLIP3o-NEXT leverages an\nAutoregressive + Diffusion architecture in which an autoregressive model first\ngenerates discrete image tokens conditioned on multimodal inputs, whose hidden\nstates are then used as conditioning signals for a diffusion model to generate\nhigh-fidelity images. This architecture integrates the reasoning strength and\ninstruction following of autoregressive models with the fine-detail rendering\nability of diffusion models, achieving a new level of coherence and realism.\nExtensive evaluations of various text-to-image and image-editing benchmarks\nshow that BLIP3o-NEXT achieves superior performance over existing models."}
{"id": "2510.15866", "categories": ["cs.CV", "cs.NE"], "pdf": "https://arxiv.org/pdf/2510.15866", "abs": "https://arxiv.org/abs/2510.15866", "authors": ["Kaushitha Silva", "Mansitha Eashwara", "Sanduni Ubayasiri", "Ruwan Tennakoon", "Damayanthi Herath"], "title": "BiomedXPro: Prompt Optimization for Explainable Diagnosis with Biomedical Vision Language Models", "comment": "10 Pages + 15 Supplementary Material Pages, 5 figures", "summary": "The clinical adoption of biomedical vision-language models is hindered by\nprompt optimization techniques that produce either uninterpretable latent\nvectors or single textual prompts. This lack of transparency and failure to\ncapture the multi-faceted nature of clinical diagnosis, which relies on\nintegrating diverse observations, limits their trustworthiness in high-stakes\nsettings. To address this, we introduce BiomedXPro, an evolutionary framework\nthat leverages a large language model as both a biomedical knowledge extractor\nand an adaptive optimizer to automatically generate a diverse ensemble of\ninterpretable, natural-language prompt pairs for disease diagnosis. Experiments\non multiple biomedical benchmarks show that BiomedXPro consistently outperforms\nstate-of-the-art prompt-tuning methods, particularly in data-scarce few-shot\nsettings. Furthermore, our analysis demonstrates a strong semantic alignment\nbetween the discovered prompts and statistically significant clinical features,\ngrounding the model's performance in verifiable concepts. By producing a\ndiverse ensemble of interpretable prompts, BiomedXPro provides a verifiable\nbasis for model predictions, representing a critical step toward the\ndevelopment of more trustworthy and clinically-aligned AI systems."}
{"id": "2510.15870", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15870", "abs": "https://arxiv.org/abs/2510.15870", "authors": ["Hanrong Ye", "Chao-Han Huck Yang", "Arushi Goel", "Wei Huang", "Ligeng Zhu", "Yuanhang Su", "Sean Lin", "An-Chieh Cheng", "Zhen Wan", "Jinchuan Tian", "Yuming Lou", "Dong Yang", "Zhijian Liu", "Yukang Chen", "Ambrish Dantrey", "Ehsan Jahangiri", "Sreyan Ghosh", "Daguang Xu", "Ehsan Hosseini-Asl", "Danial Mohseni Taheri", "Vidya Murali", "Sifei Liu", "Jason Lu", "Oluwatobi Olabiyi", "Frank Wang", "Rafael Valle", "Bryan Catanzaro", "Andrew Tao", "Song Han", "Jan Kautz", "Hongxu Yin", "Pavlo Molchanov"], "title": "OmniVinci: Enhancing Architecture and Data for Omni-Modal Understanding LLM", "comment": "Technical Report. Code: https://github.com/NVlabs/OmniVinci", "summary": "Advancing machine intelligence requires developing the ability to perceive\nacross multiple modalities, much as humans sense the world. We introduce\nOmniVinci, an initiative to build a strong, open-source, omni-modal LLM. We\ncarefully study the design choices across model architecture and data curation.\nFor model architecture, we present three key innovations: (i) OmniAlignNet for\nstrengthening alignment between vision and audio embeddings in a shared\nomni-modal latent space; (ii) Temporal Embedding Grouping for capturing\nrelative temporal alignment between vision and audio signals; and (iii)\nConstrained Rotary Time Embedding for encoding absolute temporal information in\nomni-modal embeddings. We introduce a curation and synthesis pipeline that\ngenerates 24M single-modal and omni-modal conversations. We find that\nmodalities reinforce one another in both perception and reasoning. Our model,\nOmniVinci, outperforms Qwen2.5-Omni with +19.05 on DailyOmni (cross-modal\nunderstanding), +1.7 on MMAR (audio), and +3.9 on Video-MME (vision), while\nusing just 0.2T training tokens - a 6 times reduction compared to\nQwen2.5-Omni's 1.2T. We finally demonstrate omni-modal advantages in downstream\napplications spanning robotics, medical AI, and smart factory."}
{"id": "2510.15253", "categories": ["cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15253", "abs": "https://arxiv.org/abs/2510.15253", "authors": ["Sensen Gao", "Shanshan Zhao", "Xu Jiang", "Lunhao Duan", "Yong Xien Chng", "Qing-Guo Chen", "Weihua Luo", "Kaifu Zhang", "Jia-Wang Bian", "Mingming Gong"], "title": "Scaling Beyond Context: A Survey of Multimodal Retrieval-Augmented Generation for Document Understanding", "comment": null, "summary": "Document understanding is critical for applications from financial analysis\nto scientific discovery. Current approaches, whether OCR-based pipelines\nfeeding Large Language Models (LLMs) or native Multimodal LLMs (MLLMs), face\nkey limitations: the former loses structural detail, while the latter struggles\nwith context modeling. Retrieval-Augmented Generation (RAG) helps ground models\nin external data, but documents' multimodal nature, i.e., combining text,\ntables, charts, and layout, demands a more advanced paradigm: Multimodal RAG.\nThis approach enables holistic retrieval and reasoning across all modalities,\nunlocking comprehensive document intelligence. Recognizing its importance, this\npaper presents a systematic survey of Multimodal RAG for document\nunderstanding. We propose a taxonomy based on domain, retrieval modality, and\ngranularity, and review advances involving graph structures and agentic\nframeworks. We also summarize key datasets, benchmarks, and applications, and\nhighlight open challenges in efficiency, fine-grained representation, and\nrobustness, providing a roadmap for future progress in document AI."}
