{"id": "2510.21049", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21049", "abs": "https://arxiv.org/abs/2510.21049", "authors": ["Atoosa Chegini", "Hamid Kazemi", "Garrett Souza", "Maria Safi", "Yang Song", "Samy Bengio", "Sinead Williamson", "Mehrdad Farajtabar"], "title": "Reasoning's Razor: Reasoning Improves Accuracy but Can Hurt Recall at Critical Operating Points in Safety and Hallucination Detection", "comment": null, "summary": "Reasoning has become a central paradigm for large language models (LLMs),\nconsistently boosting accuracy across diverse benchmarks. Yet its suitability\nfor precision-sensitive tasks remains unclear. We present the first systematic\nstudy of reasoning for classification tasks under strict low false positive\nrate (FPR) regimes. Our analysis covers two tasks--safety detection and\nhallucination detection--evaluated in both fine-tuned and zero-shot settings,\nusing standard LLMs and Large Reasoning Models (LRMs). Our results reveal a\nclear trade-off: Think On (reasoning-augmented) generation improves overall\naccuracy, but underperforms at the low-FPR thresholds essential for practical\nuse. In contrast, Think Off (no reasoning during inference) dominates in these\nprecision-sensitive regimes, with Think On surpassing only when higher FPRs are\nacceptable. In addition, we find token-based scoring substantially outperforms\nself-verbalized confidence for precision-sensitive deployments. Finally, a\nsimple ensemble of the two modes recovers the strengths of each. Taken\ntogether, our findings position reasoning as a double-edged tool: beneficial\nfor average accuracy, but often ill-suited for applications requiring strict\nprecision."}
{"id": "2510.21445", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21445", "abs": "https://arxiv.org/abs/2510.21445", "authors": ["Thanh Cong Ho", "Farah Kharrat", "Abderrazek Abid", "Fakhri Karray"], "title": "REMONI: An Autonomous System Integrating Wearables and Multimodal Large Language Models for Enhanced Remote Health Monitoring", "comment": null, "summary": "With the widespread adoption of wearable devices in our daily lives, the\ndemand and appeal for remote patient monitoring have significantly increased.\nMost research in this field has concentrated on collecting sensor data,\nvisualizing it, and analyzing it to detect anomalies in specific diseases such\nas diabetes, heart disease and depression. However, this domain has a notable\ngap in the aspect of human-machine interaction. This paper proposes REMONI, an\nautonomous REmote health MONItoring system that integrates multimodal large\nlanguage models (MLLMs), the Internet of Things (IoT), and wearable devices.\nThe system automatically and continuously collects vital signs, accelerometer\ndata from a special wearable (such as a smartwatch), and visual data in patient\nvideo clips collected from cameras. This data is processed by an anomaly\ndetection module, which includes a fall detection model and algorithms to\nidentify and alert caregivers of the patient's emergency conditions. A\ndistinctive feature of our proposed system is the natural language processing\ncomponent, developed with MLLMs capable of detecting and recognizing a\npatient's activity and emotion while responding to healthcare worker's\ninquiries. Additionally, prompt engineering is employed to integrate all\npatient information seamlessly. As a result, doctors and nurses can access\nreal-time vital signs and the patient's current state and mood by interacting\nwith an intelligent agent through a user-friendly web application. Our\nexperiments demonstrate that our system is implementable and scalable for\nreal-life scenarios, potentially reducing the workload of medical professionals\nand healthcare costs. A full-fledged prototype illustrating the functionalities\nof the system has been developed and being tested to demonstrate the robustness\nof its various capabilities."}
{"id": "2510.21553", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21553", "abs": "https://arxiv.org/abs/2510.21553", "authors": ["Jared Claypoole", "Yunye Gong", "Noson S. Yanofsky", "Ajay Divakaran"], "title": "Document Understanding, Measurement, and Manipulation Using Category Theory", "comment": null, "summary": "We apply category theory to extract multimodal document structure which leads\nus to develop information theoretic measures, content summarization and\nextension, and self-supervised improvement of large pretrained models. We first\ndevelop a mathematical representation of a document as a category of\nquestion-answer pairs. Second, we develop an orthogonalization procedure to\ndivide the information contained in one or more documents into non-overlapping\npieces. The structures extracted in the first and second steps lead us to\ndevelop methods to measure and enumerate the information contained in a\ndocument. We also build on those steps to develop new summarization techniques,\nas well as to develop a solution to a new problem viz. exegesis resulting in an\nextension of the original document. Our question-answer pair methodology\nenables a novel rate distortion analysis of summarization techniques. We\nimplement our techniques using large pretrained models, and we propose a\nmultimodal extension of our overall mathematical framework. Finally, we develop\na novel self-supervised method using RLVR to improve large pretrained models\nusing consistency constraints such as composability and closure under certain\noperations that stem naturally from our category theoretic framework."}
{"id": "2510.21182", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.21182", "abs": "https://arxiv.org/abs/2510.21182", "authors": ["Junzhe Zhang", "Huixuan Zhang", "Xiaojun Wan"], "title": "KBE-DME: Dynamic Multimodal Evaluation via Knowledge Enhanced Benchmark Evolution", "comment": "submitting to ICLR2026", "summary": "The rapid progress of multimodal large language models (MLLMs) calls for more\nreliable evaluation protocols. Existing static benchmarks suffer from the\npotential risk of data contamination and saturation, leading to inflated or\nmisleading performance evaluations. To address these issues, we first apply\nGraph formulation to represent a static or dynamic VQA sample. With the\nformulation, we propose Knowledge-enhanced Benchmark Evolution(KBE), a dynamic\nmultimodal evaluation framework. KBE first analyzes the original static\nbenchmark, then expands it by integrating multimodal knowledge, transforming\nthe static benchmark into a controllable, dynamic evolving version. Crucially,\nKBE can both reconstruct questions by Re-selecting visual information in the\noriginal image and expand existing questions with external textual knowledge.\nIt enables difficulty-controllable evaluation by adjusting the degree of\nquestion exploration. Extensive experiments demonstrate that KBE alleviates the\nrisk of data contamination, data saturation, and provides a more comprehensive\nassessment of MLLM capabilities."}
{"id": "2510.20887", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20887", "abs": "https://arxiv.org/abs/2510.20887", "authors": ["Anujraaj Argo Goyal", "Guocheng Gordon Qian", "Huseyin Coskun", "Aarush Gupta", "Himmy Tam", "Daniil Ostashev", "Ju Hu", "Dhritiman Sagar", "Sergey Tulyakov", "Kfir Aberman", "Kuan-Chieh Jackson Wang"], "title": "Preventing Shortcuts in Adapter Training via Providing the Shortcuts", "comment": "Accepted to NeurIPS 2025, webpage:\n  https://snap-research.github.io/shortcut-rerouting/", "summary": "Adapter-based training has emerged as a key mechanism for extending the\ncapabilities of powerful foundation image generators, enabling personalized and\nstylized text-to-image synthesis. These adapters are typically trained to\ncapture a specific target attribute, such as subject identity, using\nsingle-image reconstruction objectives. However, because the input image\ninevitably contains a mixture of visual factors, adapters are prone to entangle\nthe target attribute with incidental ones, such as pose, expression, and\nlighting. This spurious correlation problem limits generalization and obstructs\nthe model's ability to adhere to the input text prompt. In this work, we\nuncover a simple yet effective solution: provide the very shortcuts we wish to\neliminate during adapter training. In Shortcut-Rerouted Adapter Training,\nconfounding factors are routed through auxiliary modules, such as ControlNet or\nLoRA, eliminating the incentive for the adapter to internalize them. The\nauxiliary modules are then removed during inference. When applied to tasks like\nfacial and full-body identity injection, our approach improves generation\nquality, diversity, and prompt adherence. These results point to a general\ndesign principle in the era of large models: when seeking disentangled\nrepresentations, the most effective path may be to establish shortcuts for what\nshould NOT be learned."}
{"id": "2510.20838", "categories": ["cs.AI", "cs.MA"], "pdf": "https://arxiv.org/pdf/2510.20838", "abs": "https://arxiv.org/abs/2510.20838", "authors": ["Abir Khan Ratul", "Sanjay Acharjee", "Somin Park", "Md Nazmus Sakib"], "title": "Sketch2BIM: A Multi-Agent Human-AI Collaborative Pipeline to Convert Hand-Drawn Floor Plans to 3D BIM", "comment": null, "summary": "This study introduces a human-in-the-loop pipeline that converts unscaled,\nhand-drawn floor plan sketches into semantically consistent 3D BIM models. The\nworkflow leverages multimodal large language models (MLLMs) within a\nmulti-agent framework, combining perceptual extraction, human feedback, schema\nvalidation, and automated BIM scripting. Initially, sketches are iteratively\nrefined into a structured JSON layout of walls, doors, and windows. Later,\nthese layouts are transformed into executable scripts that generate 3D BIM\nmodels. Experiments on ten diverse floor plans demonstrate strong convergence:\nopenings (doors, windows) are captured with high reliability in the initial\npass, while wall detection begins around 83% and achieves near-perfect\nalignment after a few feedback iterations. Across all categories, precision,\nrecall, and F1 scores remain above 0.83, and geometric errors (RMSE, MAE)\nprogressively decrease to zero through feedback corrections. This study\ndemonstrates how MLLM-driven multi-agent reasoning can make BIM creation\naccessible to both experts and non-experts using only freehand sketches."}
{"id": "2510.21518", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21518", "abs": "https://arxiv.org/abs/2510.21518", "authors": ["Lorenzo Basile", "Valentino Maiorca", "Diego Doimo", "Francesco Locatello", "Alberto Cazzaniga"], "title": "Head Pursuit: Probing Attention Specialization in Multimodal Transformers", "comment": "Accepted at NeurIPS 2025 (spotlight)", "summary": "Language and vision-language models have shown impressive performance across\na wide range of tasks, but their internal mechanisms remain only partly\nunderstood. In this work, we study how individual attention heads in\ntext-generative models specialize in specific semantic or visual attributes.\nBuilding on an established interpretability method, we reinterpret the practice\nof probing intermediate activations with the final decoding layer through the\nlens of signal processing. This lets us analyze multiple samples in a\nprincipled way and rank attention heads based on their relevance to target\nconcepts. Our results show consistent patterns of specialization at the head\nlevel across both unimodal and multimodal transformers. Remarkably, we find\nthat editing as few as 1% of the heads, selected using our method, can reliably\nsuppress or enhance targeted concepts in the model output. We validate our\napproach on language tasks such as question answering and toxicity mitigation,\nas well as vision-language tasks including image classification and captioning.\nOur findings highlight an interpretable and controllable structure within\nattention layers, offering simple tools for understanding and editing\nlarge-scale generative models."}
{"id": "2510.20888", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20888", "abs": "https://arxiv.org/abs/2510.20888", "authors": ["Yuxuan Bian", "Xin Chen", "Zenan Li", "Tiancheng Zhi", "Shen Sang", "Linjie Luo", "Qiang Xu"], "title": "Video-As-Prompt: Unified Semantic Control for Video Generation", "comment": "Website: https://bytedance.github.io/Video-As-Prompt", "summary": "Unified, generalizable semantic control in video generation remains a\ncritical open challenge. Existing methods either introduce artifacts by\nenforcing inappropriate pixel-wise priors from structure-based controls, or\nrely on non-generalizable, condition-specific finetuning or task-specific\narchitectures. We introduce Video-As-Prompt (VAP), a new paradigm that reframes\nthis problem as in-context generation. VAP leverages a reference video as a\ndirect semantic prompt, guiding a frozen Video Diffusion Transformer (DiT) via\na plug-and-play Mixture-of-Transformers (MoT) expert. This architecture\nprevents catastrophic forgetting and is guided by a temporally biased position\nembedding that eliminates spurious mapping priors for robust context retrieval.\nTo power this approach and catalyze future research, we built VAP-Data, the\nlargest dataset for semantic-controlled video generation with over 100K paired\nvideos across 100 semantic conditions. As a single unified model, VAP sets a\nnew state-of-the-art for open-source methods, achieving a 38.7% user preference\nrate that rivals leading condition-specific commercial models. VAP's strong\nzero-shot generalization and support for various downstream applications mark a\nsignificant advance toward general-purpose, controllable video generation."}
{"id": "2510.21093", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21093", "abs": "https://arxiv.org/abs/2510.21093", "authors": ["Siyong Chen", "Jinbo Wen", "Jiawen Kang", "Tenghui Huang", "Xumin Huang", "Yuanjia Su", "Hudan Pan", "Zishao Zhong", "Dusit Niyato", "Shengli Xie", "Dong In Kim"], "title": "MedAlign: A Synergistic Framework of Multimodal Preference Optimization and Federated Meta-Cognitive Reasoning", "comment": null, "summary": "Recently, large models have shown significant potential for smart healthcare.\nHowever, the deployment of Large Vision-Language Models (LVLMs) for clinical\nservices is currently hindered by three critical challenges: a tendency to\nhallucinate answers not grounded in visual evidence, the inefficiency of\nfixed-depth reasoning, and the difficulty of multi-institutional collaboration.\nTo address these challenges, in this paper, we develop MedAlign, a novel\nframework to ensure visually accurate LVLM responses for Medical Visual\nQuestion Answering (Med-VQA). Specifically, we first propose a multimodal\nDirect Preference Optimization (mDPO) objective to explicitly align preference\nlearning with visual context. We then design a Retrieval-Aware\nMixture-of-Experts (RA-MoE) architecture that utilizes image and text\nsimilarity to route queries to a specialized and context-augmented LVLM (i.e.,\nan expert), thereby mitigating hallucinations in LVLMs. To achieve adaptive\nreasoning and facilitate multi-institutional collaboration, we propose a\nfederated governance mechanism, where the selected expert, fine-tuned on\nclinical datasets based on mDPO, locally performs iterative Chain-of-Thought\n(CoT) reasoning via the local meta-cognitive uncertainty estimator. Extensive\nexperiments on three representative Med-VQA datasets demonstrate that MedAlign\nachieves state-of-the-art performance, outperforming strong retrieval-augmented\nbaselines by up to $11.85\\%$ in F1-score, and simultaneously reducing the\naverage reasoning length by $51.60\\%$ compared with fixed-depth CoT approaches."}
{"id": "2510.20951", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.20951", "abs": "https://arxiv.org/abs/2510.20951", "authors": ["Mattie Tesfaldet", "Adam W. Harley", "Konstantinos G. Derpanis", "Derek Nowrouzezahrai", "Christopher Pal"], "title": "Generative Point Tracking with Flow Matching", "comment": "Project page: https://mtesfaldet.net/genpt_projpage/", "summary": "Tracking a point through a video can be a challenging task due to uncertainty\narising from visual obfuscations, such as appearance changes and occlusions.\nAlthough current state-of-the-art discriminative models excel in regressing\nlong-term point trajectory estimates -- even through occlusions -- they are\nlimited to regressing to a mean (or mode) in the presence of uncertainty, and\nfail to capture multi-modality. To overcome this limitation, we introduce\nGenerative Point Tracker (GenPT), a generative framework for modelling\nmulti-modal trajectories. GenPT is trained with a novel flow matching\nformulation that combines the iterative refinement of discriminative trackers,\na window-dependent prior for cross-window consistency, and a variance schedule\ntuned specifically for point coordinates. We show how our model's generative\ncapabilities can be leveraged to improve point trajectory estimates by\nutilizing a best-first search strategy on generated samples during inference,\nguided by the model's own confidence of its predictions. Empirically, we\nevaluate GenPT against the current state of the art on the standard\nPointOdyssey, Dynamic Replica, and TAP-Vid benchmarks. Further, we introduce a\nTAP-Vid variant with additional occlusions to assess occluded point tracking\nperformance and highlight our model's ability to capture multi-modality. GenPT\nis capable of capturing the multi-modality in point trajectories, which\ntranslates to state-of-the-art tracking accuracy on occluded points, while\nmaintaining competitive tracking accuracy on visible points compared to extant\ndiscriminative point trackers."}
{"id": "2510.21175", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21175", "abs": "https://arxiv.org/abs/2510.21175", "authors": ["Yujin Jo", "Taesup Kim"], "title": "Memory-Free Continual Learning with Null Space Adaptation for Zero-Shot Vision-Language Models", "comment": null, "summary": "Pre-trained vision-language models (VLMs), such as CLIP, have demonstrated\nremarkable zero-shot generalization, enabling deployment in a wide range of\nreal-world tasks without additional task-specific training. However, in real\ndeployment scenarios with evolving environments or emerging classes, these\nmodels inevitably face distributional shifts and novel tasks. In such contexts,\nstatic zero-shot capabilities are insufficient, and there is a growing need for\ncontinual learning methods that allow models to adapt over time while avoiding\ncatastrophic forgetting. We introduce NuSA-CL (Null Space Adaptation for\nContinual Learning), a lightweight memory-free continual learning framework\ndesigned to address this challenge. NuSA-CL employs low-rank adaptation and\nconstrains task-specific weight updates to lie within an approximate null space\nof the model's current parameters. This strategy minimizes interference with\npreviously acquired knowledge, effectively preserving the zero-shot\ncapabilities of the original model. Unlike methods relying on replay buffers or\ncostly distillation, NuSA-CL imposes minimal computational and memory overhead,\nmaking it practical for deployment in resource-constrained, real-world\ncontinual learning environments. Experiments show that our framework not only\neffectively preserves zero-shot transfer capabilities but also achieves highly\ncompetitive performance on continual learning benchmarks. These results\nposition NuSA-CL as a practical and scalable solution for continually evolving\nzero-shot VLMs in real-world applications."}
{"id": "2510.20967", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20967", "abs": "https://arxiv.org/abs/2510.20967", "authors": ["Sraavya Sambara", "Sung Eun Kim", "Xiaoman Zhang", "Luyang Luo", "Shreya Johri", "Mohammed Baharoon", "Du Hyun Ro", "Pranav Rajpurkar"], "title": "3DReasonKnee: Advancing Grounded Reasoning in Medical Vision Language Models", "comment": null, "summary": "Current Vision-Language Models (VLMs) struggle to ground anatomical regions\nin 3D medical images and reason about them in a step-by-step manner, a key\nrequirement of real-world diagnostic assessment. This ability is essential for\naligning model outputs with the diagnostic workflows clinicians use in\npractice, enabling trustworthy clinician-AI collaboration. Existing 3D datasets\nprovide localization labels, but none support this \"grounded reasoning\"\nability. To address this gap, we introduce 3DReasonKnee, the first 3D grounded\nreasoning dataset for medical images, which provides 494k high-quality\nquintuples derived from 7,970 3D knee MRI volumes. Each quintuple includes: (1)\nthe 3D MRI volume, (2) a diagnostic question targeting a specific anatomical\nregion (3) a 3D bounding box localizing the relevant anatomical structures, (4)\nclinician-generated diagnostic reasoning steps that explicitly detail the 3D\nreasoning process, and (5) structured severity assessments for the relevant\nanatomical region. The creation and validation of 3DReasonKnee, involving over\n450 hours of expert clinician time for manually segmenting MRIs and generating\nreasoning chains, ensures its superior quality and clinical relevance. We\nestablish ReasonKnee-Bench to evaluate localization and diagnostic accuracy,\nproviding insight into VLM ability to perform grounding and severity assessment\nacross anatomical regions and diagnostic inquiries. We benchmark five\nstate-of-the-art VLMs, providing baseline performance for ReasonKnee-Bench. By\nproviding this unique resource of expert-annotated 3D reasoning pathways,\n3DReasonKnee serves as a repository of orthopedic surgeons' diagnostic\nexpertise and offers a vital testbed for advancing multimodal medical AI\nsystems towards 3D, clinically aligned, localized decision-making capabilities.\nThe dataset can be found in:\nhttps://huggingface.co/datasets/rajpurkarlab/3DReasonKnee"}
{"id": "2510.21679", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21679", "abs": "https://arxiv.org/abs/2510.21679", "authors": ["Gaku Morio", "Harri Rowlands", "Dominik Stammbach", "Christopher D. Manning", "Peter Henderson"], "title": "A Multimodal Benchmark for Framing of Oil & Gas Advertising and Potential Greenwashing Detection", "comment": "Forthcoming in NeurIPS 2025 Datasets and Benchmarks Track", "summary": "Companies spend large amounts of money on public relations campaigns to\nproject a positive brand image. However, sometimes there is a mismatch between\nwhat they say and what they do. Oil & gas companies, for example, are accused\nof \"greenwashing\" with imagery of climate-friendly initiatives. Understanding\nthe framing, and changes in framing, at scale can help better understand the\ngoals and nature of public relations campaigns. To address this, we introduce a\nbenchmark dataset of expert-annotated video ads obtained from Facebook and\nYouTube. The dataset provides annotations for 13 framing types for more than 50\ncompanies or advocacy groups across 20 countries. Our dataset is especially\ndesigned for the evaluation of vision-language models (VLMs), distinguishing it\nfrom past text-only framing datasets. Baseline experiments show some promising\nresults, while leaving room for improvement for future work: GPT-4.1 can detect\nenvironmental messages with 79% F1 score, while our best model only achieves\n46% F1 score on identifying framing around green innovation. We also identify\nchallenges that VLMs must address, such as implicit framing, handling videos of\nvarious lengths, or implicit cultural backgrounds. Our dataset contributes to\nresearch in multimodal analysis of strategic communication in the energy\nsector."}
{"id": "2510.21069", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.21069", "abs": "https://arxiv.org/abs/2510.21069", "authors": ["Pranav Saxena", "Jimmy Chiun"], "title": "ZING-3D: Zero-shot Incremental 3D Scene Graphs via Vision-Language Models", "comment": null, "summary": "Understanding and reasoning about complex 3D environments requires structured\nscene representations that capture not only objects but also their semantic and\nspatial relationships. While recent works on 3D scene graph generation have\nleveraged pretrained VLMs without task-specific fine-tuning, they are largely\nconfined to single-view settings, fail to support incremental updates as new\nobservations arrive and lack explicit geometric grounding in 3D space, all of\nwhich are essential for embodied scenarios. In this paper, we propose, ZING-3D,\na framework that leverages the vast knowledge of pretrained foundation models\nto enable open-vocabulary recognition and generate a rich semantic\nrepresentation of the scene in a zero-shot manner while also enabling\nincremental updates and geometric grounding in 3D space, making it suitable for\ndownstream robotics applications. Our approach leverages VLM reasoning to\ngenerate a rich 2D scene graph, which is grounded in 3D using depth\ninformation. Nodes represent open-vocabulary objects with features, 3D\nlocations, and semantic context, while edges capture spatial and semantic\nrelations with inter-object distances. Our experiments on scenes from the\nReplica and HM3D dataset show that ZING-3D is effective at capturing spatial\nand relational knowledge without the need of task-specific training."}
{"id": "2510.20887", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20887", "abs": "https://arxiv.org/abs/2510.20887", "authors": ["Anujraaj Argo Goyal", "Guocheng Gordon Qian", "Huseyin Coskun", "Aarush Gupta", "Himmy Tam", "Daniil Ostashev", "Ju Hu", "Dhritiman Sagar", "Sergey Tulyakov", "Kfir Aberman", "Kuan-Chieh Jackson Wang"], "title": "Preventing Shortcuts in Adapter Training via Providing the Shortcuts", "comment": "Accepted to NeurIPS 2025, webpage:\n  https://snap-research.github.io/shortcut-rerouting/", "summary": "Adapter-based training has emerged as a key mechanism for extending the\ncapabilities of powerful foundation image generators, enabling personalized and\nstylized text-to-image synthesis. These adapters are typically trained to\ncapture a specific target attribute, such as subject identity, using\nsingle-image reconstruction objectives. However, because the input image\ninevitably contains a mixture of visual factors, adapters are prone to entangle\nthe target attribute with incidental ones, such as pose, expression, and\nlighting. This spurious correlation problem limits generalization and obstructs\nthe model's ability to adhere to the input text prompt. In this work, we\nuncover a simple yet effective solution: provide the very shortcuts we wish to\neliminate during adapter training. In Shortcut-Rerouted Adapter Training,\nconfounding factors are routed through auxiliary modules, such as ControlNet or\nLoRA, eliminating the incentive for the adapter to internalize them. The\nauxiliary modules are then removed during inference. When applied to tasks like\nfacial and full-body identity injection, our approach improves generation\nquality, diversity, and prompt adherence. These results point to a general\ndesign principle in the era of large models: when seeking disentangled\nrepresentations, the most effective path may be to establish shortcuts for what\nshould NOT be learned."}
{"id": "2510.21083", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21083", "abs": "https://arxiv.org/abs/2510.21083", "authors": ["Youssef Megahed", "Atallah Madi", "Dina El Demellawy", "Adrian D. C. Chan"], "title": "Knowledge-Driven Vision-Language Model for Plexus Detection in Hirschsprung's Disease", "comment": "Accepted into the ICAAI 2025 - The 9th International Conference on\n  Advances in Artificial Intelligence", "summary": "Hirschsprung's disease is defined as the congenital absence of ganglion cells\nin some segment(s) of the colon. The muscle cannot make coordinated movements\nto propel stool in that section, most commonly leading to obstruction. The\ndiagnosis and treatment for this disease require a clear identification of\ndifferent region(s) of the myenteric plexus, where ganglion cells should be\npresent, on the microscopic view of the tissue slide. While deep learning\napproaches, such as Convolutional Neural Networks, have performed very well in\nthis task, they are often treated as black boxes, with minimal understanding\ngained from them, and may not conform to how a physician makes decisions. In\nthis study, we propose a novel framework that integrates expert-derived textual\nconcepts into a Contrastive Language-Image Pre-training-based vision-language\nmodel to guide plexus classification. Using prompts derived from expert sources\n(e.g., medical textbooks and papers) generated by large language models and\nreviewed by our team before being encoded with QuiltNet, our approach aligns\nclinically relevant semantic cues with visual features. Experimental results\nshow that the proposed model demonstrated superior discriminative capability\nacross different classification metrics as it outperformed CNN-based models,\nincluding VGG-19, ResNet-18, and ResNet-50; achieving an accuracy of 83.9%, a\nprecision of 86.6%, and a specificity of 87.6%. These findings highlight the\npotential of multi-modal learning in histopathology and underscore the value of\nincorporating expert knowledge for more clinically relevant model outputs."}
{"id": "2510.20888", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20888", "abs": "https://arxiv.org/abs/2510.20888", "authors": ["Yuxuan Bian", "Xin Chen", "Zenan Li", "Tiancheng Zhi", "Shen Sang", "Linjie Luo", "Qiang Xu"], "title": "Video-As-Prompt: Unified Semantic Control for Video Generation", "comment": "Website: https://bytedance.github.io/Video-As-Prompt", "summary": "Unified, generalizable semantic control in video generation remains a\ncritical open challenge. Existing methods either introduce artifacts by\nenforcing inappropriate pixel-wise priors from structure-based controls, or\nrely on non-generalizable, condition-specific finetuning or task-specific\narchitectures. We introduce Video-As-Prompt (VAP), a new paradigm that reframes\nthis problem as in-context generation. VAP leverages a reference video as a\ndirect semantic prompt, guiding a frozen Video Diffusion Transformer (DiT) via\na plug-and-play Mixture-of-Transformers (MoT) expert. This architecture\nprevents catastrophic forgetting and is guided by a temporally biased position\nembedding that eliminates spurious mapping priors for robust context retrieval.\nTo power this approach and catalyze future research, we built VAP-Data, the\nlargest dataset for semantic-controlled video generation with over 100K paired\nvideos across 100 semantic conditions. As a single unified model, VAP sets a\nnew state-of-the-art for open-source methods, achieving a 38.7% user preference\nrate that rivals leading condition-specific commercial models. VAP's strong\nzero-shot generalization and support for various downstream applications mark a\nsignificant advance toward general-purpose, controllable video generation."}
{"id": "2510.21111", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21111", "abs": "https://arxiv.org/abs/2510.21111", "authors": ["Weijie Zhou", "Xuantang Xiong", "Yi Peng", "Manli Tao", "Chaoyang Zhao", "Honghui Dong", "Ming Tang", "Jinqiao Wang"], "title": "PhysVLM-AVR: Active Visual Reasoning for Multimodal Large Language Models in Physical Environments", "comment": "39th Conference on Neural Information Processing Systemss (NeurIPS\n  2025)", "summary": "Visual reasoning in multimodal large language models (MLLMs) has primarily\nbeen studied in static, fully observable settings, limiting their effectiveness\nin real-world environments where information is often incomplete due to\nocclusion or limited field of view. Humans, in contrast, actively explore and\ninteract with their environment-moving, examining, and manipulating objects-to\ngather information through a closed-loop process integrating perception,\nreasoning, and action. Inspired by this human capability, we introduce the\nActive Visual Reasoning (AVR) task, extending visual reasoning to partially\nobservable, interactive environments. AVR necessitates agents to: (1) actively\nacquire information via sequential physical actions, (2) integrate observations\nacross multiple steps for coherent reasoning, and (3) dynamically adjust\ndecisions based on evolving visual feedback. To rigorously evaluate AVR, we\nintroduce CLEVR-AVR, a simulation benchmark featuring multi-round interactive\nenvironments designed to assess both reasoning correctness and\ninformation-gathering efficiency. We present AVR-152k, a large-scale dataset\nthat offers rich Chain-of-Thought (CoT) annotations detailing iterative\nreasoning for uncertainty identification, action-conditioned information gain\nprediction, and information-maximizing action selection, crucial for training\nagents in a higher-order Markov Decision Process. Building on this, we develop\nPhysVLM-AVR, an MLLM achieving state-of-the-art performance on CLEVR-AVR,\nembodied reasoning (OpenEQA, RoboVQA), and passive visual reasoning (GeoMath,\nGeometry30K). Our analysis also reveals that current embodied MLLMs, despite\ndetecting information incompleteness, struggle to actively acquire and\nintegrate new information through interaction, highlighting a fundamental gap\nin active reasoning capabilities."}
{"id": "2510.20967", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.20967", "abs": "https://arxiv.org/abs/2510.20967", "authors": ["Sraavya Sambara", "Sung Eun Kim", "Xiaoman Zhang", "Luyang Luo", "Shreya Johri", "Mohammed Baharoon", "Du Hyun Ro", "Pranav Rajpurkar"], "title": "3DReasonKnee: Advancing Grounded Reasoning in Medical Vision Language Models", "comment": null, "summary": "Current Vision-Language Models (VLMs) struggle to ground anatomical regions\nin 3D medical images and reason about them in a step-by-step manner, a key\nrequirement of real-world diagnostic assessment. This ability is essential for\naligning model outputs with the diagnostic workflows clinicians use in\npractice, enabling trustworthy clinician-AI collaboration. Existing 3D datasets\nprovide localization labels, but none support this \"grounded reasoning\"\nability. To address this gap, we introduce 3DReasonKnee, the first 3D grounded\nreasoning dataset for medical images, which provides 494k high-quality\nquintuples derived from 7,970 3D knee MRI volumes. Each quintuple includes: (1)\nthe 3D MRI volume, (2) a diagnostic question targeting a specific anatomical\nregion (3) a 3D bounding box localizing the relevant anatomical structures, (4)\nclinician-generated diagnostic reasoning steps that explicitly detail the 3D\nreasoning process, and (5) structured severity assessments for the relevant\nanatomical region. The creation and validation of 3DReasonKnee, involving over\n450 hours of expert clinician time for manually segmenting MRIs and generating\nreasoning chains, ensures its superior quality and clinical relevance. We\nestablish ReasonKnee-Bench to evaluate localization and diagnostic accuracy,\nproviding insight into VLM ability to perform grounding and severity assessment\nacross anatomical regions and diagnostic inquiries. We benchmark five\nstate-of-the-art VLMs, providing baseline performance for ReasonKnee-Bench. By\nproviding this unique resource of expert-annotated 3D reasoning pathways,\n3DReasonKnee serves as a repository of orthopedic surgeons' diagnostic\nexpertise and offers a vital testbed for advancing multimodal medical AI\nsystems towards 3D, clinically aligned, localized decision-making capabilities.\nThe dataset can be found in:\nhttps://huggingface.co/datasets/rajpurkarlab/3DReasonKnee"}
{"id": "2510.21120", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21120", "abs": "https://arxiv.org/abs/2510.21120", "authors": ["Alec Helbling", "Shruti Palaskar", "Kundan Krishna", "Polo Chau", "Leon Gatys", "Joseph Yitan Cheng"], "title": "SafetyPairs: Isolating Safety Critical Image Features with Counterfactual Image Generation", "comment": null, "summary": "What exactly makes a particular image unsafe? Systematically differentiating\nbetween benign and problematic images is a challenging problem, as subtle\nchanges to an image, such as an insulting gesture or symbol, can drastically\nalter its safety implications. However, existing image safety datasets are\ncoarse and ambiguous, offering only broad safety labels without isolating the\nspecific features that drive these differences. We introduce SafetyPairs, a\nscalable framework for generating counterfactual pairs of images, that differ\nonly in the features relevant to the given safety policy, thus flipping their\nsafety label. By leveraging image editing models, we make targeted changes to\nimages that alter their safety labels while leaving safety-irrelevant details\nunchanged. Using SafetyPairs, we construct a new safety benchmark, which serves\nas a powerful source of evaluation data that highlights weaknesses in\nvision-language models' abilities to distinguish between subtly different\nimages. Beyond evaluation, we find our pipeline serves as an effective data\naugmentation strategy that improves the sample efficiency of training\nlightweight guard models. We release a benchmark containing over 3,020\nSafetyPair images spanning a diverse taxonomy of 9 safety categories, providing\nthe first systematic resource for studying fine-grained image safety\ndistinctions."}
{"id": "2510.21049", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21049", "abs": "https://arxiv.org/abs/2510.21049", "authors": ["Atoosa Chegini", "Hamid Kazemi", "Garrett Souza", "Maria Safi", "Yang Song", "Samy Bengio", "Sinead Williamson", "Mehrdad Farajtabar"], "title": "Reasoning's Razor: Reasoning Improves Accuracy but Can Hurt Recall at Critical Operating Points in Safety and Hallucination Detection", "comment": null, "summary": "Reasoning has become a central paradigm for large language models (LLMs),\nconsistently boosting accuracy across diverse benchmarks. Yet its suitability\nfor precision-sensitive tasks remains unclear. We present the first systematic\nstudy of reasoning for classification tasks under strict low false positive\nrate (FPR) regimes. Our analysis covers two tasks--safety detection and\nhallucination detection--evaluated in both fine-tuned and zero-shot settings,\nusing standard LLMs and Large Reasoning Models (LRMs). Our results reveal a\nclear trade-off: Think On (reasoning-augmented) generation improves overall\naccuracy, but underperforms at the low-FPR thresholds essential for practical\nuse. In contrast, Think Off (no reasoning during inference) dominates in these\nprecision-sensitive regimes, with Think On surpassing only when higher FPRs are\nacceptable. In addition, we find token-based scoring substantially outperforms\nself-verbalized confidence for precision-sensitive deployments. Finally, a\nsimple ensemble of the two modes recovers the strengths of each. Taken\ntogether, our findings position reasoning as a double-edged tool: beneficial\nfor average accuracy, but often ill-suited for applications requiring strict\nprecision."}
{"id": "2510.21122", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21122", "abs": "https://arxiv.org/abs/2510.21122", "authors": ["Longtian Qiu", "Shan Ning", "Jiaxuan Sun", "Xuming He"], "title": "NoisyGRPO: Incentivizing Multimodal CoT Reasoning via Noise Injection and Bayesian Estimation", "comment": "Accepted by Neurips2025, Project page at at\n  https://artanic30.github.io/project_pages/NoisyGRPO/", "summary": "Reinforcement learning (RL) has shown promise in enhancing the general\nChain-of-Thought (CoT) reasoning capabilities of multimodal large language\nmodels (MLLMs). However, when applied to improve general CoT reasoning,\nexisting RL frameworks often struggle to generalize beyond the training\ndistribution. To address this, we propose NoisyGRPO, a systematic multimodal RL\nframework that introduces controllable noise into visual inputs for enhanced\nexploration and explicitly models the advantage estimation process via a\nBayesian framework. Specifically, NoisyGRPO improves RL training by: (1)\n\\textbf{Noise-Injected Exploration Policy}: Perturbing visual inputs with\nGaussian noise to encourage exploration across a wider range of visual\nscenarios; and (2) \\textbf{Bayesian Advantage Estimation}: Formulating\nadvantage estimation as a principled Bayesian inference problem, where the\ninjected noise level serves as a prior and the observed trajectory reward as\nthe likelihood. This Bayesian modeling fuses both sources of information to\ncompute a robust posterior estimate of trajectory advantage, effectively\nguiding MLLMs to prefer visually grounded trajectories over noisy ones.\nExperiments on standard CoT quality, general capability, and hallucination\nbenchmarks demonstrate that NoisyGRPO substantially improves generalization and\nrobustness, especially in RL settings with small-scale MLLMs such as Qwen2.5-VL\n3B. The project page is available at\n\\href{https://artanic30.github.io/project_pages/NoisyGRPO/}{\\texttt{https://artanic30.github.io/project\\_pages/NoisyGRPO}}."}
{"id": "2510.21346", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21346", "abs": "https://arxiv.org/abs/2510.21346", "authors": ["Lemin Liu", "Fangchao Hu", "Honghua Jiang", "Yaru Chen", "Limin Liu", "Yongliang Qiao"], "title": "CT-CLIP: A Multi-modal Fusion Framework for Robust Apple Leaf Disease Recognition in Complex Environments", "comment": null, "summary": "In complex orchard environments, the phenotypic heterogeneity of different\napple leaf diseases, characterized by significant variation among lesions,\nposes a challenge to traditional multi-scale feature fusion methods. These\nmethods only integrate multi-layer features extracted by convolutional neural\nnetworks (CNNs) and fail to adequately account for the relationships between\nlocal and global features. Therefore, this study proposes a multi-branch\nrecognition framework named CNN-Transformer-CLIP (CT-CLIP). The framework\nsynergistically employs a CNN to extract local lesion detail features and a\nVision Transformer to capture global structural relationships. An Adaptive\nFeature Fusion Module (AFFM) then dynamically fuses these features, achieving\noptimal coupling of local and global information and effectively addressing the\ndiversity in lesion morphology and distribution. Additionally, to mitigate\ninterference from complex backgrounds and significantly enhance recognition\naccuracy under few-shot conditions, this study proposes a multimodal image-text\nlearning approach. By leveraging pre-trained CLIP weights, it achieves deep\nalignment between visual features and disease semantic descriptions.\nExperimental results show that CT-CLIP achieves accuracies of 97.38% and 96.12%\non a publicly available apple disease and a self-built dataset, outperforming\nseveral baseline methods. The proposed CT-CLIP demonstrates strong capabilities\nin recognizing agricultural diseases, significantly enhances identification\naccuracy under complex environmental conditions, provides an innovative and\npractical solution for automated disease recognition in agricultural\napplications."}
{"id": "2510.21160", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21160", "abs": "https://arxiv.org/abs/2510.21160", "authors": ["Guanlin Wu", "Boyan Su", "Yang Zhao", "Pu Wang", "Yichen Lin", "Hao Frank Yang"], "title": "Towards Physics-informed Spatial Intelligence with Human Priors: An Autonomous Driving Pilot Study", "comment": "NeurIPS 2025 (Spotlight)", "summary": "How to integrate and verify spatial intelligence in foundation models remains\nan open challenge. Current practice often proxies Visual-Spatial Intelligence\n(VSI) with purely textual prompts and VQA-style scoring, which obscures\ngeometry, invites linguistic shortcuts, and weakens attribution to genuinely\nspatial skills. We introduce Spatial Intelligence Grid (SIG): a structured,\ngrid-based schema that explicitly encodes object layouts, inter-object\nrelations, and physically grounded priors. As a complementary channel to text,\nSIG provides a faithful, compositional representation of scene structure for\nfoundation-model reasoning. Building on SIG, we derive SIG-informed evaluation\nmetrics that quantify a model's intrinsic VSI, which separates spatial\ncapability from language priors. In few-shot in-context learning with\nstate-of-the-art multimodal LLMs (e.g. GPT- and Gemini-family models), SIG\nyields consistently larger, more stable, and more comprehensive gains across\nall VSI metrics compared to VQA-only representations, indicating its promise as\na data-labeling and training schema for learning VSI. We also release SIGBench,\na benchmark of 1.4K driving frames annotated with ground-truth SIG labels and\nhuman gaze traces, supporting both grid-based machine VSI tasks and\nattention-driven, human-like VSI tasks in autonomous-driving scenarios."}
{"id": "2510.21445", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21445", "abs": "https://arxiv.org/abs/2510.21445", "authors": ["Thanh Cong Ho", "Farah Kharrat", "Abderrazek Abid", "Fakhri Karray"], "title": "REMONI: An Autonomous System Integrating Wearables and Multimodal Large Language Models for Enhanced Remote Health Monitoring", "comment": null, "summary": "With the widespread adoption of wearable devices in our daily lives, the\ndemand and appeal for remote patient monitoring have significantly increased.\nMost research in this field has concentrated on collecting sensor data,\nvisualizing it, and analyzing it to detect anomalies in specific diseases such\nas diabetes, heart disease and depression. However, this domain has a notable\ngap in the aspect of human-machine interaction. This paper proposes REMONI, an\nautonomous REmote health MONItoring system that integrates multimodal large\nlanguage models (MLLMs), the Internet of Things (IoT), and wearable devices.\nThe system automatically and continuously collects vital signs, accelerometer\ndata from a special wearable (such as a smartwatch), and visual data in patient\nvideo clips collected from cameras. This data is processed by an anomaly\ndetection module, which includes a fall detection model and algorithms to\nidentify and alert caregivers of the patient's emergency conditions. A\ndistinctive feature of our proposed system is the natural language processing\ncomponent, developed with MLLMs capable of detecting and recognizing a\npatient's activity and emotion while responding to healthcare worker's\ninquiries. Additionally, prompt engineering is employed to integrate all\npatient information seamlessly. As a result, doctors and nurses can access\nreal-time vital signs and the patient's current state and mood by interacting\nwith an intelligent agent through a user-friendly web application. Our\nexperiments demonstrate that our system is implementable and scalable for\nreal-life scenarios, potentially reducing the workload of medical professionals\nand healthcare costs. A full-fledged prototype illustrating the functionalities\nof the system has been developed and being tested to demonstrate the robustness\nof its various capabilities."}
{"id": "2510.21171", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21171", "abs": "https://arxiv.org/abs/2510.21171", "authors": ["Qihang Zhou", "Binbin Gao", "Guansong Pang", "Xin Wang", "Jiming Chen", "Shibo He"], "title": "TokenCLIP: Token-wise Prompt Learning for Zero-shot Anomaly Detection", "comment": null, "summary": "Adapting CLIP for anomaly detection on unseen objects has shown strong\npotential in a zero-shot manner. However, existing methods typically rely on a\nsingle textual space to align with visual semantics across diverse objects and\ndomains. The indiscriminate alignment hinders the model from accurately\ncapturing varied anomaly semantics. We propose TokenCLIP, a token-wise\nadaptation framework that enables dynamic alignment between visual and\nlearnable textual spaces for fine-grained anomaly learning. Rather than mapping\nall visual tokens to a single, token-agnostic textual space, TokenCLIP aligns\neach token with a customized textual subspace that represents its visual\ncharacteristics. Explicitly assigning a unique learnable textual space to each\ntoken is computationally intractable and prone to insufficient optimization. We\ninstead expand the token-agnostic textual space into a set of orthogonal\nsubspaces, and then dynamically assign each token to a subspace combination\nguided by semantic affinity, which jointly supports customized and efficient\ntoken-wise adaptation. To this end, we formulate dynamic alignment as an\noptimal transport problem, where all visual tokens in an image are transported\nto textual subspaces based on semantic similarity. The transport constraints of\nOT ensure sufficient optimization across subspaces and encourage them to focus\non different semantics. Solving the problem yields a transport plan that\nadaptively assigns each token to semantically relevant subspaces. A top-k\nmasking is then applied to sparsify the plan and specialize subspaces for\ndistinct visual regions. Extensive experiments demonstrate the superiority of\nTokenCLIP."}
{"id": "2510.21501", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21501", "abs": "https://arxiv.org/abs/2510.21501", "authors": ["Guanghao Zheng", "Bowen Shi", "Mingxing Xu", "Ruoyu Sun", "Peisen Zhao", "Zhibo Zhang", "Wenrui Dai", "Junni Zou", "Hongkai Xiong", "Xiaopeng Zhang", "Qi Tian"], "title": "GranViT: A Fine-Grained Vision Model With Autoregressive Perception For MLLMs", "comment": "21 pages, 6 figures", "summary": "Vision encoders are indispensable for allowing impressive performance of\nMulti-modal Large Language Models (MLLMs) in vision language tasks such as\nvisual question answering and reasoning. However, existing vision encoders\nfocus on global image representations but overlook fine-grained regional\nanalysis. They are limited in fine grained perception due to the scarcity of\nfine grained annotated data and the lack of a fine grained pre-training\nparadigm. In this paper, we propose GranViT, a novel Vision Transformer that\nintegrates fine-grained feature extraction with semantic alignment to Large\nLanguage Models (LLMs) via region level autoregressive training. We first\nconstruct Gran-29M, a dataset comprising 2million natural and OCR images paired\nwith over 180 million high-quality region-level annotations, to enable large\nscale fine grained pretraining. Consequently, we develop a\npretraining-adaptation framework along with a self distillation mechanism to\ntrain fine-grained GranViT on Gran-29M. We sufficiently exploit the\nfine-grained annotations from Gran-29M to resort to bounding-box-to-caption\nregression to enhance localized visual representation of the vision encoder in\nthe pretraining and caption-to-bounding-box regression to improve vision\nfeature utilization and localization for LLM in the adaptation. We further\nincorporate a self distillation mechanism that imposes explicit localization\nconstraints on the vision encoder to strengthen its regional reasoning\ncapability. Extensive experiments show that GranViT surpasses existing vision\nencoders and attains strong transferability to varying LLMs. Remarkably, it\nachieves state-of-the-art results on fine-grained recognition, multimodal VQA,\nand OCR understanding."}
{"id": "2510.21182", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.21182", "abs": "https://arxiv.org/abs/2510.21182", "authors": ["Junzhe Zhang", "Huixuan Zhang", "Xiaojun Wan"], "title": "KBE-DME: Dynamic Multimodal Evaluation via Knowledge Enhanced Benchmark Evolution", "comment": "submitting to ICLR2026", "summary": "The rapid progress of multimodal large language models (MLLMs) calls for more\nreliable evaluation protocols. Existing static benchmarks suffer from the\npotential risk of data contamination and saturation, leading to inflated or\nmisleading performance evaluations. To address these issues, we first apply\nGraph formulation to represent a static or dynamic VQA sample. With the\nformulation, we propose Knowledge-enhanced Benchmark Evolution(KBE), a dynamic\nmultimodal evaluation framework. KBE first analyzes the original static\nbenchmark, then expands it by integrating multimodal knowledge, transforming\nthe static benchmark into a controllable, dynamic evolving version. Crucially,\nKBE can both reconstruct questions by Re-selecting visual information in the\noriginal image and expand existing questions with external textual knowledge.\nIt enables difficulty-controllable evaluation by adjusting the degree of\nquestion exploration. Extensive experiments demonstrate that KBE alleviates the\nrisk of data contamination, data saturation, and provides a more comprehensive\nassessment of MLLM capabilities."}
{"id": "2510.21583", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21583", "abs": "https://arxiv.org/abs/2510.21583", "authors": ["Yifu Luo", "Penghui Du", "Bo Li", "Sinan Du", "Tiantian Zhang", "Yongzhe Chang", "Kai Wu", "Kun Gai", "Xueqian Wang"], "title": "Sample By Step, Optimize By Chunk: Chunk-Level GRPO For Text-to-Image Generation", "comment": "11 pages, preprint", "summary": "Group Relative Policy Optimization (GRPO) has shown strong potential for\nflow-matching-based text-to-image (T2I) generation, but it faces two key\nlimitations: inaccurate advantage attribution, and the neglect of temporal\ndynamics of generation. In this work, we argue that shifting the optimization\nparadigm from the step level to the chunk level can effectively alleviate these\nissues. Building on this idea, we propose Chunk-GRPO, the first chunk-level\nGRPO-based approach for T2I generation. The insight is to group consecutive\nsteps into coherent 'chunk's that capture the intrinsic temporal dynamics of\nflow matching, and to optimize policies at the chunk level. In addition, we\nintroduce an optional weighted sampling strategy to further enhance\nperformance. Extensive experiments show that ChunkGRPO achieves superior\nresults in both preference alignment and image quality, highlighting the\npromise of chunk-level optimization for GRPO-based methods."}
{"id": "2510.21307", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21307", "abs": "https://arxiv.org/abs/2510.21307", "authors": ["Bingchen Miao", "Rong Wei", "Zhiqi Ge", "Xiaoquan sun", "Shiqi Gao", "Jingzhe Zhu", "Renhan Wang", "Siliang Tang", "Jun Xiao", "Rui Tang", "Juncheng Li"], "title": "Towards Physically Executable 3D Gaussian for Embodied Navigation", "comment": "Download link of InteriorGS:\n  https://huggingface.co/datasets/spatialverse/InteriorGS", "summary": "3D Gaussian Splatting (3DGS), a 3D representation method with photorealistic\nreal-time rendering capabilities, is regarded as an effective tool for\nnarrowing the sim-to-real gap. However, it lacks fine-grained semantics and\nphysical executability for Visual-Language Navigation (VLN). To address this,\nwe propose SAGE-3D (Semantically and Physically Aligned Gaussian Environments\nfor 3D Navigation), a new paradigm that upgrades 3DGS into an executable,\nsemantically and physically aligned environment. It comprises two components:\n(1) Object-Centric Semantic Grounding, which adds object-level fine-grained\nannotations to 3DGS; and (2) Physics-Aware Execution Jointing, which embeds\ncollision objects into 3DGS and constructs rich physical interfaces. We release\nInteriorGS, containing 1K object-annotated 3DGS indoor scene data, and\nintroduce SAGE-Bench, the first 3DGS-based VLN benchmark with 2M VLN data.\nExperiments show that 3DGS scene data is more difficult to converge, while\nexhibiting strong generalizability, improving baseline performance by 31% on\nthe VLN-CE Unseen task. The data and code will be available soon."}
{"id": "2510.21311", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21311", "abs": "https://arxiv.org/abs/2510.21311", "authors": ["Lu Zhang", "Jiazuo Yu", "Haomiao Xiong", "Ping Hu", "Yunzhi Zhuge", "Huchuan Lu", "You He"], "title": "FineRS: Fine-grained Reasoning and Segmentation of Small Objects with Reinforcement Learning", "comment": "Accepted to NeurIPS 2025", "summary": "Multi-modal Large Language Models (MLLMs) have shown remarkable capabilities\nacross a wide range of vision-language tasks. However, due to the restricted\ninput resolutions, MLLMs face significant challenges in precisely understanding\nand localizing visual details in high-resolution images -- particularly when\ndealing with extra-small objects embedded in cluttered contexts. To address\nthis issue, we propose \\textsc{FineRS}, a two-stage MLLM-based reinforcement\nlearning framework for jointly reasoning and segmenting extremely small objects\nwithin high-resolution scenes. \\textsc{FineRS} adopts a coarse-to-fine pipeline\ncomprising Global Semantic Exploration (GSE) and Localized Perceptual\nRefinement (LPR). Specifically, GSE performs instruction-guided reasoning to\ngenerate a textural response and a coarse target region, while LPR refines this\nregion to produce an accurate bounding box and segmentation mask. To couple the\ntwo stages, we introduce a locate-informed retrospective reward, where LPR's\noutputs are used to optimize GSE for more robust coarse region exploration. %\nAdditionally, we present \\textsc{FineRS}-4k, a new dataset for evaluating MLLMs\non attribute-level reasoning and pixel-level segmentation on subtle,\nsmall-scale targets in complex high-resolution scenes. Experimental results on\n\\textsc{FineRS}-4k and public datasets demonstrate that our method consistently\noutperforms state-of-the-art MLLM-based approaches on both instruction-guided\nsegmentation and visual reasoning tasks."}
{"id": "2510.21323", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21323", "abs": "https://arxiv.org/abs/2510.21323", "authors": ["Shufan Shen", "Junshu Sun", "Qingming Huang", "Shuhui Wang"], "title": "VL-SAE: Interpreting and Enhancing Vision-Language Alignment with a Unified Concept Set", "comment": "Accepted by NeurIPS 2025", "summary": "The alignment of vision-language representations endows current\nVision-Language Models (VLMs) with strong multi-modal reasoning capabilities.\nHowever, the interpretability of the alignment component remains uninvestigated\ndue to the difficulty in mapping the semantics of multi-modal representations\ninto a unified concept set. To address this problem, we propose VL-SAE, a\nsparse autoencoder that encodes vision-language representations into its hidden\nactivations. Each neuron in its hidden layer correlates to a concept\nrepresented by semantically similar images and texts, thereby interpreting\nthese representations with a unified concept set. To establish the\nneuron-concept correlation, we encourage semantically similar representations\nto exhibit consistent neuron activations during self-supervised training.\nFirst, to measure the semantic similarity of multi-modal representations, we\nperform their alignment in an explicit form based on cosine similarity. Second,\nwe construct the VL-SAE with a distance-based encoder and two modality-specific\ndecoders to ensure the activation consistency of semantically similar\nrepresentations. Experiments across multiple VLMs (e.g., CLIP, LLaVA)\ndemonstrate the superior capability of VL-SAE in interpreting and enhancing the\nvision-language alignment. For interpretation, the alignment between vision and\nlanguage representations can be understood by comparing their semantics with\nconcepts. For enhancement, the alignment can be strengthened by aligning\nvision-language representations at the concept level, contributing to\nperformance improvements in downstream tasks, including zero-shot image\nclassification and hallucination elimination. Codes are available at\nhttps://github.com/ssfgunner/VL-SAE."}
{"id": "2510.21346", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21346", "abs": "https://arxiv.org/abs/2510.21346", "authors": ["Lemin Liu", "Fangchao Hu", "Honghua Jiang", "Yaru Chen", "Limin Liu", "Yongliang Qiao"], "title": "CT-CLIP: A Multi-modal Fusion Framework for Robust Apple Leaf Disease Recognition in Complex Environments", "comment": null, "summary": "In complex orchard environments, the phenotypic heterogeneity of different\napple leaf diseases, characterized by significant variation among lesions,\nposes a challenge to traditional multi-scale feature fusion methods. These\nmethods only integrate multi-layer features extracted by convolutional neural\nnetworks (CNNs) and fail to adequately account for the relationships between\nlocal and global features. Therefore, this study proposes a multi-branch\nrecognition framework named CNN-Transformer-CLIP (CT-CLIP). The framework\nsynergistically employs a CNN to extract local lesion detail features and a\nVision Transformer to capture global structural relationships. An Adaptive\nFeature Fusion Module (AFFM) then dynamically fuses these features, achieving\noptimal coupling of local and global information and effectively addressing the\ndiversity in lesion morphology and distribution. Additionally, to mitigate\ninterference from complex backgrounds and significantly enhance recognition\naccuracy under few-shot conditions, this study proposes a multimodal image-text\nlearning approach. By leveraging pre-trained CLIP weights, it achieves deep\nalignment between visual features and disease semantic descriptions.\nExperimental results show that CT-CLIP achieves accuracies of 97.38% and 96.12%\non a publicly available apple disease and a self-built dataset, outperforming\nseveral baseline methods. The proposed CT-CLIP demonstrates strong capabilities\nin recognizing agricultural diseases, significantly enhances identification\naccuracy under complex environmental conditions, provides an innovative and\npractical solution for automated disease recognition in agricultural\napplications."}
{"id": "2510.21406", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21406", "abs": "https://arxiv.org/abs/2510.21406", "authors": ["Yue Feng", "Jinwei Hu", "Qijia Lu", "Jiawei Niu", "Li Tan", "Shuo Yuan", "Ziyi Yan", "Yizhen Jia", "Qingzhi He", "Shiping Ge", "Ethan Q. Chen", "Wentong Li", "Limin Wang", "Jie Qin"], "title": "MUVR: A Multi-Modal Untrimmed Video Retrieval Benchmark with Multi-Level Visual Correspondence", "comment": "Accepted to NeurIPS 2025 D&B Track", "summary": "We propose the Multi-modal Untrimmed Video Retrieval task, along with a new\nbenchmark (MUVR) to advance video retrieval for long-video platforms. MUVR aims\nto retrieve untrimmed videos containing relevant segments using multi-modal\nqueries. It has the following features: 1) Practical retrieval paradigm: MUVR\nsupports video-centric multi-modal queries, expressing fine-grained retrieval\nneeds through long text descriptions, video tag prompts, and mask prompts. It\nadopts a one-to-many retrieval paradigm and focuses on untrimmed videos,\ntailored for long-video platform applications. 2) Multi-level visual\ncorrespondence: To cover common video categories (e.g., news, travel, dance)\nand precisely define retrieval matching criteria, we construct multi-level\nvisual correspondence based on core video content (e.g., news events, travel\nlocations, dance moves) which users are interested in and want to retrieve. It\ncovers six levels: copy, event, scene, instance, action, and others. 3)\nComprehensive evaluation criteria: We develop 3 versions of MUVR (i.e., Base,\nFilter, QA). MUVR-Base/Filter evaluates retrieval models, while MUVR-QA\nassesses MLLMs in a question-answering format. We also propose a Reranking\nScore to evaluate the reranking ability of MLLMs. MUVR consists of 53K\nuntrimmed videos from the video platform Bilibili, with 1,050 multi-modal\nqueries and 84K matches. Extensive evaluations of 3 state-of-the-art video\nretrieval models, 6 image-based VLMs, and 10 MLLMs are conducted. MUVR reveals\nthe limitations of retrieval methods in processing untrimmed videos and\nmulti-modal queries, as well as MLLMs in multi-video understanding and\nreranking. Our code and benchmark is available at\nhttps://github.com/debby-0527/MUVR."}
{"id": "2510.21412", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21412", "abs": "https://arxiv.org/abs/2510.21412", "authors": ["Whie Jung", "Semin Kim", "Junee Kim", "Seunghoon Hong"], "title": "Bridging the gap to real-world language-grounded visual concept learning", "comment": null, "summary": "Human intelligence effortlessly interprets visual scenes along a rich\nspectrum of semantic dimensions. However, existing approaches to\nlanguage-grounded visual concept learning are limited to a few predefined\nprimitive axes, such as color and shape, and are typically explored in\nsynthetic datasets. In this work, we propose a scalable framework that\nadaptively identifies image-related concept axes and grounds visual concepts\nalong these axes in real-world scenes. Leveraging a pretrained vision-language\nmodel and our universal prompting strategy, our framework identifies a diverse\nimage-related axes without any prior knowledge. Our universal concept encoder\nadaptively binds visual features to the discovered axes without introducing\nadditional model parameters for each concept. To ground visual concepts along\nthe discovered axes, we optimize a compositional anchoring objective, which\nensures that each axis can be independently manipulated without affecting\nothers. We demonstrate the effectiveness of our framework on subsets of\nImageNet, CelebA-HQ, and AFHQ, showcasing superior editing capabilities across\ndiverse real-world concepts that are too varied to be manually predefined. Our\nmethod also exhibits strong compositional generalization, outperforming\nexisting visual concept learning and text-based editing methods. The code is\navailable at https://github.com/whieya/Language-grounded-VCL."}
{"id": "2510.21449", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21449", "abs": "https://arxiv.org/abs/2510.21449", "authors": ["Shengtian Yang", "Yue Feng", "Yingshi Liu", "Jingrou Zhang", "Jie Qin"], "title": "MoniTor: Exploiting Large Language Models with Instruction for Online Video Anomaly Detection", "comment": "Accepted to NeurIPS 2025. The first two authors hold equal\n  contributions", "summary": "Video Anomaly Detection (VAD) aims to locate unusual activities or behaviors\nwithin videos. Recently, offline VAD has garnered substantial research\nattention, which has been invigorated by the progress in large language models\n(LLMs) and vision-language models (VLMs), offering the potential for a more\nnuanced understanding of anomalies. However, online VAD has seldom received\nattention due to real-time constraints and computational intensity. In this\npaper, we introduce a novel Memory-based online scoring queue scheme for\nTraining-free VAD (MoniTor), to address the inherent complexities in online\nVAD. Specifically, MoniTor applies a streaming input to VLMs, leveraging the\ncapabilities of pre-trained large-scale models. To capture temporal\ndependencies more effectively, we incorporate a novel prediction mechanism\ninspired by Long Short-Term Memory (LSTM) networks. This ensures the model can\neffectively model past states and leverage previous predictions to identify\nanomalous behaviors. Thereby, it better understands the current frame.\nMoreover, we design a scoring queue and an anomaly prior to dynamically store\nrecent scores and cover all anomalies in the monitoring scenario, providing\nguidance for LLMs to distinguish between normal and abnormal behaviors over\ntime. We evaluate MoniTor on two large datasets (i.e., UCF-Crime and\nXD-Violence) containing various surveillance and real-world scenarios. The\nresults demonstrate that MoniTor outperforms state-of-the-art methods and is\ncompetitive with weakly supervised methods without training. Code is available\nat https://github.com/YsTvT/MoniTor."}
{"id": "2510.21464", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21464", "abs": "https://arxiv.org/abs/2510.21464", "authors": ["Yiming Tang", "Wenjia Zhong", "Rushi Shah", "Dianbo Liu"], "title": "CXR-LanIC: Language-Grounded Interpretable Classifier for Chest X-Ray Diagnosis", "comment": null, "summary": "Deep learning models have achieved remarkable accuracy in chest X-ray\ndiagnosis, yet their widespread clinical adoption remains limited by the\nblack-box nature of their predictions. Clinicians require transparent,\nverifiable explanations to trust automated diagnoses and identify potential\nfailure modes. We introduce CXR-LanIC (Language-Grounded Interpretable\nClassifier for Chest X-rays), a novel framework that addresses this\ninterpretability challenge through task-aligned pattern discovery. Our approach\ntrains transcoder-based sparse autoencoders on a BiomedCLIP diagnostic\nclassifier to decompose medical image representations into interpretable visual\npatterns. By training an ensemble of 100 transcoders on multimodal embeddings\nfrom the MIMIC-CXR dataset, we discover approximately 5,000 monosemantic\npatterns spanning cardiac, pulmonary, pleural, structural, device, and artifact\ncategories. Each pattern exhibits consistent activation behavior across images\nsharing specific radiological features, enabling transparent attribution where\npredictions decompose into 20-50 interpretable patterns with verifiable\nactivation galleries. CXR-LanIC achieves competitive diagnostic accuracy on\nfive key findings while providing the foundation for natural language\nexplanations through planned large multimodal model annotation. Our key\ninnovation lies in extracting interpretable features from a classifier trained\non specific diagnostic objectives rather than general-purpose embeddings,\nensuring discovered patterns are directly relevant to clinical decision-making,\ndemonstrating that medical AI systems can be both accurate and interpretable,\nsupporting safer clinical deployment through transparent, clinically grounded\nexplanations."}
{"id": "2510.21501", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21501", "abs": "https://arxiv.org/abs/2510.21501", "authors": ["Guanghao Zheng", "Bowen Shi", "Mingxing Xu", "Ruoyu Sun", "Peisen Zhao", "Zhibo Zhang", "Wenrui Dai", "Junni Zou", "Hongkai Xiong", "Xiaopeng Zhang", "Qi Tian"], "title": "GranViT: A Fine-Grained Vision Model With Autoregressive Perception For MLLMs", "comment": "21 pages, 6 figures", "summary": "Vision encoders are indispensable for allowing impressive performance of\nMulti-modal Large Language Models (MLLMs) in vision language tasks such as\nvisual question answering and reasoning. However, existing vision encoders\nfocus on global image representations but overlook fine-grained regional\nanalysis. They are limited in fine grained perception due to the scarcity of\nfine grained annotated data and the lack of a fine grained pre-training\nparadigm. In this paper, we propose GranViT, a novel Vision Transformer that\nintegrates fine-grained feature extraction with semantic alignment to Large\nLanguage Models (LLMs) via region level autoregressive training. We first\nconstruct Gran-29M, a dataset comprising 2million natural and OCR images paired\nwith over 180 million high-quality region-level annotations, to enable large\nscale fine grained pretraining. Consequently, we develop a\npretraining-adaptation framework along with a self distillation mechanism to\ntrain fine-grained GranViT on Gran-29M. We sufficiently exploit the\nfine-grained annotations from Gran-29M to resort to bounding-box-to-caption\nregression to enhance localized visual representation of the vision encoder in\nthe pretraining and caption-to-bounding-box regression to improve vision\nfeature utilization and localization for LLM in the adaptation. We further\nincorporate a self distillation mechanism that imposes explicit localization\nconstraints on the vision encoder to strengthen its regional reasoning\ncapability. Extensive experiments show that GranViT surpasses existing vision\nencoders and attains strong transferability to varying LLMs. Remarkably, it\nachieves state-of-the-art results on fine-grained recognition, multimodal VQA,\nand OCR understanding."}
{"id": "2510.21512", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21512", "abs": "https://arxiv.org/abs/2510.21512", "authors": ["Kaibo Wang", "Jianda Mao", "Tong Wu", "Yang Xiang"], "title": "Towards a Golden Classifier-Free Guidance Path via Foresight Fixed Point Iterations", "comment": "Accepted at NeurIPS 2025 (Spotlight)", "summary": "Classifier-Free Guidance (CFG) is an essential component of text-to-image\ndiffusion models, and understanding and advancing its operational mechanisms\nremains a central focus of research. Existing approaches stem from divergent\ntheoretical interpretations, thereby limiting the design space and obscuring\nkey design choices. To address this, we propose a unified perspective that\nreframes conditional guidance as fixed point iterations, seeking to identify a\ngolden path where latents produce consistent outputs under both conditional and\nunconditional generation. We demonstrate that CFG and its variants constitute a\nspecial case of single-step short-interval iteration, which is theoretically\nproven to exhibit inefficiency. To this end, we introduce Foresight Guidance\n(FSG), which prioritizes solving longer-interval subproblems in early diffusion\nstages with increased iterations. Extensive experiments across diverse datasets\nand model architectures validate the superiority of FSG over state-of-the-art\nmethods in both image quality and computational efficiency. Our work offers\nnovel perspectives for conditional guidance and unlocks the potential of\nadaptive design."}
{"id": "2510.21518", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21518", "abs": "https://arxiv.org/abs/2510.21518", "authors": ["Lorenzo Basile", "Valentino Maiorca", "Diego Doimo", "Francesco Locatello", "Alberto Cazzaniga"], "title": "Head Pursuit: Probing Attention Specialization in Multimodal Transformers", "comment": "Accepted at NeurIPS 2025 (spotlight)", "summary": "Language and vision-language models have shown impressive performance across\na wide range of tasks, but their internal mechanisms remain only partly\nunderstood. In this work, we study how individual attention heads in\ntext-generative models specialize in specific semantic or visual attributes.\nBuilding on an established interpretability method, we reinterpret the practice\nof probing intermediate activations with the final decoding layer through the\nlens of signal processing. This lets us analyze multiple samples in a\nprincipled way and rank attention heads based on their relevance to target\nconcepts. Our results show consistent patterns of specialization at the head\nlevel across both unimodal and multimodal transformers. Remarkably, we find\nthat editing as few as 1% of the heads, selected using our method, can reliably\nsuppress or enhance targeted concepts in the model output. We validate our\napproach on language tasks such as question answering and toxicity mitigation,\nas well as vision-language tasks including image classification and captioning.\nOur findings highlight an interpretable and controllable structure within\nattention layers, offering simple tools for understanding and editing\nlarge-scale generative models."}
{"id": "2510.21581", "categories": ["cs.CV", "cs.SD"], "pdf": "https://arxiv.org/pdf/2510.21581", "abs": "https://arxiv.org/abs/2510.21581", "authors": ["Ciara Rowles", "Varun Jampani", "Simon Donn", "Shimon Vainer", "Julian Parker", "Zach Evans"], "title": "Foley Control: Aligning a Frozen Latent Text-to-Audio Model to Video", "comment": "Project Page: https://stability-ai.github.io/foleycontrol.github.io/", "summary": "Foley Control is a lightweight approach to video-guided Foley that keeps\npretrained single-modality models frozen and learns only a small\ncross-attention bridge between them. We connect V-JEPA2 video embeddings to a\nfrozen Stable Audio Open DiT text-to-audio (T2A) model by inserting compact\nvideo cross-attention after the model's existing text cross-attention, so\nprompts set global semantics while video refines timing and local dynamics. The\nfrozen backbones retain strong marginals (video; audio given text) and the\nbridge learns the audio-video dependency needed for synchronization -- without\nretraining the audio prior. To cut memory and stabilize training, we pool video\ntokens before conditioning. On curated video-audio benchmarks, Foley Control\ndelivers competitive temporal and semantic alignment with far fewer trainable\nparameters than recent multi-modal systems, while preserving prompt-driven\ncontrollability and production-friendly modularity (swap/upgrade encoders or\nthe T2A backbone without end-to-end retraining). Although we focus on\nVideo-to-Foley, the same bridge design can potentially extend to other audio\nmodalities (e.g., speech)."}
{"id": "2510.21583", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.21583", "abs": "https://arxiv.org/abs/2510.21583", "authors": ["Yifu Luo", "Penghui Du", "Bo Li", "Sinan Du", "Tiantian Zhang", "Yongzhe Chang", "Kai Wu", "Kun Gai", "Xueqian Wang"], "title": "Sample By Step, Optimize By Chunk: Chunk-Level GRPO For Text-to-Image Generation", "comment": "11 pages, preprint", "summary": "Group Relative Policy Optimization (GRPO) has shown strong potential for\nflow-matching-based text-to-image (T2I) generation, but it faces two key\nlimitations: inaccurate advantage attribution, and the neglect of temporal\ndynamics of generation. In this work, we argue that shifting the optimization\nparadigm from the step level to the chunk level can effectively alleviate these\nissues. Building on this idea, we propose Chunk-GRPO, the first chunk-level\nGRPO-based approach for T2I generation. The insight is to group consecutive\nsteps into coherent 'chunk's that capture the intrinsic temporal dynamics of\nflow matching, and to optimize policies at the chunk level. In addition, we\nintroduce an optional weighted sampling strategy to further enhance\nperformance. Extensive experiments show that ChunkGRPO achieves superior\nresults in both preference alignment and image quality, highlighting the\npromise of chunk-level optimization for GRPO-based methods."}
{"id": "2510.21605", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21605", "abs": "https://arxiv.org/abs/2510.21605", "authors": ["Orest Kupyn", "Hirokatsu Kataoka", "Christian Rupprecht"], "title": "S3OD: Towards Generalizable Salient Object Detection with Synthetic Data", "comment": null, "summary": "Salient object detection exemplifies data-bounded tasks where expensive\npixel-precise annotations force separate model training for related subtasks\nlike DIS and HR-SOD. We present a method that dramatically improves\ngeneralization through large-scale synthetic data generation and\nambiguity-aware architecture. We introduce S3OD, a dataset of over 139,000\nhigh-resolution images created through our multi-modal diffusion pipeline that\nextracts labels from diffusion and DINO-v3 features. The iterative generation\nframework prioritizes challenging categories based on model performance. We\npropose a streamlined multi-mask decoder that naturally handles the inherent\nambiguity in salient object detection by predicting multiple valid\ninterpretations. Models trained solely on synthetic data achieve 20-50% error\nreduction in cross-dataset generalization, while fine-tuned versions reach\nstate-of-the-art performance across DIS and HR-SOD benchmarks."}
{"id": "2510.21606", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21606", "abs": "https://arxiv.org/abs/2510.21606", "authors": ["Jiaxiang Liu", "Yuan Wang", "Jiawei Du", "Joey Tianyi Zhou", "Mingkun Xu", "Zuozhu Liu"], "title": "Modest-Align: Data-Efficient Alignment for Vision-Language Models", "comment": null, "summary": "Cross-modal alignment aims to map heterogeneous modalities into a shared\nlatent space, as exemplified by models like CLIP, which benefit from\nlarge-scale image-text pretraining for strong recognition capabilities.\nHowever, when operating in resource-constrained settings with limited or\nlow-quality data, these models often suffer from overconfidence and degraded\nperformance due to the prevalence of ambiguous or weakly correlated image-text\npairs. Current contrastive learning approaches, which rely on single positive\npairs, further exacerbate this issue by reinforcing overconfidence on uncertain\nsamples. To address these challenges, we propose Modest-Align, a lightweight\nalignment framework designed for robustness and efficiency. Our approach\nleverages two complementary strategies -- Random Perturbation, which introduces\ncontrolled noise to simulate uncertainty, and Embedding Smoothing, which\ncalibrates similarity distributions in the embedding space. These mechanisms\ncollectively reduce overconfidence and improve performance on noisy or weakly\naligned samples. Extensive experiments across multiple benchmark datasets\ndemonstrate that Modest-Align outperforms state-of-the-art methods in retrieval\ntasks, achieving competitive results with over 100x less training data and 600x\nless GPU time than CLIP. Our method offers a practical and scalable solution\nfor cross-modal alignment in real-world, low-resource scenarios."}
{"id": "2510.21704", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2510.21704", "abs": "https://arxiv.org/abs/2510.21704", "authors": ["Christy Li", "Josep Lopez Camuas", "Jake Thomas Touchet", "Jacob Andreas", "Agata Lapedriza", "Antonio Torralba", "Tamar Rott Shaham"], "title": "Automated Detection of Visual Attribute Reliance with a Self-Reflective Agent", "comment": "32 pages, 10 figures, Neurips 2025", "summary": "When a vision model performs image recognition, which visual attributes drive\nits predictions? Detecting unintended reliance on specific visual features is\ncritical for ensuring model robustness, preventing overfitting, and avoiding\nspurious correlations. We introduce an automated framework for detecting such\ndependencies in trained vision models. At the core of our method is a\nself-reflective agent that systematically generates and tests hypotheses about\nvisual attributes that a model may rely on. This process is iterative: the\nagent refines its hypotheses based on experimental outcomes and uses a\nself-evaluation protocol to assess whether its findings accurately explain\nmodel behavior. When inconsistencies arise, the agent self-reflects over its\nfindings and triggers a new cycle of experimentation. We evaluate our approach\non a novel benchmark of 130 models designed to exhibit diverse visual attribute\ndependencies across 18 categories. Our results show that the agent's\nperformance consistently improves with self-reflection, with a significant\nperformance increase over non-reflective baselines. We further demonstrate that\nthe agent identifies real-world visual attribute dependencies in\nstate-of-the-art models, including CLIP's vision encoder and the YOLOv8 object\ndetector."}
{"id": "2510.21445", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.21445", "abs": "https://arxiv.org/abs/2510.21445", "authors": ["Thanh Cong Ho", "Farah Kharrat", "Abderrazek Abid", "Fakhri Karray"], "title": "REMONI: An Autonomous System Integrating Wearables and Multimodal Large Language Models for Enhanced Remote Health Monitoring", "comment": null, "summary": "With the widespread adoption of wearable devices in our daily lives, the\ndemand and appeal for remote patient monitoring have significantly increased.\nMost research in this field has concentrated on collecting sensor data,\nvisualizing it, and analyzing it to detect anomalies in specific diseases such\nas diabetes, heart disease and depression. However, this domain has a notable\ngap in the aspect of human-machine interaction. This paper proposes REMONI, an\nautonomous REmote health MONItoring system that integrates multimodal large\nlanguage models (MLLMs), the Internet of Things (IoT), and wearable devices.\nThe system automatically and continuously collects vital signs, accelerometer\ndata from a special wearable (such as a smartwatch), and visual data in patient\nvideo clips collected from cameras. This data is processed by an anomaly\ndetection module, which includes a fall detection model and algorithms to\nidentify and alert caregivers of the patient's emergency conditions. A\ndistinctive feature of our proposed system is the natural language processing\ncomponent, developed with MLLMs capable of detecting and recognizing a\npatient's activity and emotion while responding to healthcare worker's\ninquiries. Additionally, prompt engineering is employed to integrate all\npatient information seamlessly. As a result, doctors and nurses can access\nreal-time vital signs and the patient's current state and mood by interacting\nwith an intelligent agent through a user-friendly web application. Our\nexperiments demonstrate that our system is implementable and scalable for\nreal-life scenarios, potentially reducing the workload of medical professionals\nand healthcare costs. A full-fledged prototype illustrating the functionalities\nof the system has been developed and being tested to demonstrate the robustness\nof its various capabilities."}
