{"id": "2511.03988", "categories": ["cs.CV", "q-bio.NC"], "pdf": "https://arxiv.org/pdf/2511.03988", "abs": "https://arxiv.org/abs/2511.03988", "authors": ["Wenshuo Qin", "Leyla Isik"], "title": "Simple 3D Pose Features Support Human and Machine Social Scene Understanding", "comment": "28 pages, 6 figures", "summary": "Humans can quickly and effortlessly extract a variety of information about\nothers' social interactions from visual input, ranging from visuospatial cues\nlike whether two people are facing each other to higher-level information. Yet,\nthe computations supporting these abilities remain poorly understood, and\nsocial interaction recognition continues to challenge even the most advanced AI\nvision systems. Here, we hypothesized that humans rely on 3D visuospatial pose\ninformation to make social interaction judgments, which is absent in most AI\nvision models. To test this, we combined state-of-the-art pose and depth\nestimation algorithms to extract 3D joint positions of people in short video\nclips depicting everyday human actions and compared their ability to predict\nhuman social interaction judgments with current AI vision models. Strikingly,\n3D joint positions outperformed most current AI vision models, revealing that\nkey social information is available in explicit body position but not in the\nlearned features of most vision models, including even the layer-wise\nembeddings of the pose models used to extract joint positions. To uncover the\ncritical pose features humans use to make social judgments, we derived a\ncompact set of 3D social pose features describing only the 3D position and\ndirection of faces in the videos. We found that these minimal descriptors\nmatched the predictive strength of the full set of 3D joints and significantly\nimproved the performance of off-the-shelf AI vision models when combined with\ntheir embeddings. Moreover, the degree to which 3D social pose features were\nrepresented in each off-the-shelf AI vision model predicted the model's ability\nto match human social judgments. Together, our findings provide strong evidence\nthat human social scene understanding relies on explicit representations of 3D\npose and can be supported by simple, structured visuospatial primitives."}
{"id": "2511.03992", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03992", "abs": "https://arxiv.org/abs/2511.03992", "authors": ["Yuwen Tao", "Kanglei Zhou", "Xin Tan", "Yuan Xie"], "title": "CaRF: Enhancing Multi-View Consistency in Referring 3D Gaussian Splatting Segmentation", "comment": null, "summary": "Referring 3D Gaussian Splatting Segmentation (R3DGS) aims to interpret\nfree-form language expressions and localize the corresponding 3D regions in\nGaussian fields. While recent advances have introduced cross-modal alignment\nbetween language and 3D geometry, existing pipelines still struggle with\ncross-view consistency due to their reliance on 2D rendered pseudo supervision\nand view specific feature learning. In this work, we present Camera Aware\nReferring Field (CaRF), a fully differentiable framework that operates directly\nin the 3D Gaussian space and achieves multi view consistency. Specifically,\nCaRF introduces Gaussian Field Camera Encoding (GFCE), which incorporates\ncamera geometry into Gaussian text interactions to explicitly model view\ndependent variations and enhance geometric reasoning. Building on this, In\nTraining Paired View Supervision (ITPVS) is proposed to align per Gaussian\nlogits across calibrated views during training, effectively mitigating single\nview overfitting and exposing inter view discrepancies for optimization.\nExtensive experiments on three representative benchmarks demonstrate that CaRF\nachieves average improvements of 16.8%, 4.3%, and 2.0% in mIoU over state of\nthe art methods on the Ref LERF, LERF OVS, and 3D OVS datasets, respectively.\nMoreover, this work promotes more reliable and view consistent 3D scene\nunderstanding, with potential benefits for embodied AI, AR/VR interaction, and\nautonomous perception."}
{"id": "2511.04016", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04016", "abs": "https://arxiv.org/abs/2511.04016", "authors": ["Mahmoud Soliman", "Islam Osman", "Mohamed S. Shehata", "Rasika Rajapakshe"], "title": "MedDChest: A Content-Aware Multimodal Foundational Vision Model for Thoracic Imaging", "comment": "10 pages, 2 figures", "summary": "The performance of vision models in medical imaging is often hindered by the\nprevailing paradigm of fine-tuning backbones pre-trained on out-of-domain\nnatural images. To address this fundamental domain gap, we propose MedDChest, a\nnew foundational Vision Transformer (ViT) model optimized specifically for\nthoracic imaging. We pre-trained MedDChest from scratch on a massive, curated,\nmultimodal dataset of over 1.2 million images, encompassing different\nmodalities including Chest X-ray and Computed Tomography (CT) compiled from 10\npublic sources. A core technical contribution of our work is Guided Random\nResized Crops, a novel content-aware data augmentation strategy that biases\nsampling towards anatomically relevant regions, overcoming the inefficiency of\nstandard cropping techniques on medical scans. We validate our model's\neffectiveness by fine-tuning it on a diverse set of downstream diagnostic\ntasks. Comprehensive experiments empirically demonstrate that MedDChest\nsignificantly outperforms strong, publicly available ImageNet-pretrained\nmodels. By establishing the superiority of large-scale, in-domain pre-training\ncombined with domain-specific data augmentation, MedDChest provides a powerful\nand robust feature extractor that serves as a significantly better starting\npoint for a wide array of thoracic diagnostic tasks. The model weights will be\nmade publicly available to foster future research and applications."}
{"id": "2511.04078", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04078", "abs": "https://arxiv.org/abs/2511.04078", "authors": ["Zehui Feng", "Chenqi Zhang", "Mingru Wang", "Minuo Wei", "Shiwei Cheng", "Cuntai Guan", "Ting Han"], "title": "Unveiling Deep Semantic Uncertainty Perception for Language-Anchored Multi-modal Vision-Brain Alignment", "comment": "30 pages, 16 figures, under review as a conference paper", "summary": "Unveiling visual semantics from neural signals such as EEG, MEG, and fMRI\nremains a fundamental challenge due to subject variability and the entangled\nnature of visual features. Existing approaches primarily align neural activity\ndirectly with visual embeddings, but visual-only representations often fail to\ncapture latent semantic dimensions, limiting interpretability and deep\nrobustness. To address these limitations, we propose Bratrix, the first\nend-to-end framework to achieve multimodal Language-Anchored Vision-Brain\nalignment. Bratrix decouples visual stimuli into hierarchical visual and\nlinguistic semantic components, and projects both visual and brain\nrepresentations into a shared latent space, enabling the formation of aligned\nvisual-language and brain-language embeddings. To emulate human-like perceptual\nreliability and handle noisy neural signals, Bratrix incorporates a novel\nuncertainty perception module that applies uncertainty-aware weighting during\nalignment. By leveraging learnable language-anchored semantic matrices to\nenhance cross-modal correlations and employing a two-stage training strategy of\nsingle-modality pretraining followed by multimodal fine-tuning, Bratrix-M\nimproves alignment precision. Extensive experiments on EEG, MEG, and fMRI\nbenchmarks demonstrate that Bratrix improves retrieval, reconstruction, and\ncaptioning performance compared to state-of-the-art methods, specifically\nsurpassing 14.3% in 200-way EEG retrieval task. Code and model are available."}
{"id": "2511.03830", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.03830", "abs": "https://arxiv.org/abs/2511.03830", "authors": ["Mikołaj Langner", "Jan Eliasz", "Ewa Rudnicka", "Jan Kocoń"], "title": "Divide, Cache, Conquer: Dichotomic Prompting for Efficient Multi-Label LLM-Based Classification", "comment": "9 pages, 8 figures", "summary": "We introduce a method for efficient multi-label text classification with\nlarge language models (LLMs), built on reformulating classification tasks as\nsequences of dichotomic (yes/no) decisions. Instead of generating all labels in\na single structured response, each target dimension is queried independently,\nwhich, combined with a prefix caching mechanism, yields substantial efficiency\ngains for short-text inference without loss of accuracy. To demonstrate the\napproach, we focus on affective text analysis, covering 24 dimensions including\nemotions and sentiment. Using LLM-to-SLM distillation, a powerful annotator\nmodel (DeepSeek-V3) provides multiple annotations per text, which are\naggregated to fine-tune smaller models (HerBERT-Large, CLARIN-1B, PLLuM-8B,\nGemma3-1B). The fine-tuned models show significant improvements over zero-shot\nbaselines, particularly on the dimensions seen during training. Our findings\nsuggest that decomposing multi-label classification into dichotomic queries,\ncombined with distillation and cache-aware inference, offers a scalable and\neffective framework for LLM-based classification. While we validate the method\non affective states, the approach is general and applicable across domains."}
{"id": "2511.03845", "categories": ["cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03845", "abs": "https://arxiv.org/abs/2511.03845", "authors": ["Tianning Dong", "Luyi Ma", "Varun Vasudevan", "Jason Cho", "Sushant Kumar", "Kannan Achan"], "title": "To See or To Read: User Behavior Reasoning in Multimodal LLMs", "comment": "Accepted by the 39th Conference on Neural Information Processing\n  Systems (NeurIPS 2025) Workshop: Efficient Reasoning", "summary": "Multimodal Large Language Models (MLLMs) are reshaping how modern agentic\nsystems reason over sequential user-behavior data. However, whether textual or\nimage representations of user behavior data are more effective for maximizing\nMLLM performance remains underexplored. We present \\texttt{BehaviorLens}, a\nsystematic benchmarking framework for assessing modality trade-offs in\nuser-behavior reasoning across six MLLMs by representing transaction data as\n(1) a text paragraph, (2) a scatter plot, and (3) a flowchart. Using a\nreal-world purchase-sequence dataset, we find that when data is represented as\nimages, MLLMs next-purchase prediction accuracy is improved by 87.5% compared\nwith an equivalent textual representation without any additional computational\ncost."}
{"id": "2511.04112", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04112", "abs": "https://arxiv.org/abs/2511.04112", "authors": ["Biao Liu", "Yuanzhi Liang"], "title": "SpatialLock: Precise Spatial Control in Text-to-Image Synthesis", "comment": "Work in progress", "summary": "Text-to-Image (T2I) synthesis has made significant advancements in recent\nyears, driving applications such as generating datasets automatically. However,\nprecise control over object localization in generated images remains a\nchallenge. Existing methods fail to fully utilize positional information,\nleading to an inadequate understanding of object spatial layouts. To address\nthis issue, we propose SpatialLock, a novel framework that leverages perception\nsignals and grounding information to jointly control the generation of spatial\nlocations. SpatialLock incorporates two components: Position-Engaged Injection\n(PoI) and Position-Guided Learning (PoG). PoI directly integrates spatial\ninformation through an attention layer, encouraging the model to learn the\ngrounding information effectively. PoG employs perception-based supervision to\nfurther refine object localization. Together, these components enable the model\nto generate objects with precise spatial arrangements and improve the visual\nquality of the generated images. Experiments show that SpatialLock sets a new\nstate-of-the-art for precise object positioning, achieving IOU scores above 0.9\nacross multiple datasets."}
{"id": "2511.03908", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.03908", "abs": "https://arxiv.org/abs/2511.03908", "authors": ["Alvin Wei Ming Tan", "Ben Prystawski", "Veronica Boyce", "Michael C. Frank"], "title": "Context informs pragmatic interpretation in vision-language models", "comment": "Accepted at CogInterp Workshop, NeurIPS 2025", "summary": "Iterated reference games - in which players repeatedly pick out novel\nreferents using language - present a test case for agents' ability to perform\ncontext-sensitive pragmatic reasoning in multi-turn linguistic environments. We\ntested humans and vision-language models on trials from iterated reference\ngames, varying the given context in terms of amount, order, and relevance.\nWithout relevant context, models were above chance but substantially worse than\nhumans. However, with relevant context, model performance increased\ndramatically over trials. Few-shot reference games with abstract referents\nremain a difficult task for machine learning models."}
{"id": "2511.04093", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2511.04093", "abs": "https://arxiv.org/abs/2511.04093", "authors": ["Yuanning Cui", "Zequn Sun", "Wei Hu", "Zhangjie Fu"], "title": "KGFR: A Foundation Retriever for Generalized Knowledge Graph Question Answering", "comment": null, "summary": "Large language models (LLMs) excel at reasoning but struggle with\nknowledge-intensive questions due to limited context and parametric knowledge.\nHowever, existing methods that rely on finetuned LLMs or GNN retrievers are\nlimited by dataset-specific tuning and scalability on large or unseen graphs.\nWe propose the LLM-KGFR collaborative framework, where an LLM works with a\nstructured retriever, the Knowledge Graph Foundation Retriever (KGFR). KGFR\nencodes relations using LLM-generated descriptions and initializes entities\nbased on their roles in the question, enabling zero-shot generalization to\nunseen KGs. To handle large graphs efficiently, it employs Asymmetric\nProgressive Propagation (APP)- a stepwise expansion that selectively limits\nhigh-degree nodes while retaining informative paths. Through node-, edge-, and\npath-level interfaces, the LLM iteratively requests candidate answers,\nsupporting facts, and reasoning paths, forming a controllable reasoning loop.\nExperiments demonstrate that LLM-KGFR achieves strong performance while\nmaintaining scalability and generalization, providing a practical solution for\nKG-augmented reasoning."}
{"id": "2511.04123", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04123", "abs": "https://arxiv.org/abs/2511.04123", "authors": ["Tengjie Li", "Shikui Tu", "Lei Xu"], "title": "Text to Sketch Generation with Multi-Styles", "comment": "Accepted by NeurIPS 2025", "summary": "Recent advances in vision-language models have facilitated progress in sketch\ngeneration. However, existing specialized methods primarily focus on generic\nsynthesis and lack mechanisms for precise control over sketch styles. In this\nwork, we propose a training-free framework based on diffusion models that\nenables explicit style guidance via textual prompts and referenced style\nsketches. Unlike previous style transfer methods that overwrite key and value\nmatrices in self-attention, we incorporate the reference features as auxiliary\ninformation with linear smoothing and leverage a style-content guidance\nmechanism. This design effectively reduces content leakage from reference\nsketches and enhances synthesis quality, especially in cases with low\nstructural similarity between reference and target sketches. Furthermore, we\nextend our framework to support controllable multi-style generation by\nintegrating features from multiple reference sketches, coordinated via a joint\nAdaIN module. Extensive experiments demonstrate that our approach achieves\nhigh-quality sketch generation with accurate style alignment and improved\nflexibility in style control. The official implementation of M3S is available\nat https://github.com/CMACH508/M3S."}
{"id": "2511.04079", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.04079", "abs": "https://arxiv.org/abs/2511.04079", "authors": ["Eva Prakash", "Maayane Attias", "Pierre Chambon", "Justin Xu", "Steven Truong", "Jean-Benoit Delbrouck", "Tessa Cook", "Curtis Langlotz"], "title": "Improving the Performance of Radiology Report De-identification with Large-Scale Training and Benchmarking Against Cloud Vendor Methods", "comment": "In submission to JAMIA", "summary": "Objective: To enhance automated de-identification of radiology reports by\nscaling transformer-based models through extensive training datasets and\nbenchmarking performance against commercial cloud vendor systems for protected\nhealth information (PHI) detection. Materials and Methods: In this\nretrospective study, we built upon a state-of-the-art, transformer-based, PHI\nde-identification pipeline by fine-tuning on two large annotated radiology\ncorpora from Stanford University, encompassing chest X-ray, chest CT,\nabdomen/pelvis CT, and brain MR reports and introducing an additional PHI\ncategory (AGE) into the architecture. Model performance was evaluated on test\nsets from Stanford and the University of Pennsylvania (Penn) for token-level\nPHI detection. We further assessed (1) the stability of synthetic PHI\ngeneration using a \"hide-in-plain-sight\" method and (2) performance against\ncommercial systems. Precision, recall, and F1 scores were computed across all\nPHI categories. Results: Our model achieved overall F1 scores of 0.973 on the\nPenn dataset and 0.996 on the Stanford dataset, outperforming or maintaining\nthe previous state-of-the-art model performance. Synthetic PHI evaluation\nshowed consistent detectability (overall F1: 0.959 [0.958-0.960]) across 50\nindependently de-identified Penn datasets. Our model outperformed all vendor\nsystems on synthetic Penn reports (overall F1: 0.960 vs. 0.632-0.754).\nDiscussion: Large-scale, multimodal training improved cross-institutional\ngeneralization and robustness. Synthetic PHI generation preserved data utility\nwhile ensuring privacy. Conclusion: A transformer-based de-identification model\ntrained on diverse radiology datasets outperforms prior academic and commercial\nsystems in PHI detection and establishes a new benchmark for secure clinical\ntext processing."}
{"id": "2511.04307", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2511.04307", "abs": "https://arxiv.org/abs/2511.04307", "authors": ["Jian Mu", "Chaoyun Zhang", "Chiming Ni", "Lu Wang", "Bo Qiao", "Kartik Mathur", "Qianhui Wu", "Yuhang Xie", "Xiaojun Ma", "Mengyu Zhou", "Si Qin", "Liqun Li", "Yu Kang", "Minghua Ma", "Qingwei Lin", "Saravan Rajmohan", "Dongmei Zhang"], "title": "GUI-360: A Comprehensive Dataset and Benchmark for Computer-Using Agents", "comment": null, "summary": "We introduce GUI-360$^\\circ$, a large-scale, comprehensive dataset and\nbenchmark suite designed to advance computer-using agents (CUAs). CUAs present\nunique challenges and is constrained by three persistent gaps: a scarcity of\nreal-world CUA tasks, the lack of automated collection-and-annotation pipelines\nfor multi-modal trajectories, and the absence of a unified benchmark that\njointly evaluates GUI grounding, screen parsing, and action prediction.\n  GUI-360$^\\circ$ addresses these gaps with an LLM-augmented, largely automated\npipeline for query sourcing, environment-template construction, task\ninstantiation, batched execution, and LLM-driven quality filtering. The\nreleased corpus contains over 1.2M executed action steps across thousands of\ntrajectories in popular Windows office applications, and includes\nfull-resolution screenshots, accessibility metadata when available,\ninstantiated goals, intermediate reasoning traces, and both successful and\nfailed action trajectories. The dataset supports three canonical tasks, GUI\ngrounding, screen parsing, and action prediction, and a hybrid GUI+API action\nspace that reflects modern agent designs. Benchmarking state-of-the-art\nvision--language models on GUI-360$^\\circ$ reveals substantial out-of-the-box\nshortcomings in grounding and action prediction; supervised fine-tuning and\nreinforcement learning yield significant gains but do not close the gap to\nhuman-level reliability. We release GUI-360$^\\circ$ and accompanying code to\nfacilitate reproducible research and accelerate progress on robust desktop\nCUAs.\n  The full dataset has been made public on\nhttps://huggingface.co/datasets/vyokky/GUI-360."}
{"id": "2511.04171", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.04171", "abs": "https://arxiv.org/abs/2511.04171", "authors": ["Fatemehzahra Darzi", "Rodrigo Escobar Diaz Guerrero", "Thomas Bocklitz"], "title": "Systematic Evaluation of Preprocessing Techniques for Accurate Image Registration in Digital Pathology", "comment": "14 pages, 7 Figures", "summary": "Image registration refers to the process of spatially aligning two or more\nimages by mapping them into a common coordinate system, so that corresponding\nanatomical or tissue structures are matched across images. In digital\npathology, registration enables direct comparison and integration of\ninformation from different stains or imaging modalities, sup-porting\napplications such as biomarker analysis and tissue reconstruction. Accurate\nregistration of images from different modalities is an essential step in\ndigital pathology. In this study, we investigated how various color\ntransformation techniques affect image registration between hematoxylin and\neosin (H&E) stained images and non-linear multimodal images. We used a dataset\nof 20 tissue sample pairs, with each pair undergoing several preprocessing\nsteps, including different color transformation (CycleGAN, Macenko, Reinhard,\nVahadane), inversion, contrast adjustment, intensity normalization, and\ndenoising. All images were registered using the VALIS registration method,\nwhich first applies rigid registration and then performs non-rigid registration\nin two steps on both low and high-resolution images. Registration performance\nwas evaluated using the relative Target Registration Error (rTRE). We reported\nthe median of median rTRE values (MMrTRE) and the average of median rTRE values\n(AMrTRE) for each method. In addition, we performed a custom point-based\nevaluation using ten manually selected key points. Registration was done\nseparately for two scenarios, using either the original or inverted multimodal\nimages. In both scenarios, CycleGAN color transformation achieved the lowest\nregistration errors, while the other methods showed higher errors. These\nfindings show that applying color transformation before registration improves\nalignment between images from different modalities and supports more reliable\nanalysis in digital pathology."}
{"id": "2511.04256", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.04256", "abs": "https://arxiv.org/abs/2511.04256", "authors": ["Kun Yang", "Zikang chen", "Yanmeng Wang", "Zhigen Li"], "title": "SSPO: Subsentence-level Policy Optimization", "comment": null, "summary": "As a significant part of post-training of the Large Language Models (LLMs),\nReinforcement Learning from Verifiable Reward (RLVR) has greatly improved LLMs'\nreasoning skills. However, some RLVR algorithms, such as GRPO (Group Relative\nPolicy Optimization) and GSPO (Group Sequence Policy Optimization), are\nobserved to suffer from unstable policy updates and low usage of sampling data,\nrespectively. The importance ratio of GRPO is calculated at the token level,\nwhich focuses more on optimizing a single token. This will be easily affected\nby outliers, leading to model training collapse. GSPO proposed the calculation\nof the response level importance ratio, which solves the problem of high\nvariance and training noise accumulation in the calculation of the GRPO\nimportance ratio. However, since all the response tokens share a common\nimportance ratio, extreme values can easily raise or lower the overall mean,\nleading to the entire response being mistakenly discarded, resulting in a\ndecrease in the utilization of sampled data. This paper introduces SSPO, which\napplies sentence-level importance ratio, taking the balance between GRPO and\nGSPO. SSPO not only avoids training collapse and high variance, but also\nprevents the whole response tokens from being abandoned by the clipping\nmechanism. Furthermore, we apply sentence entropy to PPO-CLIP to steadily\nadjust the clipping bounds, encouraging high-entropy tokens to explore and\nnarrow the clipping range of low-entropy tokens. In particular, SSPO achieves\nan average score of 46.57 across five datasets, surpassing GRPO (43.01) and\nGSPO (44.42), and wins state-of-the-art performance on three datasets. These\nresults highlight SSPO's effectiveness in leveraging generated data by taking\nthe essence of GSPO but rejecting its shortcomings."}
{"id": "2511.04171", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.04171", "abs": "https://arxiv.org/abs/2511.04171", "authors": ["Fatemehzahra Darzi", "Rodrigo Escobar Diaz Guerrero", "Thomas Bocklitz"], "title": "Systematic Evaluation of Preprocessing Techniques for Accurate Image Registration in Digital Pathology", "comment": "14 pages, 7 Figures", "summary": "Image registration refers to the process of spatially aligning two or more\nimages by mapping them into a common coordinate system, so that corresponding\nanatomical or tissue structures are matched across images. In digital\npathology, registration enables direct comparison and integration of\ninformation from different stains or imaging modalities, sup-porting\napplications such as biomarker analysis and tissue reconstruction. Accurate\nregistration of images from different modalities is an essential step in\ndigital pathology. In this study, we investigated how various color\ntransformation techniques affect image registration between hematoxylin and\neosin (H&E) stained images and non-linear multimodal images. We used a dataset\nof 20 tissue sample pairs, with each pair undergoing several preprocessing\nsteps, including different color transformation (CycleGAN, Macenko, Reinhard,\nVahadane), inversion, contrast adjustment, intensity normalization, and\ndenoising. All images were registered using the VALIS registration method,\nwhich first applies rigid registration and then performs non-rigid registration\nin two steps on both low and high-resolution images. Registration performance\nwas evaluated using the relative Target Registration Error (rTRE). We reported\nthe median of median rTRE values (MMrTRE) and the average of median rTRE values\n(AMrTRE) for each method. In addition, we performed a custom point-based\nevaluation using ten manually selected key points. Registration was done\nseparately for two scenarios, using either the original or inverted multimodal\nimages. In both scenarios, CycleGAN color transformation achieved the lowest\nregistration errors, while the other methods showed higher errors. These\nfindings show that applying color transformation before registration improves\nalignment between images from different modalities and supports more reliable\nanalysis in digital pathology."}
{"id": "2511.04281", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04281", "abs": "https://arxiv.org/abs/2511.04281", "authors": ["Yujie Yang", "Shuang Li", "Jun Ye", "Neng Dong", "Fan Li", "Huafeng Li"], "title": "DINOv2 Driven Gait Representation Learning for Video-Based Visible-Infrared Person Re-identification", "comment": null, "summary": "Video-based Visible-Infrared person re-identification (VVI-ReID) aims to\nretrieve the same pedestrian across visible and infrared modalities from video\nsequences. Existing methods tend to exploit modality-invariant visual features\nbut largely overlook gait features, which are not only modality-invariant but\nalso rich in temporal dynamics, thus limiting their ability to model the\nspatiotemporal consistency essential for cross-modal video matching. To address\nthese challenges, we propose a DINOv2-Driven Gait Representation Learning\n(DinoGRL) framework that leverages the rich visual priors of DINOv2 to learn\ngait features complementary to appearance cues, facilitating robust\nsequence-level representations for cross-modal retrieval. Specifically, we\nintroduce a Semantic-Aware Silhouette and Gait Learning (SASGL) model, which\ngenerates and enhances silhouette representations with general-purpose semantic\npriors from DINOv2 and jointly optimizes them with the ReID objective to\nachieve semantically enriched and task-adaptive gait feature learning.\nFurthermore, we develop a Progressive Bidirectional Multi-Granularity\nEnhancement (PBMGE) module, which progressively refines feature representations\nby enabling bidirectional interactions between gait and appearance streams\nacross multiple spatial granularities, fully leveraging their complementarity\nto enhance global representations with rich local details and produce highly\ndiscriminative features. Extensive experiments on HITSZ-VCM and BUPT datasets\ndemonstrate the superiority of our approach, significantly outperforming\nexisting state-of-the-art methods."}
{"id": "2511.04479", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.04479", "abs": "https://arxiv.org/abs/2511.04479", "authors": ["Surapon Nonesung", "Teetouch Jaknamon", "Sirinya Chaiophat", "Natapong Nitarach", "Chanakan Wittayasakpan", "Warit Sirichotedumrong", "Adisai Na-Thalang", "Kunat Pipatanakul"], "title": "ThaiOCRBench: A Task-Diverse Benchmark for Vision-Language Understanding in Thai", "comment": "Accepted at the IJCNLP-AACL 2025 (Main)", "summary": "We present ThaiOCRBench, the first comprehensive benchmark for evaluating\nvision-language models (VLMs) on Thai text-rich visual understanding tasks.\nDespite recent progress in multimodal modeling, existing benchmarks\npredominantly focus on high-resource languages, leaving Thai underrepresented,\nespecially in tasks requiring document structure understanding. ThaiOCRBench\naddresses this gap by offering a diverse, human-annotated dataset comprising\n2,808 samples across 13 task categories. We evaluate a wide range of\nstate-of-the-art VLMs in a zero-shot setting, spanning both proprietary and\nopen-source systems. Results show a significant performance gap, with\nproprietary models (e.g., Gemini 2.5 Pro) outperforming open-source\ncounterparts. Notably, fine-grained text recognition and handwritten content\nextraction exhibit the steepest performance drops among open-source models.\nThrough detailed error analysis, we identify key challenges such as language\nbias, structural mismatch, and hallucinated content. ThaiOCRBench provides a\nstandardized framework for assessing VLMs in low-resource, script-complex\nsettings, and provides actionable insights for improving Thai-language document\nunderstanding."}
{"id": "2511.04317", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04317", "abs": "https://arxiv.org/abs/2511.04317", "authors": ["Xiangjun Zhang", "Litong Gong", "Yinglin Zheng", "Yansong Liu", "Wentao Jiang", "Mingyi Xu", "Biao Wang", "Tiezheng Ge", "Ming Zeng"], "title": "RISE-T2V: Rephrasing and Injecting Semantics with LLM for Expansive Text-to-Video Generation", "comment": "17 pages, 16 figures", "summary": "Most text-to-video(T2V) diffusion models depend on pre-trained text encoders\nfor semantic alignment, yet they often fail to maintain video quality when\nprovided with concise prompts rather than well-designed ones. The primary issue\nlies in their limited textual semantics understanding. Moreover, these text\nencoders cannot rephrase prompts online to better align with user intentions,\nwhich limits both the scalability and usability of the models, To address these\nchallenges, we introduce RISE-T2V, which uniquely integrates the processes of\nprompt rephrasing and semantic feature extraction into a single and seamless\nstep instead of two separate steps. RISE-T2V is universal and can be applied to\nvarious pre-trained LLMs and video diffusion models(VDMs), significantly\nenhancing their capabilities for T2V tasks. We propose an innovative module\ncalled the Rephrasing Adapter, enabling diffusion models to utilize text hidden\nstates during the next token prediction of the LLM as a condition for video\ngeneration. By employing a Rephrasing Adapter, the video generation model can\nimplicitly rephrase basic prompts into more comprehensive representations that\nbetter match the user's intent. Furthermore, we leverage the powerful\ncapabilities of LLMs to enable video generation models to accomplish a broader\nrange of T2V tasks. Extensive experiments demonstrate that RISE-T2V is a\nversatile framework applicable to different video diffusion model\narchitectures, significantly enhancing the ability of T2V models to generate\nhigh-quality videos that align with user intent. Visual results are available\non the webpage at https://rise-t2v.github.io."}
{"id": "2511.04560", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.04560", "abs": "https://arxiv.org/abs/2511.04560", "authors": ["Sadia Sultana", "Saiyma Sittul Muna", "Mosammat Zannatul Samarukh", "Ajwad Abrar", "Tareque Mohmud Chowdhury"], "title": "BanglaMedQA and BanglaMMedBench: Evaluating Retrieval-Augmented Generation Strategies for Bangla Biomedical Question Answering", "comment": "Under Review", "summary": "Developing accurate biomedical Question Answering (QA) systems in\nlow-resource languages remains a major challenge, limiting equitable access to\nreliable medical knowledge. This paper introduces BanglaMedQA and\nBanglaMMedBench, the first large-scale Bangla biomedical Multiple Choice\nQuestion (MCQ) datasets designed to evaluate reasoning and retrieval in medical\nartificial intelligence (AI). The study applies and benchmarks several\nRetrieval-Augmented Generation (RAG) strategies, including Traditional,\nZero-Shot Fallback, Agentic, Iterative Feedback, and Aggregate RAG, combining\ntextbook-based and web retrieval with generative reasoning to improve factual\naccuracy. A key novelty lies in integrating a Bangla medical textbook corpus\nthrough Optical Character Recognition (OCR) and implementing an Agentic RAG\npipeline that dynamically selects between retrieval and reasoning strategies.\nExperimental results show that the Agentic RAG achieved the highest accuracy\n89.54% with openai/gpt-oss-120b, outperforming other configurations and\ndemonstrating superior rationale quality. These findings highlight the\npotential of RAG-based methods to enhance the reliability and accessibility of\nBangla medical QA, establishing a foundation for future research in\nmultilingual medical artificial intelligence."}
{"id": "2511.04347", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04347", "abs": "https://arxiv.org/abs/2511.04347", "authors": ["Sanjay Kumar", "Tim Brophy", "Eoin Martino Grua", "Ganesh Sistu", "Valentina Donzella", "Ciaran Eising"], "title": "Evaluating the Impact of Weather-Induced Sensor Occlusion on BEVFusion for 3D Object Detection", "comment": null, "summary": "Accurate 3D object detection is essential for automated vehicles to navigate\nsafely in complex real-world environments. Bird's Eye View (BEV)\nrepresentations, which project multi-sensor data into a top-down spatial\nformat, have emerged as a powerful approach for robust perception. Although\nBEV-based fusion architectures have demonstrated strong performance through\nmultimodal integration, the effects of sensor occlusions, caused by\nenvironmental conditions such as fog, haze, or physical obstructions, on 3D\ndetection accuracy remain underexplored. In this work, we investigate the\nimpact of occlusions on both camera and Light Detection and Ranging (LiDAR)\noutputs using the BEVFusion architecture, evaluated on the nuScenes dataset.\nDetection performance is measured using mean Average Precision (mAP) and the\nnuScenes Detection Score (NDS). Our results show that moderate camera\nocclusions lead to a 41.3% drop in mAP (from 35.6% to 20.9%) when detection is\nbased only on the camera. On the other hand, LiDAR sharply drops in performance\nonly under heavy occlusion, with mAP falling by 47.3% (from 64.7% to 34.1%),\nwith a severe impact on long-range detection. In fused settings, the effect\ndepends on which sensor is occluded: occluding the camera leads to a minor 4.1%\ndrop (from 68.5% to 65.7%), while occluding LiDAR results in a larger 26.8%\ndrop (to 50.1%), revealing the model's stronger reliance on LiDAR for the task\nof 3D object detection. Our results highlight the need for future research into\nocclusion-aware evaluation methods and improved sensor fusion techniques that\ncan maintain detection accuracy in the presence of partial sensor failure or\ndegradation due to adverse environmental conditions."}
{"id": "2511.04570", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.04570", "abs": "https://arxiv.org/abs/2511.04570", "authors": ["Jingqi Tong", "Yurong Mou", "Hangcheng Li", "Mingzhe Li", "Yongzhuo Yang", "Ming Zhang", "Qiguang Chen", "Tianyi Liang", "Xiaomeng Hu", "Yining Zheng", "Xinchi Chen", "Jun Zhao", "Xuanjing Huang", "Xipeng Qiu"], "title": "Thinking with Video: Video Generation as a Promising Multimodal Reasoning Paradigm", "comment": "36 pages, 14 figures", "summary": "\"Thinking with Text\" and \"Thinking with Images\" paradigm significantly\nimprove the reasoning ability of large language models (LLMs) and Vision\nLanguage Models (VLMs). However, these paradigms have inherent limitations. (1)\nImages capture only single moments and fail to represent dynamic processes or\ncontinuous changes, and (2) The separation of text and vision as distinct\nmodalities, hindering unified multimodal understanding and generation. To\novercome these limitations, we introduce \"Thinking with Video\", a new paradigm\nthat leverages video generation models, such as Sora-2, to bridge visual and\ntextual reasoning in a unified temporal framework. To support this exploration,\nwe developed the Video Thinking Benchmark (VideoThinkBench). VideoThinkBench\nencompasses two task categories: (1) vision-centric tasks (e.g., Eyeballing\nPuzzles), and (2) text-centric tasks (e.g., subsets of GSM8K, MMMU). Our\nevaluation establishes Sora-2 as a capable reasoner. On vision-centric tasks,\nSora-2 is generally comparable to state-of-the-art (SOTA) VLMs, and even\nsurpasses VLMs on several tasks, such as Eyeballing Games. On text-centric\ntasks, Sora-2 achieves 92% accuracy on MATH, and 75.53% accuracy on MMMU.\nFurthermore, we systematically analyse the source of these abilities. We also\nfind that self-consistency and in-context learning can improve Sora-2's\nperformance. In summary, our findings demonstrate that the video generation\nmodel is the potential unified multimodal understanding and generation model,\npositions \"thinking with video\" as a unified multimodal reasoning paradigm."}
{"id": "2511.04384", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.04384", "abs": "https://arxiv.org/abs/2511.04384", "authors": ["Itbaan Safwan", "Muhammad Annas Shaikh", "Muhammad Haaris", "Ramail Khan", "Muhammad Atif Tahir"], "title": "Multi-Task Learning for Visually Grounded Reasoning in Gastrointestinal VQA", "comment": "This is a working paper submitted for Medico 2025: Visual Question\n  Answering (with multimodal explanations) for Gastrointestinal Imaging at\n  MediaEval 2025. 5 pages, 3 figures and 1 table", "summary": "We present a multi-task framework for the MediaEval Medico 2025 challenge,\nleveraging a LoRA-tuned Florence-2 model for simultaneous visual question\nanswering (VQA), explanation generation, and visual grounding. The proposed\nsystem integrates three curated datasets: (1) Kvasir-VQA-x1 for question-answer\nlearning, (2) a synthetically enriched explanation dataset offering structured\nmedical reasoning, and (3) text-to-region pairs linking visual features with\nsegmentation masks. This multi-task setup enables the model to jointly learn\nvisual grounding, reasoning, and interpretation, producing responses that are\nboth accurate and interpretable. Extensive evaluation demonstrates that our\napproach substantially improves over single-task baselines in both answer\naccuracy and visual localization, highlighting the effectiveness of grounded\nmulti-task learning for medical VQA applications."}
{"id": "2511.04460", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04460", "abs": "https://arxiv.org/abs/2511.04460", "authors": ["Runqi Qiao", "Qiuna Tan", "Minghan Yang", "Guanting Dong", "Peiqing Yang", "Shiqiang Lang", "Enhui Wan", "Xiaowan Wang", "Yida Xu", "Lan Yang", "Chong Sun", "Chen Li", "Honggang Zhang"], "title": "V-Thinker: Interactive Thinking with Images", "comment": "Working in progress", "summary": "Empowering Large Multimodal Models (LMMs) to deeply integrate image\ninteraction with long-horizon reasoning capabilities remains a long-standing\nchallenge in this field. Recent advances in vision-centric reasoning explore a\npromising \"Thinking with Images\" paradigm for LMMs, marking a shift from\nimage-assisted reasoning to image-interactive thinking. While this milestone\nenables models to focus on fine-grained image regions, progress remains\nconstrained by limited visual tool spaces and task-specific workflow designs.\nTo bridge this gap, we present V-Thinker, a general-purpose multimodal\nreasoning assistant that enables interactive, vision-centric thinking through\nend-to-end reinforcement learning. V-Thinker comprises two key components: (1)\na Data Evolution Flywheel that automatically synthesizes, evolves, and verifies\ninteractive reasoning datasets across three dimensions-diversity, quality, and\ndifficulty; and (2) a Visual Progressive Training Curriculum that first aligns\nperception via point-level supervision, then integrates interactive reasoning\nthrough a two-stage reinforcement learning framework. Furthermore, we introduce\nVTBench, an expert-verified benchmark targeting vision-centric interactive\nreasoning tasks. Extensive experiments demonstrate that V-Thinker consistently\noutperforms strong LMM-based baselines in both general and interactive\nreasoning scenarios, providing valuable insights for advancing\nimage-interactive reasoning applications."}
{"id": "2511.04525", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04525", "abs": "https://arxiv.org/abs/2511.04525", "authors": ["Dimitrios Anastasiou", "Santiago Barbarisi", "Lucy Culshaw", "Jayna Patel", "Evangelos B. Mazomenos", "Imanol Luengo", "Danail Stoyanov"], "title": "Learning from Single Timestamps: Complexity Estimation in Laparoscopic Cholecystectomy", "comment": null, "summary": "Purpose: Accurate assessment of surgical complexity is essential in\nLaparoscopic Cholecystectomy (LC), where severe inflammation is associated with\nlonger operative times and increased risk of postoperative complications. The\nParkland Grading Scale (PGS) provides a clinically validated framework for\nstratifying inflammation severity; however, its automation in surgical videos\nremains largely unexplored, particularly in realistic scenarios where complete\nvideos must be analyzed without prior manual curation. Methods: In this work,\nwe introduce STC-Net, a novel framework for SingleTimestamp-based Complexity\nestimation in LC via the PGS, designed to operate under weak temporal\nsupervision. Unlike prior methods limited to static images or manually trimmed\nclips, STC-Net operates directly on full videos. It jointly performs temporal\nlocalization and grading through a localization, window proposal, and grading\nmodule. We introduce a novel loss formulation combining hard and soft\nlocalization objectives and background-aware grading supervision. Results:\nEvaluated on a private dataset of 1,859 LC videos, STC-Net achieves an accuracy\nof 62.11% and an F1-score of 61.42%, outperforming non-localized baselines by\nover 10% in both metrics and highlighting the effectiveness of weak supervision\nfor surgical complexity assessment. Conclusion: STC-Net demonstrates a scalable\nand effective approach for automated PGS-based surgical complexity estimation\nfrom full LC videos, making it promising for post-operative analysis and\nsurgical training."}
{"id": "2511.04570", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.04570", "abs": "https://arxiv.org/abs/2511.04570", "authors": ["Jingqi Tong", "Yurong Mou", "Hangcheng Li", "Mingzhe Li", "Yongzhuo Yang", "Ming Zhang", "Qiguang Chen", "Tianyi Liang", "Xiaomeng Hu", "Yining Zheng", "Xinchi Chen", "Jun Zhao", "Xuanjing Huang", "Xipeng Qiu"], "title": "Thinking with Video: Video Generation as a Promising Multimodal Reasoning Paradigm", "comment": "36 pages, 14 figures", "summary": "\"Thinking with Text\" and \"Thinking with Images\" paradigm significantly\nimprove the reasoning ability of large language models (LLMs) and Vision\nLanguage Models (VLMs). However, these paradigms have inherent limitations. (1)\nImages capture only single moments and fail to represent dynamic processes or\ncontinuous changes, and (2) The separation of text and vision as distinct\nmodalities, hindering unified multimodal understanding and generation. To\novercome these limitations, we introduce \"Thinking with Video\", a new paradigm\nthat leverages video generation models, such as Sora-2, to bridge visual and\ntextual reasoning in a unified temporal framework. To support this exploration,\nwe developed the Video Thinking Benchmark (VideoThinkBench). VideoThinkBench\nencompasses two task categories: (1) vision-centric tasks (e.g., Eyeballing\nPuzzles), and (2) text-centric tasks (e.g., subsets of GSM8K, MMMU). Our\nevaluation establishes Sora-2 as a capable reasoner. On vision-centric tasks,\nSora-2 is generally comparable to state-of-the-art (SOTA) VLMs, and even\nsurpasses VLMs on several tasks, such as Eyeballing Games. On text-centric\ntasks, Sora-2 achieves 92% accuracy on MATH, and 75.53% accuracy on MMMU.\nFurthermore, we systematically analyse the source of these abilities. We also\nfind that self-consistency and in-context learning can improve Sora-2's\nperformance. In summary, our findings demonstrate that the video generation\nmodel is the potential unified multimodal understanding and generation model,\npositions \"thinking with video\" as a unified multimodal reasoning paradigm."}
{"id": "2511.04601", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2511.04601", "abs": "https://arxiv.org/abs/2511.04601", "authors": ["Yicheng Xiao", "Yu Chen", "Haoxuan Ma", "Jiale Hong", "Caorui Li", "Lingxiang Wu", "Haiyun Guo", "Jinqiao Wang"], "title": "PixCLIP: Achieving Fine-grained Visual Language Understanding via Any-granularity Pixel-Text Alignment Learning", "comment": null, "summary": "While the Contrastive Language-Image Pretraining(CLIP) model has achieved\nremarkable success in a variety of downstream vison language understanding\ntasks, enhancing its capability for fine-grained image-text alignment remains\nan active research focus. To this end, most existing works adopt the strategy\nof explicitly increasing the granularity of visual information processing,\ne.g., incorporating visual prompts to guide the model focus on specific local\nregions within the image. Meanwhile, researches on Multimodal Large Language\nModels(MLLMs) have demonstrated that training with long and detailed textual\ndescriptions can effectively improve the model's fine-grained vision-language\nalignment. However, the inherent token length limitation of CLIP's text encoder\nfundamentally limits CLIP to process more granular textual information embedded\nin long text sequences. To synergistically leverage the advantages of enhancing\nboth visual and textual content processing granularity, we propose PixCLIP, a\nnovel framework designed to concurrently accommodate visual prompt inputs and\nprocess lengthy textual descriptions. Specifically, we first establish an\nautomated annotation pipeline capable of generating pixel-level localized,\nlong-form textual descriptions for images. Utilizing this pipeline, we\nconstruct LongGRIT, a high-quality dataset comprising nearly 1.5 million\nsamples. Secondly, we replace CLIP's original text encoder with the LLM and\npropose a three-branch pixel-text alignment learning framework, facilitating\nfine-grained alignment between image regions and corresponding textual\ndescriptions at arbitrary granularity. Experiments demonstrate that PixCLIP\nshowcases breakthroughs in pixel-level interaction and handling long-form\ntexts, achieving state-of-the-art performance."}
{"id": "2511.04628", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04628", "abs": "https://arxiv.org/abs/2511.04628", "authors": ["Kylie Cancilla", "Alexander Moore", "Amar Saini", "Carmen Carrano"], "title": "NovisVQ: A Streaming Convolutional Neural Network for No-Reference Opinion-Unaware Frame Quality Assessment", "comment": null, "summary": "Video quality assessment (VQA) is vital for computer vision tasks, but\nexisting approaches face major limitations: full-reference (FR) metrics require\nclean reference videos, and most no-reference (NR) models depend on training on\ncostly human opinion labels. Moreover, most opinion-unaware NR methods are\nimage-based, ignoring temporal context critical for video object detection. In\nthis work, we present a scalable, streaming-based VQA model that is both\nno-reference and opinion-unaware. Our model leverages synthetic degradations of\nthe DAVIS dataset, training a temporal-aware convolutional architecture to\npredict FR metrics (LPIPS , PSNR, SSIM) directly from degraded video, without\nreferences at inference. We show that our streaming approach outperforms our\nown image-based baseline by generalizing across diverse degradations,\nunderscoring the value of temporal modeling for scalable VQA in real-world\nvision systems. Additionally, we demonstrate that our model achieves higher\ncorrelation with full-reference metrics compared to BRISQUE, a widely-used\nopinion-aware image quality assessment baseline, validating the effectiveness\nof our temporal, opinion-unaware approach."}
{"id": "2511.04655", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04655", "abs": "https://arxiv.org/abs/2511.04655", "authors": ["Ellis Brown", "Jihan Yang", "Shusheng Yang", "Rob Fergus", "Saining Xie"], "title": "Benchmark Designers Should \"Train on the Test Set\" to Expose Exploitable Non-Visual Shortcuts", "comment": "Project page: https://cambrian-mllm.github.io", "summary": "Robust benchmarks are crucial for evaluating Multimodal Large Language Models\n(MLLMs). Yet we find that models can ace many multimodal benchmarks without\nstrong visual understanding, instead exploiting biases, linguistic priors, and\nsuperficial patterns. This is especially problematic for vision-centric\nbenchmarks that are meant to require visual inputs. We adopt a diagnostic\nprinciple for benchmark design: if a benchmark can be gamed, it will be.\nDesigners should therefore try to ``game'' their own benchmarks first, using\ndiagnostic and debiasing procedures to systematically identify and mitigate\nnon-visual biases. Effective diagnosis requires directly ``training on the test\nset'' -- probing the released test set for its intrinsic, exploitable patterns.\n  We operationalize this standard with two components. First, we diagnose\nbenchmark susceptibility using a ``Test-set Stress-Test'' (TsT) methodology.\nOur primary diagnostic tool involves fine-tuning a powerful Large Language\nModel via $k$-fold cross-validation on exclusively the non-visual, textual\ninputs of the test set to reveal shortcut performance and assign each sample a\nbias score $s(x)$. We complement this with a lightweight Random Forest-based\ndiagnostic operating on hand-crafted features for fast, interpretable auditing.\nSecond, we debias benchmarks by filtering high-bias samples using an\n``Iterative Bias Pruning'' (IBP) procedure. Applying this framework to four\nbenchmarks -- VSI-Bench, CV-Bench, MMMU, and VideoMME -- we uncover pervasive\nnon-visual biases. As a case study, we apply our full framework to create\nVSI-Bench-Debiased, demonstrating reduced non-visual solvability and a wider\nvision-blind performance gap than the original."}
{"id": "2511.04668", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04668", "abs": "https://arxiv.org/abs/2511.04668", "authors": ["Ellis Brown", "Arijit Ray", "Ranjay Krishna", "Ross Girshick", "Rob Fergus", "Saining Xie"], "title": "SIMS-V: Simulated Instruction-Tuning for Spatial Video Understanding", "comment": "Project page: https://ellisbrown.github.io/sims-v", "summary": "Despite impressive high-level video comprehension, multimodal language models\nstruggle with spatial reasoning across time and space. While current spatial\ntraining approaches rely on real-world video data, obtaining diverse footage\nwith precise spatial annotations remains a bottleneck. To alleviate this\nbottleneck, we present SIMS-V -- a systematic data-generation framework that\nleverages the privileged information of 3D simulators to create spatially-rich\nvideo training data for multimodal language models. Using this framework, we\ninvestigate which properties of simulated data drive effective real-world\ntransfer through systematic ablations of question types, mixes, and scales. We\nidentify a minimal set of three question categories (metric measurement,\nperspective-dependent reasoning, and temporal tracking) that prove most\neffective for developing transferable spatial intelligence, outperforming\ncomprehensive coverage despite using fewer question types. These insights\nenable highly efficient training: our 7B-parameter video LLM fine-tuned on just\n25K simulated examples outperforms the larger 72B baseline and achieves\ncompetitive performance with proprietary models on rigorous real-world spatial\nreasoning benchmarks. Our approach demonstrates robust generalization,\nmaintaining performance on general video understanding while showing\nsubstantial improvements on embodied and real-world spatial tasks."}
{"id": "2511.04670", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04670", "abs": "https://arxiv.org/abs/2511.04670", "authors": ["Shusheng Yang", "Jihan Yang", "Pinzhi Huang", "Ellis Brown", "Zihao Yang", "Yue Yu", "Shengbang Tong", "Zihan Zheng", "Yifan Xu", "Muhan Wang", "Daohan Lu", "Rob Fergus", "Yann LeCun", "Li Fei-Fei", "Saining Xie"], "title": "Cambrian-S: Towards Spatial Supersensing in Video", "comment": "Website: https://cambrian-mllm.github.io/", "summary": "We argue that progress in true multimodal intelligence calls for a shift from\nreactive, task-driven systems and brute-force long context towards a broader\nparadigm of supersensing. We frame spatial supersensing as four stages beyond\nlinguistic-only understanding: semantic perception (naming what is seen),\nstreaming event cognition (maintaining memory across continuous experiences),\nimplicit 3D spatial cognition (inferring the world behind pixels), and\npredictive world modeling (creating internal models that filter and organize\ninformation). Current benchmarks largely test only the early stages, offering\nnarrow coverage of spatial cognition and rarely challenging models in ways that\nrequire true world modeling. To drive progress in spatial supersensing, we\npresent VSI-SUPER, a two-part benchmark: VSR (long-horizon visual spatial\nrecall) and VSC (continual visual spatial counting). These tasks require\narbitrarily long video inputs yet are resistant to brute-force context\nexpansion. We then test data scaling limits by curating VSI-590K and training\nCambrian-S, achieving +30% absolute improvement on VSI-Bench without\nsacrificing general capabilities. Yet performance on VSI-SUPER remains limited,\nindicating that scale alone is insufficient for spatial supersensing. We\npropose predictive sensing as a path forward, presenting a proof-of-concept in\nwhich a self-supervised next-latent-frame predictor leverages surprise\n(prediction error) to drive memory and event segmentation. On VSI-SUPER, this\napproach substantially outperforms leading proprietary baselines, showing that\nspatial supersensing requires models that not only see but also anticipate,\nselect, and organize experience."}
{"id": "2511.04675", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04675", "abs": "https://arxiv.org/abs/2511.04675", "authors": ["Jinlai Liu", "Jian Han", "Bin Yan", "Hui Wu", "Fengda Zhu", "Xing Wang", "Yi Jiang", "Bingyue Peng", "Zehuan Yuan"], "title": "InfinityStar: Unified Spacetime AutoRegressive Modeling for Visual Generation", "comment": "NeurIPS 2025 Oral", "summary": "We introduce InfinityStar, a unified spacetime autoregressive framework for\nhigh-resolution image and dynamic video synthesis. Building on the recent\nsuccess of autoregressive modeling in both vision and language, our purely\ndiscrete approach jointly captures spatial and temporal dependencies within a\nsingle architecture. This unified design naturally supports a variety of\ngeneration tasks such as text-to-image, text-to-video, image-to-video, and long\ninteractive video synthesis via straightforward temporal autoregression.\nExtensive experiments demonstrate that InfinityStar scores 83.74 on VBench,\noutperforming all autoregressive models by large margins, even surpassing some\ndiffusion competitors like HunyuanVideo. Without extra optimizations, our model\ngenerates a 5s, 720p video approximately 10x faster than leading\ndiffusion-based methods. To our knowledge, InfinityStar is the first discrete\nautoregressive video generator capable of producing industrial level 720p\nvideos. We release all code and models to foster further research in efficient,\nhigh-quality video generation."}
{"id": "2511.04678", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.04678", "abs": "https://arxiv.org/abs/2511.04678", "authors": ["Yihong Sun", "Xinyu Yang", "Jennifer J. Sun", "Bharath Hariharan"], "title": "Tracking and Understanding Object Transformations", "comment": "NeurIPS 2025", "summary": "Real-world objects frequently undergo state transformations. From an apple\nbeing cut into pieces to a butterfly emerging from its cocoon, tracking through\nthese changes is important for understanding real-world objects and dynamics.\nHowever, existing methods often lose track of the target object after\ntransformation, due to significant changes in object appearance. To address\nthis limitation, we introduce the task of Track Any State: tracking objects\nthrough transformations while detecting and describing state changes,\naccompanied by a new benchmark dataset, VOST-TAS. To tackle this problem, we\npresent TubeletGraph, a zero-shot system that recovers missing objects after\ntransformation and maps out how object states are evolving over time.\nTubeletGraph first identifies potentially overlooked tracks, and determines\nwhether they should be integrated based on semantic and proximity priors. Then,\nit reasons about the added tracks and generates a state graph describing each\nobserved transformation. TubeletGraph achieves state-of-the-art tracking\nperformance under transformations, while demonstrating deeper understanding of\nobject transformations and promising capabilities in temporal grounding and\nsemantic reasoning for complex object transformations. Code, additional\nresults, and the benchmark dataset are available at\nhttps://tubelet-graph.github.io."}
