{"id": "2511.02946", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02946", "abs": "https://arxiv.org/abs/2511.02946", "authors": ["Srikumar Sastry", "Subash Khanal", "Aayush Dhakal", "Jiayu Lin", "Dan Cher", "Phoenix Jarosz", "Nathan Jacobs"], "title": "ProM3E: Probabilistic Masked MultiModal Embedding Model for Ecology", "comment": "21 pages, 16 figures", "summary": "We introduce ProM3E, a probabilistic masked multimodal embedding model for\nany-to-any generation of multimodal representations for ecology. ProM3E is\nbased on masked modality reconstruction in the embedding space, learning to\ninfer missing modalities given a few context modalities. By design, our model\nsupports modality inversion in the embedding space. The probabilistic nature of\nour model allows us to analyse the feasibility of fusing various modalities for\ngiven downstream tasks, essentially learning what to fuse. Using these features\nof our model, we propose a novel cross-modal retrieval approach that mixes\ninter-modal and intra-modal similarities to achieve superior performance across\nall retrieval tasks. We further leverage the hidden representation from our\nmodel to perform linear probing tasks and demonstrate the superior\nrepresentation learning capability of our model. All our code, datasets and\nmodel will be released at https://vishu26.github.io/prom3e."}
{"id": "2511.02996", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.02996", "abs": "https://arxiv.org/abs/2511.02996", "authors": ["Ailar Mahdizadeh", "Puria Azadi Moghadam", "Xiangteng He", "Shahriar Mirabbasi", "Panos Nasiopoulos", "Leonid Sigal"], "title": "SCALE-VLP: Soft-Weighted Contrastive Volumetric Vision-Language Pre-training with Spatial-Knowledge Semantics", "comment": null, "summary": "Vision-language models (VLMs) have demonstrated strong cross-modal\ncapabilities, yet most work remains limited to 2D data and assumes binary\nsupervision (i.e., positive vs. negative pairs), overlooking the continuous and\nstructured dependencies present in volumetric data such as CT. Existing\napproaches often treat volumetric scans as independent 2D slices, compromising\nspatial coherence and underutilizing rich clinical semantics. We propose\nSCALE-VLP, a soft-weighted contrastive vision-language pre-training framework\nthat integrates (i) volumetric spatial semantics to preserve anatomical\nstructure and (ii) domain-aware, knowledge-infused semantics (e.g.,\nradiological ontologies) to guide alignment. This yields structurally\nconsistent and semantically grounded representations under limited supervision,\ndemonstrating strong cross-task transferability (retrieval, report generation,\nand classification), and cross-domain generalizability with consistent gains\nwithout further fine-tuning. In particular, compared to the previous state of\nthe art, SCALE-VLP achieves up to 4.3x higher top-1 CT-report retrieval,\nimproves abnormality classification by 10 points, and reaches ROUGE-L 0.44 and\nBERT-F1 0.89 for report generation. Further, in zero-shot evaluation on an\nout-of-domain external dataset, we observe consistent gains, indicating the\ncross-task and cross-domain generalization ability of SCALE-VLP."}
{"id": "2511.03019", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.03019", "abs": "https://arxiv.org/abs/2511.03019", "authors": ["Wenbo Lu"], "title": "SLIP: Structural-aware Language-Image Pretraining for Vision-Language Alignment", "comment": "Capstone Paper", "summary": "Vision-Language Pretraining (VLP) has achieved remarkable success across\nvarious downstream tasks, but such gains are largely driven by scaling up on\ntraining data. Yet, literature methods treat image-text pairs as isolated\ntraining examples; this neglects the rich relational structure naturally\npresent in many domains, such as e-commerce product co-purchase graphs and\nsocial recommendation networks. Inspired by neuroscientific evidence that human\nencodes knowledge as relationship cognitive maps, we introduce Structure-aware\nLanguage-Image Pretraining (SLIP). SLIP integrates a structural contrastive\nloss to align modalities while also modeling relationships between neighboring\nentities in a structured graph. To support this paradigm, we construct a\nlarge-scale Amazon Product Co-purchase Multimodal Graph Dataset, enabling\nstructured cross-modality supervision at scale. Experiment results show that\nSLIP consistently outperforms CLIP on cross-modal retrieval and classification\ntasks in both zero-shot and few-shot settings, showing the value of relational\nsupervision for cross-modal alignment."}
{"id": "2511.03156", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03156", "abs": "https://arxiv.org/abs/2511.03156", "authors": ["Sagar Shrestha", "Gopal Sharma", "Luowei Zhou", "Suren Kumar"], "title": "Finetuning-Free Personalization of Text to Image Generation via Hypernetworks", "comment": null, "summary": "Personalizing text-to-image diffusion models has traditionally relied on\nsubject-specific fine-tuning approaches such as\nDreamBooth~\\cite{ruiz2023dreambooth}, which are computationally expensive and\nslow at inference. Recent adapter- and encoder-based methods attempt to reduce\nthis overhead but still depend on additional fine-tuning or large backbone\nmodels for satisfactory results. In this work, we revisit an orthogonal\ndirection: fine-tuning-free personalization via Hypernetworks that predict\nLoRA-adapted weights directly from subject images. Prior hypernetwork-based\napproaches, however, suffer from costly data generation or unstable attempts to\nmimic base model optimization trajectories. We address these limitations with\nan end-to-end training objective, stabilized by a simple output regularization,\nyielding reliable and effective hypernetworks. Our method removes the need for\nper-subject optimization at test time while preserving both subject fidelity\nand prompt alignment. To further enhance compositional generalization at\ninference time, we introduce Hybrid-Model Classifier-Free Guidance (HM-CFG),\nwhich combines the compositional strengths of the base diffusion model with the\nsubject fidelity of personalized models during sampling. Extensive experiments\non CelebA-HQ, AFHQ-v2, and DreamBench demonstrate that our approach achieves\nstrong personalization performance and highlights the promise of hypernetworks\nas a scalable and effective direction for open-category personalization."}
{"id": "2511.03001", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.03001", "abs": "https://arxiv.org/abs/2511.03001", "authors": ["Gyeom Hwangbo", "Hyungjoo Chae", "Minseok Kang", "Hyeonjong Ju", "Soohyun Oh", "Jinyoung Yeo"], "title": "LEGO-Eval: Towards Fine-Grained Evaluation on Synthesizing 3D Embodied Environments with Tool Augmentation", "comment": "Work in Progress", "summary": "Despite recent progress in using Large Language Models (LLMs) for\nautomatically generating 3D scenes, generated scenes often lack realistic\nspatial layouts and object attributes found in real-world environments. As this\nproblem stems from insufficiently detailed, coarse-grained instructions,\nadvancing 3D scene synthesis guided by more detailed, fine-grained instructions\nthat reflect real-world environments becomes crucial. Without such realistic\nscenes, training embodied agents in unrealistic environments can lead them to\nlearn priors that diverge significantly from real-world physics and semantics,\ndegrading their performance when deployed. Thus, verifying the alignment\nbetween the fine-grained instruction and the generated scene is essential for\neffective learning. However, current evaluation methods, such as CLIPScore and\nvision-language models (VLMs), often fail to reliably assess such alignment.\nThis shortcoming arises primarily from their shallow understanding of 3D\nscenes, which often leads to improperly grounded scene components. To address\nthis, we introduce LEGO-Eval, an evaluation framework equipped with diverse\ntools designed to explicitly ground scene components, enabling more accurate\nalignment assessments. We also present LEGO-Bench, a benchmark of detailed\ninstructions that specify complex layouts and attributes of real-world\nenvironments. Experiments demonstrate that LEGO-Eval outperforms VLM-as-a-judge\nby 0.41 F1 score in assessing scene-instruction alignment. Benchmarking with\nLEGO-Bench reveals significant limitations in current generation methods.\nAcross all evaluated approaches, success rates reached at most 10% in\ngenerating scenes that fully align with fine-grained instructions."}
{"id": "2511.03137", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2511.03137", "abs": "https://arxiv.org/abs/2511.03137", "authors": ["Shipeng Cen", "Ying Tan"], "title": "Using Multi-modal Large Language Model to Boost Fireworks Algorithm's Ability in Settling Challenging Optimization Tasks", "comment": null, "summary": "As optimization problems grow increasingly complex and diverse, advancements\nin optimization techniques and paradigm innovations hold significant\nimportance. The challenges posed by optimization problems are primarily\nmanifested in their non-convexity, high-dimensionality, black-box nature, and\nother unfavorable characteristics. Traditional zero-order or first-order\nmethods, which are often characterized by low efficiency, inaccurate gradient\ninformation, and insufficient utilization of optimization information, are\nill-equipped to address these challenges effectively. In recent years, the\nrapid development of large language models (LLM) has led to substantial\nimprovements in their language understanding and code generation capabilities.\nConsequently, the design of optimization algorithms leveraging large language\nmodels has garnered increasing attention from researchers. In this study, we\nchoose the fireworks algorithm(FWA) as the basic optimizer and propose a novel\napproach to assist the design of the FWA by incorporating multi-modal large\nlanguage model(MLLM). To put it simply, we propose the concept of Critical\nPart(CP), which extends FWA to complex high-dimensional tasks, and further\nutilizes the information in the optimization process with the help of the\nmulti-modal characteristics of large language models. We focus on two specific\ntasks: the \\textit{traveling salesman problem }(TSP) and \\textit{electronic\ndesign automation problem} (EDA). The experimental results show that FWAs\ngenerated under our new framework have achieved or surpassed SOTA results on\nmany problem instances."}
{"id": "2511.03178", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03178", "abs": "https://arxiv.org/abs/2511.03178", "authors": ["Shreyas C. Dhake", "Jiayuan Huang", "Runlong He", "Danyal Z. Khan", "Evangelos B. Mazomenos", "Sophia Bano", "Hani J. Marcus", "Danail Stoyanov", "Matthew J. Clarkson", "Mobarak I. Hoque"], "title": "SurgAnt-ViVQA: Learning to Anticipate Surgical Events through GRU-Driven Temporal Cross-Attention", "comment": "12 pages", "summary": "Anticipating forthcoming surgical events is vital for real-time assistance in\nendonasal transsphenoidal pituitary surgery, where visibility is limited and\nworkflow changes rapidly. Most visual question answering (VQA) systems reason\non isolated frames with static vision language alignment, providing little\nsupport for forecasting next steps or instrument needs. Existing surgical VQA\ndatasets likewise center on the current scene rather than the near future. We\nintroduce PitVQA-Anticipation, the first VQA dataset designed for forward\nlooking surgical reasoning. It comprises 33.5 hours of operative video and\n734,769 question answer pairs built from temporally grouped clips and expert\nannotations across four tasks: predicting the future phase, next step, upcoming\ninstrument, and remaining duration. We further propose SurgAnt-ViVQA, a video\nlanguage model that adapts a large language model using a GRU Gated Temporal\nCross-Attention module. A bidirectional GRU encodes frame to frame dynamics,\nwhile an adaptive gate injects visual context into the language stream at the\ntoken level. Parameter efficient fine tuning customizes the language backbone\nto the surgical domain. SurgAnt-ViVQA tested upon on PitVQA-Anticipation and\nEndoVis datasets, surpassing strong image and video based baselines. Ablations\nshow that temporal recurrence and gated fusion drive most of the gains. A frame\nbudget study indicates a trade-off: 8 frames maximize fluency, whereas 32\nframes slightly reduce BLEU but improve numeric time estimation. By pairing a\ntemporally aware encoder with fine grained gated cross-attention, SurgAnt-ViVQA\nadvances surgical VQA from retrospective description to proactive anticipation.\nPitVQA-Anticipation offers a comprehensive benchmark for this setting and\nhighlights the importance of targeted temporal modeling for reliable, future\naware surgical assistance."}
{"id": "2511.03146", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.03146", "abs": "https://arxiv.org/abs/2511.03146", "authors": ["Kaiyuan Zhang", "Chenghao Yang", "Zhoufutu Wen", "Sihang Yuan", "Qiuyue Wang", "Chaoyi Huang", "Guosheng Zhu", "He Wang", "Huawenyu Lu", "Jianing Wen", "Jianpeng Jiao", "Lishu Luo", "Longxiang Liu", "Sijin Wu", "Xiaolei Zhu", "Xuanliang Zhang", "Ge Zhang", "Yi Lin", "Guang Shi", "Chaoyou Fu", "Wenhao Huang"], "title": "MME-CC: A Challenging Multi-Modal Evaluation Benchmark of Cognitive Capacity", "comment": null, "summary": "As reasoning models scale rapidly, the essential role of multimodality in\nhuman cognition has come into sharp relief, driving a growing need to probe\nvision-centric cognitive behaviors. Yet, existing multimodal benchmarks either\noveremphasize textual reasoning or fall short of systematically capturing\nvision-centric cognitive behaviors, leaving the cognitive capacity of MLLMs\ninsufficiently assessed. To address this limitation, we introduce MME-CC\n(Multi-Modal Evaluation benchmark of Cognitive Capacity), a vision-grounded\nbenchmark that organizes 11 representative reasoning tasks into three\nfundamental categories of visual information: spatial, geometric, and\nknowledge-based reasoning, and provides fine-grained analyses of MLLMs'\ncognitive capacity across these dimensions. Based on MME-CC, we conduct\nextensive experiments over 16 representative MLLMs. Our study reveals that\nclosed-source models currently lead overall (e.g., 42.66 for Gemini-2.5-Pro vs.\n30.45 for GLM-4.5V), while spatial and geometric reasoning remain broadly weak\n(less than or equal to 30%). We further identify common error patterns,\nincluding orientation mistakes, fragile cross-view identity persistence, and\npoor adherence to counterfactual instructions, and observe that\nChain-of-Thought typically follows a three-stage process (extract -> reason ->\nverify) with heavy reliance on visual extraction. We hope this work catalyzes a\nshift toward treating the cognitive capacity of MLLMs as central to both\nevaluation and model design."}
{"id": "2511.03235", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2511.03235", "abs": "https://arxiv.org/abs/2511.03235", "authors": ["Yi-Fei Liu", "Yi-Long Lu", "Di He", "Hang Zhang"], "title": "From Five Dimensions to Many: Large Language Models as Precise and Interpretable Psychological Profilers", "comment": null, "summary": "Psychological constructs within individuals are widely believed to be\ninterconnected. We investigated whether and how Large Language Models (LLMs)\ncan model the correlational structure of human psychological traits from\nminimal quantitative inputs. We prompted various LLMs with Big Five Personality\nScale responses from 816 human individuals to role-play their responses on nine\nother psychological scales. LLMs demonstrated remarkable accuracy in capturing\nhuman psychological structure, with the inter-scale correlation patterns from\nLLM-generated responses strongly aligning with those from human data $(R^2 >\n0.89)$. This zero-shot performance substantially exceeded predictions based on\nsemantic similarity and approached the accuracy of machine learning algorithms\ntrained directly on the dataset. Analysis of reasoning traces revealed that\nLLMs use a systematic two-stage process: First, they transform raw Big Five\nresponses into natural language personality summaries through information\nselection and compression, analogous to generating sufficient statistics.\nSecond, they generate target scale responses based on reasoning from these\nsummaries. For information selection, LLMs identify the same key personality\nfactors as trained algorithms, though they fail to differentiate item\nimportance within factors. The resulting compressed summaries are not merely\nredundant representations but capture synergistic information--adding them to\noriginal scores enhances prediction alignment, suggesting they encode emergent,\nsecond-order patterns of trait interplay. Our findings demonstrate that LLMs\ncan precisely predict individual participants' psychological traits from\nminimal data through a process of abstraction and reasoning, offering both a\npowerful tool for psychological simulation and valuable insights into their\nemergent reasoning capabilities."}
{"id": "2511.03194", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03194", "abs": "https://arxiv.org/abs/2511.03194", "authors": ["Le Xue", "Gang Feng", "Wenbo Zhang", "Yichi Zhang", "Lanlan Li", "Shuqi Wang", "Liling Peng", "Sisi Peng", "Xin Gao"], "title": "PETWB-REP: A Multi-Cancer Whole-Body FDG PET/CT and Radiology Report Dataset for Medical Imaging Research", "comment": null, "summary": "Publicly available, large-scale medical imaging datasets are crucial for\ndeveloping and validating artificial intelligence models and conducting\nretrospective clinical research. However, datasets that combine functional and\nanatomical imaging with detailed clinical reports across multiple cancer types\nremain scarce. Here, we present PETWB-REP, a curated dataset comprising\nwhole-body 18F-Fluorodeoxyglucose (FDG) Positron Emission Tomography/Computed\nTomography (PET/CT) scans and corresponding radiology reports from 490 patients\ndiagnosed with various malignancies. The dataset primarily includes common\ncancers such as lung cancer, liver cancer, breast cancer, prostate cancer, and\novarian cancer. This dataset includes paired PET and CT images, de-identified\ntextual reports, and structured clinical metadata. It is designed to support\nresearch in medical imaging, radiomics, artificial intelligence, and\nmulti-modal learning."}
{"id": "2511.03180", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2511.03180", "abs": "https://arxiv.org/abs/2511.03180", "authors": ["Shahriyar Zaman Ridoy", "Azmine Toushik Wasi", "Koushik Ahamed Tonmoy"], "title": "BengaliMoralBench: A Benchmark for Auditing Moral Reasoning in Large Language Models within Bengali Language and Culture", "comment": "This manuscript is a preprint currently under review", "summary": "As multilingual Large Language Models (LLMs) gain traction across South Asia,\ntheir alignment with local ethical norms, particularly for Bengali, which is\nspoken by over 285 million people and ranked 6th globally, remains\nunderexplored. Existing ethics benchmarks are largely English-centric and\nshaped by Western frameworks, overlooking cultural nuances critical for\nreal-world deployment. To address this, we introduce BengaliMoralBench, the\nfirst large-scale ethics benchmark for the Bengali language and socio-cultural\ncontexts. It covers five moral domains, Daily Activities, Habits, Parenting,\nFamily Relationships, and Religious Activities, subdivided into 50 culturally\nrelevant subtopics. Each scenario is annotated via native-speaker consensus\nusing three ethical lenses: Virtue, Commonsense, and Justice ethics. We conduct\nsystematic zero-shot evaluation of prominent multilingual LLMs, including\nLlama, Gemma, Qwen, and DeepSeek, using a unified prompting protocol and\nstandard metrics. Performance varies widely (50-91% accuracy), with qualitative\nanalysis revealing consistent weaknesses in cultural grounding, commonsense\nreasoning, and moral fairness. BengaliMoralBench provides a foundation for\nresponsible localization, enabling culturally aligned evaluation and supporting\nthe deployment of ethically robust AI in diverse, low-resource multilingual\nsettings such as Bangladesh."}
{"id": "2511.03471", "categories": ["cs.AI", "cs.HC"], "pdf": "https://arxiv.org/pdf/2511.03471", "abs": "https://arxiv.org/abs/2511.03471", "authors": ["Ming Gu", "Ziwei Wang", "Sicen Lai", "Zirui Gao", "Sheng Zhou", "Jiajun Bu"], "title": "Towards Scalable Web Accessibility Audit with MLLMs as Copilots", "comment": "15 pages. Accepted by AAAI 2026 AISI", "summary": "Ensuring web accessibility is crucial for advancing social welfare, justice,\nand equality in digital spaces, yet the vast majority of website user\ninterfaces remain non-compliant, due in part to the resource-intensive and\nunscalable nature of current auditing practices. While WCAG-EM offers a\nstructured methodology for site-wise conformance evaluation, it involves great\nhuman efforts and lacks practical support for execution at scale. In this work,\nwe present an auditing framework, AAA, which operationalizes WCAG-EM through a\nhuman-AI partnership model. AAA is anchored by two key innovations: GRASP, a\ngraph-based multimodal sampling method that ensures representative page\ncoverage via learned embeddings of visual, textual, and relational cues; and\nMaC, a multimodal large language model-based copilot that supports auditors\nthrough cross-modal reasoning and intelligent assistance in high-effort tasks.\nTogether, these components enable scalable, end-to-end web accessibility\nauditing, empowering human auditors with AI-enhanced assistance for real-world\nimpact. We further contribute four novel datasets designed for benchmarking\ncore stages of the audit pipeline. Extensive experiments demonstrate the\neffectiveness of our methods, providing insights that small-scale language\nmodels can serve as capable experts when fine-tuned."}
{"id": "2511.03206", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03206", "abs": "https://arxiv.org/abs/2511.03206", "authors": ["Kuei-Chun Kao", "Hsu Tzu-Yin", "Yunqi Hong", "Ruochen Wang", "Cho-Jui Hsieh"], "title": "QG-CoC: Question-Guided Chain-of-Captions for Large Multimodal Models", "comment": "16 pages", "summary": "Recently, Multimodal Large Language Models (MLLMs) encounter two key issues\nin multi-image contexts: (1) a lack of fine-grained perception across disparate\nimages, and (2) a diminished capability to effectively reason over and\nsynthesize information from multiple visual inputs. However, while various\nprompting methods aim to describe visual content, many existing studies focus\nprimarily on single-image settings or specific, constrained scenarios. This\nleaves a critical gap in understanding and addressing how MLLMs tackle more\ngeneral and complex multi-image reasoning tasks. Thus, we first extensively\ninvestigate how current prompting methods perceive fine-grained visual details\nand process visual information when dealing with multiple images. Our findings\nreveal that existing prompting methods fall short in attending to needed clues\nand seamlessly integrating perception and reasoning. Inspired by the findings,\nwe propose a new zero-shot prompting method, Question-Guided Chain-of-Captions\n(QG-CoC), a generalized prompting approach that effectively handles problems\nwith an arbitrary number of images. We evaluate our method on various\nopen-source and closed-source MLLMs for multi-image and single-image\nbenchmarks. Experimental results indicate that QG-CoC demonstrates competitive\nperformance across tasks and exhibits robust improvements in the challenging\nscenarios where existing prompting methods fail."}
{"id": "2511.03328", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03328", "abs": "https://arxiv.org/abs/2511.03328", "authors": ["Jindong Hong", "Tianjie Chen", "Lingjie Luo", "Chuanyang Zheng", "Ting Xu", "Haibao Yu", "Jianing Qiu", "Qianzhong Chen", "Suning Huang", "Yan Xu", "Yong Gui", "Yijun He", "Jiankai Sun"], "title": "Benchmarking the Thinking Mode of Multimodal Large Language Models in Clinical Tasks", "comment": null, "summary": "A recent advancement in Multimodal Large Language Models (MLLMs) research is\nthe emergence of \"reasoning MLLMs\" that offer explicit control over their\ninternal thinking processes (normally referred as the \"thinking mode\")\nalongside the standard \"non-thinking mode\". This capability allows these models\nto engage in a step-by-step process of internal deliberation before generating\na final response. With the rapid transition to and adoption of these\n\"dual-state\" MLLMs, this work rigorously evaluated how the enhanced reasoning\nprocesses of these MLLMs impact model performance and reliability in clinical\ntasks. This paper evaluates the active \"thinking mode\" capabilities of two\nleading MLLMs, Seed1.5-VL and Gemini-2.5-Flash, for medical applications. We\nassessed their performance on four visual medical tasks using VQA-RAD and\nROCOv2 datasets. Our findings reveal that the improvement from activating the\nthinking mode remains marginal compared to the standard non-thinking mode for\nthe majority of the tasks. Their performance on complex medical tasks such as\nopen-ended VQA and medical image interpretation remains suboptimal,\nhighlighting the need for domain-specific medical data and more advanced\nmethods for medical knowledge integration."}
{"id": "2511.03019", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.03019", "abs": "https://arxiv.org/abs/2511.03019", "authors": ["Wenbo Lu"], "title": "SLIP: Structural-aware Language-Image Pretraining for Vision-Language Alignment", "comment": "Capstone Paper", "summary": "Vision-Language Pretraining (VLP) has achieved remarkable success across\nvarious downstream tasks, but such gains are largely driven by scaling up on\ntraining data. Yet, literature methods treat image-text pairs as isolated\ntraining examples; this neglects the rich relational structure naturally\npresent in many domains, such as e-commerce product co-purchase graphs and\nsocial recommendation networks. Inspired by neuroscientific evidence that human\nencodes knowledge as relationship cognitive maps, we introduce Structure-aware\nLanguage-Image Pretraining (SLIP). SLIP integrates a structural contrastive\nloss to align modalities while also modeling relationships between neighboring\nentities in a structured graph. To support this paradigm, we construct a\nlarge-scale Amazon Product Co-purchase Multimodal Graph Dataset, enabling\nstructured cross-modality supervision at scale. Experiment results show that\nSLIP consistently outperforms CLIP on cross-modal retrieval and classification\ntasks in both zero-shot and few-shot settings, showing the value of relational\nsupervision for cross-modal alignment."}
{"id": "2511.03260", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03260", "abs": "https://arxiv.org/abs/2511.03260", "authors": ["Rong Wu", "Yim-Sang Yu"], "title": "Enhancing Medical Image Segmentation via Heat Conduction Equation", "comment": null, "summary": "Medical image segmentation has been significantly advanced by deep learning\narchitectures, notably U-Net variants. However, existing models struggle to\nachieve efficient global context modeling and long-range dependency reasoning\nunder practical computational budgets simultaneously. In this work, we propose\na novel hybrid architecture utilizing U-Mamba with Heat Conduction Equation.\nOur model combines Mamba-based state-space modules for efficient long-range\nreasoning with Heat Conduction Operators (HCOs) in the bottleneck layers,\nsimulating frequency-domain thermal diffusion for enhanced semantic\nabstraction. Experimental results on multimodal abdominal CT and MRI datasets\ndemonstrate that the proposed model consistently outperforms strong baselines,\nvalidating its effectiveness and generalizability. It suggest that blending\nstate-space dynamics with heat-based global diffusion offers a scalable and\ninterpretable solution for medical segmentation tasks."}
{"id": "2511.03601", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2511.03601", "abs": "https://arxiv.org/abs/2511.03601", "authors": ["Chao Yan", "Boyong Wu", "Peng Yang", "Pengfei Tan", "Guoqiang Hu", "Yuxin Zhang", "Xiangyu", "Zhang", "Fei Tian", "Xuerui Yang", "Xiangyu Zhang", "Daxin Jiang", "Gang Yu"], "title": "Step-Audio-EditX Technical Report", "comment": null, "summary": "We present Step-Audio-EditX, the first open-source LLM-based audio model\nexcelling at expressive and iterative audio editing encompassing emotion,\nspeaking style, and paralinguistics alongside robust zero-shot text-to-speech\n(TTS) capabilities.Our core innovation lies in leveraging only large-margin\nsynthetic data, which circumvents the need for embedding-based priors or\nauxiliary modules. This large-margin learning approach enables both iterative\ncontrol and high expressivity across voices, and represents a fundamental pivot\nfrom the conventional focus on representation-level disentanglement. Evaluation\nresults demonstrate that Step-Audio-EditX surpasses both MiniMax-2.6-hd and\nDoubao-Seed-TTS-2.0 in emotion editing and other fine-grained control tasks."}
{"id": "2511.03206", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03206", "abs": "https://arxiv.org/abs/2511.03206", "authors": ["Kuei-Chun Kao", "Hsu Tzu-Yin", "Yunqi Hong", "Ruochen Wang", "Cho-Jui Hsieh"], "title": "QG-CoC: Question-Guided Chain-of-Captions for Large Multimodal Models", "comment": "16 pages", "summary": "Recently, Multimodal Large Language Models (MLLMs) encounter two key issues\nin multi-image contexts: (1) a lack of fine-grained perception across disparate\nimages, and (2) a diminished capability to effectively reason over and\nsynthesize information from multiple visual inputs. However, while various\nprompting methods aim to describe visual content, many existing studies focus\nprimarily on single-image settings or specific, constrained scenarios. This\nleaves a critical gap in understanding and addressing how MLLMs tackle more\ngeneral and complex multi-image reasoning tasks. Thus, we first extensively\ninvestigate how current prompting methods perceive fine-grained visual details\nand process visual information when dealing with multiple images. Our findings\nreveal that existing prompting methods fall short in attending to needed clues\nand seamlessly integrating perception and reasoning. Inspired by the findings,\nwe propose a new zero-shot prompting method, Question-Guided Chain-of-Captions\n(QG-CoC), a generalized prompting approach that effectively handles problems\nwith an arbitrary number of images. We evaluate our method on various\nopen-source and closed-source MLLMs for multi-image and single-image\nbenchmarks. Experimental results indicate that QG-CoC demonstrates competitive\nperformance across tasks and exhibits robust improvements in the challenging\nscenarios where existing prompting methods fail."}
{"id": "2511.03272", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03272", "abs": "https://arxiv.org/abs/2511.03272", "authors": ["Shuangquan Lyu", "Steven Mao", "Yue Ma"], "title": "Unified Long Video Inpainting and Outpainting via Overlapping High-Order Co-Denoising", "comment": null, "summary": "Generating long videos remains a fundamental challenge, and achieving high\ncontrollability in video inpainting and outpainting is particularly demanding.\nTo address both of these challenges simultaneously and achieve controllable\nvideo inpainting and outpainting for long video clips, we introduce a novel and\nunified approach for long video inpainting and outpainting that extends\ntext-to-video diffusion models to generate arbitrarily long, spatially edited\nvideos with high fidelity. Our method leverages LoRA to efficiently fine-tune a\nlarge pre-trained video diffusion model like Alibaba's Wan 2.1 for masked\nregion video synthesis, and employs an overlap-and-blend temporal co-denoising\nstrategy with high-order solvers to maintain consistency across long sequences.\nIn contrast to prior work that struggles with fixed-length clips or exhibits\nstitching artifacts, our system enables arbitrarily long video generation and\nediting without noticeable seams or drift. We validate our approach on\nchallenging inpainting/outpainting tasks including editing or adding objects\nover hundreds of frames and demonstrate superior performance to baseline\nmethods like Wan 2.1 model and VACE in terms of quality (PSNR/SSIM), and\nperceptual realism (LPIPS). Our method enables practical long-range video\nediting with minimal overhead, achieved a balance between parameter efficient\nand superior performance."}
{"id": "2511.03635", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03635", "abs": "https://arxiv.org/abs/2511.03635", "authors": ["Apoorva Upadhyaya", "Wolfgang Nejdl", "Marco Fisichella"], "title": "Towards Transparent Stance Detection: A Zero-Shot Approach Using Implicit and Explicit Interpretability", "comment": "Accepted in AAAI CONFERENCE ON WEB AND SOCIAL MEDIA (ICWSM 2026)", "summary": "Zero-Shot Stance Detection (ZSSD) identifies the attitude of the post toward\nunseen targets. Existing research using contrastive, meta-learning, or data\naugmentation suffers from generalizability issues or lack of coherence between\ntext and target. Recent works leveraging large language models (LLMs) for ZSSD\nfocus either on improving unseen target-specific knowledge or generating\nexplanations for stance analysis. However, most of these works are limited by\ntheir over-reliance on explicit reasoning, provide coarse explanations that\nlack nuance, and do not explicitly model the reasoning process, making it\ndifficult to interpret the model's predictions. To address these issues, in our\nstudy, we develop a novel interpretable ZSSD framework, IRIS. We provide an\ninterpretable understanding of the attitude of the input towards the target\nimplicitly based on sequences within the text (implicit rationales) and\nexplicitly based on linguistic measures (explicit rationales). IRIS considers\nstance detection as an information retrieval ranking task, understanding the\nrelevance of implicit rationales for different stances to guide the model\ntowards correct predictions without requiring the ground-truth of rationales,\nthus providing inherent interpretability. In addition, explicit rationales\nbased on communicative features help decode the emotional and cognitive\ndimensions of stance, offering an interpretable understanding of the author's\nattitude towards the given target. Extensive experiments on the benchmark\ndatasets of VAST, EZ-STANCE, P-Stance, and RFD using 50%, 30%, and even 10%\ntraining data prove the generalizability of our model, benefiting from the\nproposed architecture and interpretable design."}
{"id": "2511.03328", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03328", "abs": "https://arxiv.org/abs/2511.03328", "authors": ["Jindong Hong", "Tianjie Chen", "Lingjie Luo", "Chuanyang Zheng", "Ting Xu", "Haibao Yu", "Jianing Qiu", "Qianzhong Chen", "Suning Huang", "Yan Xu", "Yong Gui", "Yijun He", "Jiankai Sun"], "title": "Benchmarking the Thinking Mode of Multimodal Large Language Models in Clinical Tasks", "comment": null, "summary": "A recent advancement in Multimodal Large Language Models (MLLMs) research is\nthe emergence of \"reasoning MLLMs\" that offer explicit control over their\ninternal thinking processes (normally referred as the \"thinking mode\")\nalongside the standard \"non-thinking mode\". This capability allows these models\nto engage in a step-by-step process of internal deliberation before generating\na final response. With the rapid transition to and adoption of these\n\"dual-state\" MLLMs, this work rigorously evaluated how the enhanced reasoning\nprocesses of these MLLMs impact model performance and reliability in clinical\ntasks. This paper evaluates the active \"thinking mode\" capabilities of two\nleading MLLMs, Seed1.5-VL and Gemini-2.5-Flash, for medical applications. We\nassessed their performance on four visual medical tasks using VQA-RAD and\nROCOv2 datasets. Our findings reveal that the improvement from activating the\nthinking mode remains marginal compared to the standard non-thinking mode for\nthe majority of the tasks. Their performance on complex medical tasks such as\nopen-ended VQA and medical image interpretation remains suboptimal,\nhighlighting the need for domain-specific medical data and more advanced\nmethods for medical knowledge integration."}
{"id": "2511.03317", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03317", "abs": "https://arxiv.org/abs/2511.03317", "authors": ["Minghao Fu", "Guo-Hua Wang", "Tianyu Cui", "Qing-Guo Chen", "Zhao Xu", "Weihua Luo", "Kaifu Zhang"], "title": "Diffusion-SDPO: Safeguarded Direct Preference Optimization for Diffusion Models", "comment": "The code is publicly available at\n  https://github.com/AIDC-AI/Diffusion-SDPO", "summary": "Text-to-image diffusion models deliver high-quality images, yet aligning them\nwith human preferences remains challenging. We revisit diffusion-based Direct\nPreference Optimization (DPO) for these models and identify a critical\npathology: enlarging the preference margin does not necessarily improve\ngeneration quality. In particular, the standard Diffusion-DPO objective can\nincrease the reconstruction error of both winner and loser branches.\nConsequently, degradation of the less-preferred outputs can become sufficiently\nsevere that the preferred branch is also adversely affected even as the margin\ngrows. To address this, we introduce Diffusion-SDPO, a safeguarded update rule\nthat preserves the winner by adaptively scaling the loser gradient according to\nits alignment with the winner gradient. A first-order analysis yields a\nclosed-form scaling coefficient that guarantees the error of the preferred\noutput is non-increasing at each optimization step. Our method is simple,\nmodel-agnostic, broadly compatible with existing DPO-style alignment frameworks\nand adds only marginal computational overhead. Across standard text-to-image\nbenchmarks, Diffusion-SDPO delivers consistent gains over preference-learning\nbaselines on automated preference, aesthetic, and prompt alignment metrics.\nCode is publicly available at https://github.com/AIDC-AI/Diffusion-SDPO."}
{"id": "2511.03367", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03367", "abs": "https://arxiv.org/abs/2511.03367", "authors": ["Gahyeon Kim", "Sohee Kim", "Seokju Lee"], "title": "Decoupling Augmentation Bias in Prompt Learning for Vision-Language Models", "comment": "Accepted in Pattern Recognition", "summary": "Recent advances in large-scale vision and language models have led to\nsignificant progress in zero-shot learning tasks. Methods such as CoOp and\nCoCoOp have shown that replacing handcrafted prompts with learnable vectors,\nknown as prompt learning, can result in improved performance. However, these\nmodels often struggle to generalize to entirely unseen categories. While\ntraditional zero-shot learning techniques benefit from various data\naugmentation strategies, prompt learning has primarily focused on text-based\nmodifications, leaving the potential of image-based augmentation largely\nunexplored. In this work, we explore how image-level augmentations,\nparticularly those that introduce attribute-specific variations, can support\nand enhance prompt learning. Our analysis examines the interaction between\nthese augmentations and soft prompt frameworks, revealing their potential to\nimprove generalization. We also identify a limitation in existing methods, such\nas CoCoOp, which do not provide explicit guidance for learning prompts that\nfocus on semantically meaningful visual features. To address this, we propose\nAdding Attributes to Prompt Learning, AAPL, a novel method that introduces\nadversarial token embeddings to decouple superficial visual variations\nintroduced by augmentation from class-relevant semantic representations. This\ndecoupling enables the learned prompts to concentrate on visually\ndiscriminative features that align with the target categories. We conduct\ncomprehensive experiments on eleven benchmark datasets, and AAPL consistently\noutperforms existing methods across few-shot, zero-shot, cross-dataset, and\ndomain generalization settings. Our source code is publicly available at:\nhttps://github.com/Gahyeonkim09/AAPL"}
{"id": "2511.03325", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03325", "abs": "https://arxiv.org/abs/2511.03325", "authors": ["Mauro Orazio Drago", "Luca Carlini", "Pelinsu Celebi Balyemez", "Dennis Pierantozzi", "Chiara Lena", "Cesare Hassan", "Danail Stoyanov", "Elena De Momi", "Sophia Bano", "Mobarak I. Hoque"], "title": "SurgViVQA: Temporally-Grounded Video Question Answering for Surgical Scene Understanding", "comment": null, "summary": "Video Question Answering (VideoQA) in the surgical domain aims to enhance\nintraoperative understanding by enabling AI models to reason over temporally\ncoherent events rather than isolated frames. Current approaches are limited to\nstatic image features, and available datasets often lack temporal annotations,\nignoring the dynamics critical for accurate procedural interpretation. We\npropose SurgViVQA, a surgical VideoQA model that extends visual reasoning from\nstatic images to dynamic surgical scenes. It uses a Masked Video--Text Encoder\nto fuse video and question features, capturing temporal cues such as motion and\ntool--tissue interactions, which a fine-tuned large language model (LLM) then\ndecodes into coherent answers. To evaluate its performance, we curated\nREAL-Colon-VQA, a colonoscopic video dataset that includes motion-related\nquestions and diagnostic attributes, as well as out-of-template questions with\nrephrased or semantically altered formulations to assess model robustness.\nExperimental validation on REAL-Colon-VQA and the public EndoVis18-VQA dataset\nshows that SurgViVQA outperforms existing image-based VQA benchmark models,\nparticularly in keyword accuracy, improving over PitVQA by +11\\% on\nREAL-Colon-VQA and +9\\% on EndoVis18-VQA. A perturbation study on the questions\nfurther confirms improved generalizability and robustness to variations in\nquestion phrasing. SurgViVQA and the REAL-Colon-VQA dataset provide a framework\nfor temporally-aware understanding in surgical VideoQA, enabling AI models to\ninterpret dynamic procedural contexts more effectively. Code and dataset\navailable at https://github.com/madratak/SurgViVQA."}
{"id": "2511.03601", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2511.03601", "abs": "https://arxiv.org/abs/2511.03601", "authors": ["Chao Yan", "Boyong Wu", "Peng Yang", "Pengfei Tan", "Guoqiang Hu", "Yuxin Zhang", "Xiangyu", "Zhang", "Fei Tian", "Xuerui Yang", "Xiangyu Zhang", "Daxin Jiang", "Gang Yu"], "title": "Step-Audio-EditX Technical Report", "comment": null, "summary": "We present Step-Audio-EditX, the first open-source LLM-based audio model\nexcelling at expressive and iterative audio editing encompassing emotion,\nspeaking style, and paralinguistics alongside robust zero-shot text-to-speech\n(TTS) capabilities.Our core innovation lies in leveraging only large-margin\nsynthetic data, which circumvents the need for embedding-based priors or\nauxiliary modules. This large-margin learning approach enables both iterative\ncontrol and high expressivity across voices, and represents a fundamental pivot\nfrom the conventional focus on representation-level disentanglement. Evaluation\nresults demonstrate that Step-Audio-EditX surpasses both MiniMax-2.6-hd and\nDoubao-Seed-TTS-2.0 in emotion editing and other fine-grained control tasks."}
{"id": "2511.03332", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03332", "abs": "https://arxiv.org/abs/2511.03332", "authors": ["Yi Yang", "Yiming Xu", "Timo Kaiser", "Hao Cheng", "Bodo Rosenhahn", "Michael Ying Yang"], "title": "Multi-Object Tracking Retrieval with LLaVA-Video: A Training-Free Solution to MOT25-StAG Challenge", "comment": null, "summary": "In this report, we present our solution to the MOT25-Spatiotemporal Action\nGrounding (MOT25-StAG) Challenge. The aim of this challenge is to accurately\nlocalize and track multiple objects that match specific and free-form language\nqueries, using video data of complex real-world scenes as input. We model the\nunderlying task as a video retrieval problem and present a two-stage, zero-shot\napproach, combining the advantages of the SOTA tracking model FastTracker and\nMulti-modal Large Language Model LLaVA-Video. On the MOT25-StAG test set, our\nmethod achieves m-HIoU and HOTA scores of 20.68 and 10.73 respectively, which\nwon second place in the challenge."}
{"id": "2511.03334", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2511.03334", "abs": "https://arxiv.org/abs/2511.03334", "authors": ["Guozhen Zhang", "Zixiang Zhou", "Teng Hu", "Ziqiao Peng", "Youliang Zhang", "Yi Chen", "Yuan Zhou", "Qinglin Lu", "Limin Wang"], "title": "UniAVGen: Unified Audio and Video Generation with Asymmetric Cross-Modal Interactions", "comment": null, "summary": "Due to the lack of effective cross-modal modeling, existing open-source\naudio-video generation methods often exhibit compromised lip synchronization\nand insufficient semantic consistency. To mitigate these drawbacks, we propose\nUniAVGen, a unified framework for joint audio and video generation. UniAVGen is\nanchored in a dual-branch joint synthesis architecture, incorporating two\nparallel Diffusion Transformers (DiTs) to build a cohesive cross-modal latent\nspace. At its heart lies an Asymmetric Cross-Modal Interaction mechanism, which\nenables bidirectional, temporally aligned cross-attention, thus ensuring\nprecise spatiotemporal synchronization and semantic consistency. Furthermore,\nthis cross-modal interaction is augmented by a Face-Aware Modulation module,\nwhich dynamically prioritizes salient regions in the interaction process. To\nenhance generative fidelity during inference, we additionally introduce\nModality-Aware Classifier-Free Guidance, a novel strategy that explicitly\namplifies cross-modal correlation signals. Notably, UniAVGen's robust joint\nsynthesis design enables seamless unification of pivotal audio-video tasks\nwithin a single model, such as joint audio-video generation and continuation,\nvideo-to-audio dubbing, and audio-driven video synthesis. Comprehensive\nexperiments validate that, with far fewer training samples (1.3M vs. 30.1M),\nUniAVGen delivers overall advantages in audio-video synchronization, timbre\nconsistency, and emotion consistency."}
{"id": "2511.03367", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03367", "abs": "https://arxiv.org/abs/2511.03367", "authors": ["Gahyeon Kim", "Sohee Kim", "Seokju Lee"], "title": "Decoupling Augmentation Bias in Prompt Learning for Vision-Language Models", "comment": "Accepted in Pattern Recognition", "summary": "Recent advances in large-scale vision and language models have led to\nsignificant progress in zero-shot learning tasks. Methods such as CoOp and\nCoCoOp have shown that replacing handcrafted prompts with learnable vectors,\nknown as prompt learning, can result in improved performance. However, these\nmodels often struggle to generalize to entirely unseen categories. While\ntraditional zero-shot learning techniques benefit from various data\naugmentation strategies, prompt learning has primarily focused on text-based\nmodifications, leaving the potential of image-based augmentation largely\nunexplored. In this work, we explore how image-level augmentations,\nparticularly those that introduce attribute-specific variations, can support\nand enhance prompt learning. Our analysis examines the interaction between\nthese augmentations and soft prompt frameworks, revealing their potential to\nimprove generalization. We also identify a limitation in existing methods, such\nas CoCoOp, which do not provide explicit guidance for learning prompts that\nfocus on semantically meaningful visual features. To address this, we propose\nAdding Attributes to Prompt Learning, AAPL, a novel method that introduces\nadversarial token embeddings to decouple superficial visual variations\nintroduced by augmentation from class-relevant semantic representations. This\ndecoupling enables the learned prompts to concentrate on visually\ndiscriminative features that align with the target categories. We conduct\ncomprehensive experiments on eleven benchmark datasets, and AAPL consistently\noutperforms existing methods across few-shot, zero-shot, cross-dataset, and\ndomain generalization settings. Our source code is publicly available at:\nhttps://github.com/Gahyeonkim09/AAPL"}
{"id": "2511.03328", "categories": ["cs.CL", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.03328", "abs": "https://arxiv.org/abs/2511.03328", "authors": ["Jindong Hong", "Tianjie Chen", "Lingjie Luo", "Chuanyang Zheng", "Ting Xu", "Haibao Yu", "Jianing Qiu", "Qianzhong Chen", "Suning Huang", "Yan Xu", "Yong Gui", "Yijun He", "Jiankai Sun"], "title": "Benchmarking the Thinking Mode of Multimodal Large Language Models in Clinical Tasks", "comment": null, "summary": "A recent advancement in Multimodal Large Language Models (MLLMs) research is\nthe emergence of \"reasoning MLLMs\" that offer explicit control over their\ninternal thinking processes (normally referred as the \"thinking mode\")\nalongside the standard \"non-thinking mode\". This capability allows these models\nto engage in a step-by-step process of internal deliberation before generating\na final response. With the rapid transition to and adoption of these\n\"dual-state\" MLLMs, this work rigorously evaluated how the enhanced reasoning\nprocesses of these MLLMs impact model performance and reliability in clinical\ntasks. This paper evaluates the active \"thinking mode\" capabilities of two\nleading MLLMs, Seed1.5-VL and Gemini-2.5-Flash, for medical applications. We\nassessed their performance on four visual medical tasks using VQA-RAD and\nROCOv2 datasets. Our findings reveal that the improvement from activating the\nthinking mode remains marginal compared to the standard non-thinking mode for\nthe majority of the tasks. Their performance on complex medical tasks such as\nopen-ended VQA and medical image interpretation remains suboptimal,\nhighlighting the need for domain-specific medical data and more advanced\nmethods for medical knowledge integration."}
